{
  "backend/main.mo": "Motoko canister implementing the Ribbit backend with storage, access control, and core data models for ponds, posts (lilies), ribbits (comments), likes, user profiles, usernames, tags, and activity tracking, including upgrade role restoration.",
  "feature_evidence.json": "Feature evidence report documenting a frontend change to fix the engagement row placement on the Lily detail page, listing affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI behavior of major frontend pages, components, and hooks across the application.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, page title, and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React application setup configuring TanStack Router routes, theme provider, and global toaster notifications.",
  "frontend/src/components/CommentItem.tsx": "File present but content is empty or not provided, likely intended for a comment/ribbit display component.",
  "frontend/src/components/EmojiReactions.tsx": "File present but content is empty or not provided, likely intended for emoji-based reaction UI.",
  "frontend/src/components/Footer.tsx": "Footer component rendering navigation links (About, All Ponds, Settings) and attribution with styling and icons.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, search, mobile menu, create actions, and user avatar, handling responsive behavior and navigation.",
  "frontend/src/components/Layout.tsx": "Root layout that wraps pages with header, footer, and a mobile left sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Left sidebar navigation with links to main sections and a recent activity list powered by activity queries and route matching.",
  "frontend/src/components/LilyCard.tsx": "Renders a post (lily) card showing title, author or pond avatar, metadata, image handling, and interaction counts, with hooks for likes, views, and comments. Includes logic for liking/unliking posts and dynamic avatar/image display.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a mobile-only slide-in left sidebar drawer with a scrim overlay and body scroll locking when open. Wraps and displays the LeftSidebar component.",
  "frontend/src/components/PostCard.tsx": "File is present but contains no implementation or exports.",
  "frontend/src/components/RibbitEmojiTray.tsx": "File is present but contains no implementation or exports.",
  "frontend/src/components/RibbitItem.tsx": "Displays a single ribbit (comment) with nested replies, user avatar, timestamp, likes, and reply form. Handles creating replies and liking/unliking ribbits via query hooks.",
  "frontend/src/components/RightSidebar.tsx": "Renders a sticky right sidebar showing trending ponds, popular tags, and popular recent posts using aggregated query data. Uses memoization and skeleton loaders for loading states.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and manages a backend actor based on the current Internet Identity. Recreates the actor on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, handling login, logout, persisted identity loading, and login status tracking. Wraps DFINITY AuthClient configuration and lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines a large collection of React Query hooks for interacting with backend data such as ponds, posts, ribbits, users, and memberships. Centralizes querying, mutations, and cache invalidation logic using the actor.",
  "frontend/src/index.css": "Tailwind CSS entry file defining global theme variables for light and dark modes, base styles, and utility classes. Includes color tokens, typography defaults, and a custom hover utility.",
  "frontend/src/lib/formatNumber.ts": "Utility function to format large numbers into compact strings (k, M, B) with one decimal precision. Used for displaying counts like members or likes.",
  "frontend/src/lib/user.ts": "Client-side user identity and recovery utilities backed by localStorage, including anonymous username/user ID generation. Supports a recoverable \"Froggy Phrase\" to back up and restore user settings.",
  "frontend/src/main.tsx": "Frontend entry point that initializes React, React Query, and the Internet Identity provider. Renders the root App component and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static informational page describing the Ribbit platform, its features, and community guidelines. Uses styled sections and separators for layout.",
  "frontend/src/pages/AllPondsPage.tsx": "Page that lists all available ponds with loading states, join status, and navigation links. Integrates data from queries and provides a call-to-action to create a new pond.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a new Lily (post) with support for text, image, or link content. Handles pond selection, tag suggestions, image previews, validation, and submission via mutations.",
  "frontend/src/pages/CreatePondPage.tsx": "Form page for creating a new pond with required metadata, images, and a Froggy Phrase. Includes client-side validation, image previews, and submission through a create pond mutation.",
  "frontend/src/pages/CreatePostPage.tsx": "Placeholder or empty file intended for a post creation page. No implementation present in the provided content.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home feed with left/right sidebars, search support, and tabs for sorting lilies by trending or new. Fetches all lilies or search results and shows loading skeletons or empty states.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily post with image, metadata, view/like counts, and ribbit (comment) thread. Handles creating ribbits, liking/unliking, lightbox image behavior, and loading/error states.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows the about page for a pond, including description, visibility, creation date, moderators, and membership actions. Supports leaving a pond and navigation between feed and about tabs.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond feed page with banner, pond info, join button, and a list of lilies belonging to the pond sorted by newest. Includes sidebars, loading skeletons, and not-found handling.",
  "frontend/src/pages/PostPage.tsx": "This file is empty and currently defines no component or logic.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies associated with a specific tag, with canonical tag redirection and sorting options (newest, most viewed, most replied). Shows related pond context and uses sidebars and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements a comprehensive user settings page for managing username changes, avatar upload, profile info, joined ponds, and froggy phrase backup. Includes admin-only tools, cooldown checks, dialogs, and extensive mutation/query handling.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with class-based dark mode, content paths, centered containers, and extensive theme extensions using OKLCH CSS variables for semantic colors, sidebar/chart palettes, border radii, and accordion animations, plus animate and typography plugins.",
  "project_state.json": "Defines the project’s schema/version and a high-level summary of the ribbit application, along with a structured list of existing frontend and backend features, their descriptions, IDs, and versions for planning and tracking."
}