{
  "backend/main.mo": "Actor implementing storage, access control, user data, posts, ponds, ribbits, tags, likes, and activity-tracking state with various OrderedMap-backed structures.",
  "feature_evidence.json": "Metadata describing a feature update involving typography changes to the desktop header logo text in Header.tsx.",
  "frontend-file-summaries.txt": "Reference file listing short summaries for many frontend components and pages.",
  "frontend/index.html": "HTML entry point loading Tilt Warp font, setting metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and renders the application root.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks to mark or unmark lilies without navigating.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for a comment display component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for emoji reaction functionality.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution text using lucide-react icons.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, search UI, create menu, and avatar, including mobile modal search and desktop dropdown search.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and mobile sidebar drawer that closes on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the left navigation sidebar with route-aware menu highlights and recent activity links. Fetches activity and lily data and adjusts styling for mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, image, user or pond avatar, and interactive actions like like, share, and bookmark. Loads counts and user state via multiple query hooks.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the LeftSidebar that handles body scroll locking and animated slide-in behavior.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond information including stats, moderators, visibility, and join/leave controls. Fetches pond data and user membership state.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages with banner, pond info overlay, and tab navigation between feed and about views.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit (comment) with nesting, avatar, timestamp, likes, and a reply form. Handles creating replies and liking/unliking via query hooks.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular posts using query data with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full-screen mobile search modal showing trending searches and suggestions with input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown for desktop search showing trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags with activity stats using reusable tag modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab list and triggers with underline-focused classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and utility functions.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value after a specified delay using a timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Evaluates a CSS media query and updates state on changes.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks providing CRUD and lookup operations for ponds, membership, and user profiles via an actor API.",
  "frontend/src/index.css": "Tailwind base and utility styles defining color variables, dark mode themes, and custom UI utility classes.",
  "frontend/src/lib/formatNumber.ts": "Utility to shorten large numbers into compact k, M, and B notation.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to alphanumeric lowercase and provides related error messages.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard-based fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly error messages.",
  "frontend/src/lib/user.ts": "Manages local user identity, Froggy Phrase storage, and restoration through localStorage-based backup.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-post view cooldown tracking using timestamps stored in localStorage.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity, and global styles before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the platform, key features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, join status, and navigation to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily with text, image, or link types, tag suggestions, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Form to create a pond with name validation, froggy phrase, images, and submission handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page for creating a post.",
  "frontend/src/pages/HomePage.tsx": "Displays main lily feed with trending/new sorting, search results, and skeleton loading states.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, view counting, and interaction handling.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed pond info, moderators, visibility, and option to leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed, fetching pond data, lilies, and membership state, with join actions and loading/error handling.",
  "frontend/src/pages/PostPage.tsx": "Empty file content provided; no functionality shown.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, fetching each lily and allowing removal, with loading and missing-post states.",
  "frontend/src/pages/TagHubPage.tsx": "Displays top, trending, and newest tags with stats, using tabs and sidebars, and lists tags with loading and empty states.",
  "frontend/src/pages/TagPage.tsx": "Shows lilies for a specific tag with sorting, canonical tag redirection, and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Handles user settings including username changes, avatar uploads, froggy phrase management, pond memberships, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, custom animations, and plugin setup.",
  "project_state.json": "Describes project state, features, identity model, and regressions involving authorization and backend code loss. Includes existing and new feature requests related to UI typography and anonymous identity support."
}