{
  "backend/main.mo": "Main canister actor defining storage, access control, data models, maps, and activity tracking for ponds, posts, ribbits, tags, and user profiles.",
  "feature_evidence.json": "Feature evidence report describing a UI spacing change across multiple frontend pages with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including pages, components, hooks, and utilities.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Application router setup defining all routes, wrapped in a theme provider with toaster notifications.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using bookmark state hooks with click prevention for card navigation.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for a comment display component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for an emoji reactions component.",
  "frontend/src/components/Footer.tsx": "Footer with links to About, All Ponds, and Settings plus attribution and styling.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, mobile menu, search UI, create menu, and avatar handling.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and mobile sidebar drawer that closes on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar navigation with active route highlighting and recent activity list loading.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with avatar, title, image, stats, and like/share interactions using various data-fetching hooks.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a mobile slide-in drawer for the left sidebar with scroll-lock and overlay handling.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond info including stats, moderators, and join/leave controls with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile pond header with banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file.",
  "frontend/src/components/RibbitItem.tsx": "Renders a single ribbit reply with nesting, likes, avatar, timestamp, and a reply form.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and popular recent posts using data from global queries.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a fullscreen mobile search modal showing trending terms, suggestions, and a search input with actions.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under the search bar showing trending searches or suggestions based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags with activity counts in a right sidebar layout.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components for tab lists and triggers with underline-themed classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helpers to add, remove, and check bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches using a reactive hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the backend actor to fetch and mutate ponds, profiles, and related data.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables and custom utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats numbers into short units like k, M, and B with one-decimal rounding.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and provides errors for alphanumeric-only pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard and textarea fallbacks plus toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns optional error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, Froggy Phrase storage, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders About page describing Ribbit, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with join status, loading states, and links to start or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "React page for creating a lily with text, image, or link, handling ponds, tags, validation, previews, and submission.",
  "frontend/src/pages/CreatePondPage.tsx": "Page for creating a pond with name, description, images, and froggy phrase validation, including preview and submission.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for a create-post page.",
  "frontend/src/pages/HomePage.tsx": "Homepage displaying lilies with trending/new sorting, search handling, sidebars, and loading states.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with ribbits, likes, views, image lightbox, and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond info, moderators, metadata, join state, and allows leaving the pond.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond's feed, fetching pond data, lilies, and membership status, with join actions and loading states.",
  "frontend/src/pages/PostPage.tsx": "Empty file content provided; no implementation to summarize.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, loading each lily by ID and allowing removal of missing or saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Renders a hub displaying top, trending, and newest tags with loading states and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting and canonical-tag redirection, including loading and sidebar layout.",
  "frontend/src/pages/UserSettingsPage.tsx": "Manages user settings including username changes, avatar uploads, froggy phrase recovery, joined ponds, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, containers, and plugins for the frontend theme.",
  "project_state.json": "Tracks project metadata, existing features, and a pending request to remove bottom margin from tab components."
}