{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, user/profile maps, posts, ponds, ribbits, likes, activities, and tag stats, plus related data types.",
  "feature_evidence.json": "Lists feature evidence records mapping features to frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.html": "Base HTML file setting up the root element and loading the frontend entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global theme provider, and all application route definitions.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component that uses bookmark state to mark or unmark a lily.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/Footer.tsx": "Renders site footer with navigation links and attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with search, mobile menu toggle, user avatar, and create actions.",
  "frontend/src/components/Layout.tsx": "Root layout composing Header, Footer, route outlet, and mobile sidebar drawer with auto-close on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Navigation sidebar showing main routes and recent activities with active route highlighting.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, image handling, counts, liking, sharing, and optional user avatars.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with body scroll locking and slide-in animation.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave controls.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header with banner, profile image, description, and tab navigation for feed/about.",
  "frontend/src/components/PostCard.tsx": "Empty file.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit reply thread item with nesting, likes, avatar, timestamp, and reply form.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and popular recent posts using fetched pond and lily data with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full-screen mobile search modal showing trending searches or suggestions based on query input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Inline dropdown offering trending searches or suggestions depending on the current search query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags using tag statistics, with modular sections and loading indicators.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab lists and triggers with underline-themed classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs in localStorage with helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, identity loading, and related state.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query matches the current viewport.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for ponds, membership, profiles, and mutations using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode tokens, and custom utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image validation, resizing, and compression with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and returns errors for alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates, normalizes, and returns errors for alphanumeric tags.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, Froggy Phrase storage, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily view cooldown tracking in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing the platform, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, membership indicators, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a new lily with support for text, images, links, tags, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating ponds with validation, image uploads, compression, and preview handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for creating posts.",
  "frontend/src/pages/HomePage.tsx": "Shows the main lily feed with sorting, search results, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with details, ribbits, likes, views, and interaction features.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond details including moderators, visibility, and creation date, with loading states and ability to leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed with lilies, join controls, sorting, and sidebars, handling loading and non‑existent ponds.",
  "frontend/src/pages/PostPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists user‑bookmarked lilies stored locally, loading each lily and allowing removal of unavailable items.",
  "frontend/src/pages/TagHubPage.tsx": "Displays top, trending, and newest tags with stats and navigation, using tabs and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Shows lilies for a specific tag with sorting and canonical‑tag redirection, plus sidebar layout.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings such as username changes, avatar upload, froggy phrase management, admin tools, and joined‑pond management.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, animations, container settings, and plugins for animation and typography.",
  "project_state.json": "Defines project metadata, existing image compression features, and pending feature requests for client-side image compression."
}