{
  "backend/main.mo": "Defines the Ribbit canister with storage mixin, access control, maps for ponds, posts, ribbits, users, tags, likes, and activity tracking, plus type definitions for all entities.",
  "feature_evidence.json": "JSON report listing feature evidence for pond rank display, including involved files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing layouts, pages, and UI behaviors.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, root div, and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and wraps the app with theme provider and toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks hook to add or remove bookmarks for a lily.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, metadata, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Displays emoji reaction buttons with counts and hover/selection interactions.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Navigation header with search, mobile menu, create dropdown, and avatar handling with search recording.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper including header, footer, main outlet, and mobile sidebar drawer with auto-close on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the left navigation sidebar with route-aware highlighting and recent activity items. Supports mobile drawer mode and fetches recent lilies for quick access.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image, and interaction controls like likes, shares, and bookmarks. Fetches counts and user/pond data dynamically.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows an image in a fixed 4:3 frame, adding a blurred backdrop for non‑4:3 images. Handles aspect‑ratio detection and optional click behavior.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide‑in mobile drawer containing the LeftSidebar and disables body scroll while open. Includes overlay scrim and transition effects.",
  "frontend/src/components/PondAboutSidebar.tsx": "Displays pond details, stats, moderators, and join/leave controls. Fetches pond info and membership state and handles join/leave mutations with toasts.",
  "frontend/src/components/PondCardJoinControl.tsx": "Provides a join button for pond cards, handling join mutations and preventing navigation. Shows joined or loading states accordingly.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders the mobile pond header with banner, profile image, description, and tab navigation. Adapts visuals for feed vs. about views.",
  "frontend/src/components/PostCard.tsx": "Shows a post with voting controls, metadata, preview content, image, and tag. Links to the post page and supports optional upvote/downvote callbacks.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit on their profile with avatar, timestamp, comment preview, and link to the related lily.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji picker allowing users to insert preset emojis into ribbits.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit with avatar, content, likes, replies, and nested threading with reply and like interactions.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar image with a tiny blurred placeholder and transitions smoothly once fully loaded.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using fetched data with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile search modal showing trending searches and suggestions with input handling and selection support.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown showing trending searches or query-based suggestions and allows selecting a term.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags with activity counts using reusable sidebar modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and trigger components with underline-based visual styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, storing identity state and exposing login/clear functions.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a media query matches and updates state on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for ponds, posts, and related mutations using the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles, color variables, dark mode settings, and custom utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, or B.",
  "frontend/src/lib/imageCompression.ts": "Client-side utility to validate, resize, and compress images, with GIF animation detection and canvas-based recompression.",
  "frontend/src/lib/pondNameValidation.ts": "Functions to validate, normalize, and generate error messages for alphanumeric-only pond names.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name to produce deterministic rank mappings.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard and textarea fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric-only tags and provides error messages for invalid ones.",
  "frontend/src/lib/user.ts": "Manages user identity, usernames, Froggy Phrase storage, and settings backup in localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps stored in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the Ribbit About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with ranks, join controls, loading states, and navigation to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a lily with text, image, or link, including tag suggestions, pond selection, image compression, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "UI for creating a new pond with name validation, description, optional phrase, and compressed banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Page to create a post of type text, image, or link with pond selection, optional tag, image compression, and submission handling.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, stats, and tabs for posts and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Home feed showing lilies sorted by trending or new, with search integration and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a lily post, handles ribbit creation, view count increments, likes, and image lightbox.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details including moderators, visibility, creation date, and allows leaving the pond.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s lily feed with sorting, membership checks, and join functionality.",
  "frontend/src/pages/PostPage.tsx": "Renders a single post with comments, images, metadata, and allows adding new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists user‑bookmarked lilies stored locally, with loading states and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Displays top, trending, and newest tags with stats and navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a given tag with canonical-tag redirection and sorting controls.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements user settings including username changes, profile editing, avatar upload, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, versions, existing features, and pending feature requests."
}