{
  "backend/main.mo": "Actor defining ponds, posts, ribbits, user profiles, likes, activity tracking, and storage with access control and view count logic.",
  "feature_evidence.json": "Feature evidence report mapping UI changes to affected frontend files and components with associated test IDs.",
  "frontend-file-summaries.txt": "JSON-like list summarizing major frontend files and their roles in routing, layout, pages, components, and hooks.",
  "frontend/index.html": "Base HTML file loading the app root and main TypeScript entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global app structure.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks hook to mark lilies as saved.",
  "frontend/src/components/CommentItem.tsx": "Empty file placeholder for comment display component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty file placeholder for emoji reaction component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section.",
  "frontend/src/components/Header.tsx": "Header with navigation, search, pill‑shaped buttons, mobile menu, and avatar dropdown.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with header, footer, and mobile sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the left navigation sidebar with links and recent activity, highlighting the active route and loading activity items via queries.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post card with avatar, title, metadata, image handling, and interactions like liking and sharing.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Wraps the LeftSidebar in a mobile slide-in drawer with scroll locking and overlay behavior.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond info including stats, moderators, join/leave actions, and visibility, with loading states.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit comment with nesting, liking, replying, avatars, and timestamps using various backend queries.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and popular recent posts derived from queries with loading states.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook to create and manage a backend actor tied to the user's identity and refresh dependent queries on change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using React state synced to localStorage with helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for Internet Identity authentication, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating ponds, profiles, posts, and membership data via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, plus utility classes for UI consistency.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short readable units like k, M, and B.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using the Web Share API with clipboard and manual fallback options, showing toast notifications.",
  "frontend/src/lib/user.ts": "Manages local user data including username, user ID, Froggy Phrase handling, hashing, and settings backup/restore.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking in localStorage to limit view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing the platform, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, join status, and links to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating lilies with support for text, image, link types, ponds, tags, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Form page for creating a new pond with images, froggy phrase validation, and submission handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Home feed showing trending or new lilies with search support and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with image, likes, views, ribbits, and form to submit new ribbits.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed information about a pond, including description, moderators, visibility, and membership actions with loading and error states.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed with lilies, join functionality, sorting, and sidebars, handling loading and not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty file placeholder for an individual post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading, removal, and missing-post handling.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies filtered by tag with sorting, canonical tag redirection, and pond context.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar upload, froggy phrase management, joined ponds, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, spacing, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s state schema, overall system summary, and a list of implemented frontend and backend features with IDs, descriptions, and versioning. Captures routing, UI components, theming, auth, sidebar behavior, discovery widgets, and other app capabilities for build planning."
}