{
  "backend/main.mo": "Defines the Ribbit canister with extensive state maps for ponds, posts, ribbits, users, tags, likes, activities, and storage, along with core type definitions.",
  "backend/migration.mo": "Provides a placeholder migration module that returns the old actor unchanged.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Lists prewritten summaries of all frontend files for documentation or reference.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites and steps to build and deploy the app on the Internet Computer.",
  "frontend/index.html": "Base HTML entry file loading the frontend root element and main TypeScript bundle.",
  "frontend/scripts/combined-update.sh": "Shell script automating backend binding generation, frontend build, and canister deployment with error handling.",
  "frontend/src/App.tsx": "Main React app setting up routes, global theme, Froggy Phrase initialization, and layout structure.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using bookmark state from useBookmarks.",
  "frontend/src/components/CommentItem.tsx": "Displays a comment with avatar, timestamp, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Interactive emoji reaction bar allowing users to react with predefined emojis and view counts.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution text including caffeine.ai branding.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling search, user avatar, mobile sidebar toggle, and responsive search UI.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper including header, footer, routed content, and mobile sidebar drawer control.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activities with route-aware highlighting.",
  "frontend/src/components/LilyCard.tsx": "Displays a post preview with avatar, metadata, image, and interaction buttons like likes and share.",
  "frontend/src/components/LilyImageFrame.tsx": "Image container that preserves 4:3 aspect ratio and adds blurred backdrop for non‑standard image sizes.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with scroll locking and overlay handling.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave controls with loading states.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button logic for pond cards with mutation handling and toast feedback.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile info, and navigation tabs.",
  "frontend/src/components/PostCard.tsx": "Card component displaying a post with voting, metadata, preview content, image, tags, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, timestamp, content, and link to the related lily conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Popover emoji picker allowing quick emoji insertion via buttons.",
  "frontend/src/components/RibbitItem.tsx": "Ribbit comment item with nesting, liking, replying, and avatar loading behavior.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Progressively loads and transitions avatar images using a tiny blurred placeholder.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and popular recent posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full‑screen mobile search modal showing trending searches and suggestions with query input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar showing trending searches or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar listing top, trending, and newest tags using stat modules with loading and empty states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides wrapper components for tab lists and triggers with underline-specific styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helpers to add, remove, or toggle bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context for Internet Identity authentication, loading identities, logging in, and clearing state.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for ponds, users, and other backend data, using the actor for fetching and mutations.",
  "frontend/src/index.css": "Defines Tailwind base/styles, color variables for light/dark themes, and custom utility classes for UI elements.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, or B with simple rounding.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog‑related terms and a large word list used for Froggy Phrase generation.",
  "frontend/src/lib/imageCompression.ts": "Client‑side utility for validating, resizing, and compressing images with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric validation, normalization, and error messaging for pond names.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by stats and assigns deterministic ranks using lilyCount, memberCount, and name.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL via Web Share API or clipboard with toasts for feedback.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, Froggy Phrase generation, and localStorage‑based user settings.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing the platform, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, rank indicators, join controls, and navigation to pond details.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating lilies with support for text, image, and link types, tag suggestions, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating ponds including name validation, descriptions, optional images with compression, and error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Form for creating posts of various types with image compression, pond selection, and submission validation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Renders a user profile page showing avatar, bio info, posts, and comments with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with sorting, search support, sidebars, and loading skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily post with comments, likes, view tracking, and ribbit creation UI.",
  "frontend/src/pages/PondAboutPage.tsx": "Provides an about page for a pond with details, moderators, join/leave actions, and loading states.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed of lilies with sorting, sidebars, banner, and not‑found handling.",
  "frontend/src/pages/PostPage.tsx": "Renders a full post view with metadata, content, image, comments, and a form to submit new comments using query hooks.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lilies, loading each via ID and allowing removal from bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with stats, using tabs and query hooks to load tag lists.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting, canonical tag redirects, and subcategory listings.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, profile editing, avatar upload, pond membership, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, radii, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s state, including issues with AccessControl authorization and several pending feature requests to neutralize permission checks and auto-join pond creators. Contains notes, known issues, and metadata for build planning."
}