{
  "backend/main.mo": "Main actor defining storage, access control, data models, and state for ponds, posts, ribbits, users, tags, and activity tracking.",
  "backend/migration.mo": "Migration module converting old ribbit records to the new structure by adding a nullable image field.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.html": "Base HTML file loading the root React application and setting metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme provider and global toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using bookmark state from a custom hook.",
  "frontend/src/components/CommentItem.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation, avatar loading, and mobile drawer integration.",
  "frontend/src/components/Layout.tsx": "Root layout managing header, footer, mobile sidebar drawer, and route outlet.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar component showing navigation links and recent activity with route-aware highlighting and mobile drawer support.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, counts, avatar, like/share actions, and optional tag/user info.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images with a 4:3 frame and uses a blurred backdrop for non‑4:3 aspect ratios.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the LeftSidebar, handling open state, body scroll lock, and overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond info, stats, moderator profiles, and join/leave controls with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages with banner, profile image, info overlay, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, timestamp, content, optional image, and link to its lily thread.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit post with avatar, content, images, likes, and reply functionality, supporting nested replies and actions via query hooks.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Renders an avatar image with a tiny blurred placeholder and smooth transition once loaded, supporting avatar or img modes.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and popular recent posts using data from query hooks with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full‑screen mobile search modal showing trending searches and dynamic suggestions with query input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown search suggestions component showing trending or suggested terms based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using shared tag-stat modules and query-driven data.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger for underline-style tab navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Hook managing bookmarked lily IDs with localStorage persistence and helper functions to toggle or modify bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Hook that returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useMediaQuery.ts": "Hook that tracks whether a given CSS media query currently matches.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating posts, ribbits, ponds, and related data via an actor.",
  "frontend/src/index.css": "Tailwind CSS base styles and custom design tokens including colors, themes, and utility classes.",
  "frontend/src/lib/formatNumber.ts": "Utility that formats large numbers into compact strings like 1.2k or 3.4M.",
  "frontend/src/lib/imageCompression.ts": "Client-side image validation, resizing, and compression utility with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Helpers to validate, normalize, and provide error messages for alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API or clipboard fallback with user feedback.",
  "frontend/src/lib/tagValidation.ts": "Functions to validate, normalize, and error-check alphanumeric tags.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, Froggy Phrase authentication, and localStorage-based settings backup and restore.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements a per-post cooldown using localStorage timestamps to limit view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing Ribbit's purpose, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with join status, loading states, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create lilies (posts) with text, images, links, tagging, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Provides a form to create new ponds with validation and image upload/compression support.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for a post creation page.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile, avatar, post counts, and tabs for posts and comments with loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with trending/new sorting, search handling, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Renders an individual lily with comments, likes, views, posting ribbits, and image handling.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed pond information including moderators, visibility, creation date, and leave options.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s lily feed with join functionality, sorting, and sidebars.",
  "frontend/src/pages/PostPage.tsx": "Empty file placeholder for a post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading, missing-post handling, and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Renders the tag hub with tabs for top, trending, and newest tags, including loading states and tag list items with stats.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting options, canonical tag redirect logic, and loading handling.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar upload, froggy phrase management, pond membership, and admin tools.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugin settings.",
  "project_state.json": "Describes project state, constraints, issues, and feature requirements for fixing ribbit image uploads and blurred backgrounds."
}