{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, maps for ponds, posts, ribbits, users, tags, likes, and activity tracking, along with related data types.",
  "feature_evidence.json": "Feature evidence report listing two LilyPage-related UI feature requirements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing layout, pages, and component behavior.",
  "frontend/index.html": "HTML entry point setting metadata, root div, favicon, and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, theme provider, and root layout for the frontend application.",
  "frontend/src/components/BookmarkButton.tsx": "Button component that toggles bookmark state for a lily using useBookmarks and displays a bookmark icon.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for the CommentItem component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for the EmojiReactions component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution text including a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Navigation header with search, create menu, mobile/desktop layouts, user avatar, and search dropdown handling.",
  "frontend/src/components/Layout.tsx": "Root layout rendering header, footer, mobile sidebar drawer, and page outlet with auto-closing mobile drawer on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Navigation sidebar with route-aware links and recent activity list, supporting mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image handling, like/share actions, and optional tag/author visibility.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for LeftSidebar with scroll lock and overlay behavior.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, moderators, stats, and join/leave actions with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for a pond with banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user ribbit with avatar, timestamp, content, and link to the related lily.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit with avatar, timestamp, likes, and reply functionality.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular posts using query hooks and memoized sorting.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full‑screen search modal that displays trending searches and query‑based suggestions.",
  "frontend/src/components/search/SearchDropdown.tsx": "Search dropdown showing trending searches or suggestions based on input state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags with activity stats using modular tag list components.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components for tab lists and tab triggers with underline styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages localStorage‑backed bookmarked lily IDs with helpers to add, remove, toggle, and clear.",
  "frontend/src/hooks/useDebounce.ts": "Debounces a value by a configurable delay and returns the delayed result.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login and logout utilities.",
  "frontend/src/hooks/useMediaQuery.ts": "Returns whether a given CSS media query currently matches, updating on changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching, searching, and mutating pond, user, and membership data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base/theme definitions and custom utility classes for colors, layouts, and UI behaviors.",
  "frontend/src/lib/formatNumber.ts": "Utility to format large numbers into short notation like k, M, or B.",
  "frontend/src/lib/imageCompression.ts": "Client-side image validator and compressor that resizes images, handles GIF detection, and outputs compressed blobs.",
  "frontend/src/lib/pondNameValidation.ts": "Helpers to validate, normalize, and produce error messages for alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Utility to share lily links via the Web Share API or clipboard fallback.",
  "frontend/src/lib/tagValidation.ts": "Functions to validate and normalize alphanumeric tags and return error messages.",
  "frontend/src/lib/user.ts": "LocalStorage-based user identity and Froggy Phrase management, including backups and restoration.",
  "frontend/src/lib/viewCountCooldown.ts": "LocalStorage-based cooldown tracker to prevent repeated lily view increments within 5 minutes.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the platform, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a grid of all ponds with join status, loading states, and a link to create a new pond.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a lily with support for text, images, links, tagging, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Form page for creating a new pond including name validation, descriptions, and compressed banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page for post creation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Shows a user's frog profile with avatar, stats, posts, and comments, including loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Homepage feed listing lilies with sorting, search support, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily post with replies, view and like handling, sorting, and image lightbox support.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details including description, moderators, visibility, and membership actions.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond feed with lilies, join-state handling, and mobile/desktop layouts.",
  "frontend/src/pages/PostPage.tsx": "File is empty and contains no implementation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with support for loading, removal, and missing-post handling.",
  "frontend/src/pages/TagHubPage.tsx": "Provides top, trending, and newest tag rankings with navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with canonicalization and sorting options.",
  "frontend/src/pages/UserSettingsPage.tsx": "React page handling user settings including username changes, avatar upload, froggy phrase management, profile saving, pond membership, and admin/tag tools.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Metadata file tracking project state, known issues, and feature requests related to fixing back button placement on the Lily page."
}