{
  "backend/main.mo": "Main actor defining storage, access control, maps, activity tracking, and data types for ponds, posts, ribbits, users, tags, and likes.",
  "backend/migration.mo": "Migration module providing a run function that transforms old actor state into the new actor state.",
  "feature_evidence.json": "Feature evidence report documenting alphanumeric pond name validation and related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files detailing layout, pages, components, and behaviors.",
  "frontend/index.html": "Base HTML document loading the frontend app and setting metadata, favicon, and root mount point.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and all application routes.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button that uses bookmark state hooks and prevents navigation when clicked.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for a comment item component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for emoji reactions component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and a copyright line referencing caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header handling search, navigation, user avatar, dropdowns, and mobile interactions.",
  "frontend/src/components/Layout.tsx": "App layout combining header, footer, sidebar drawer, and route outlet with auto-closing drawer on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Left sidebar with navigation links and recent activity list, highlighting active routes.",
  "frontend/src/components/LilyCard.tsx": "React card displaying a post with avatar, metadata, image handling, like/share actions, and pond/user info.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer component that toggles a left sidebar with body scroll lock and animated overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave functionality with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile image, description, and tab navigation for feed/about.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file for a post display component.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file for an emoji tray component.",
  "frontend/src/components/RibbitItem.tsx": "Displays a reply (ribbit) with avatar, content, likes, nested depth indentation, and reply form handling.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar showing trending ponds, popular tags, and popular recent posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches and suggestions, handling input, selection, and submission.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar showing trending searches or suggestions based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar displaying top, trending, and newest tags using reusable tag stats modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components for tab lists and triggers with underline-based classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to toggle or modify bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, state management, and identity persistence.",
  "frontend/src/hooks/useMediaQuery.ts": "Evaluates a media query and updates the result on changes.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for interacting with the backend actor to fetch and mutate ponds, profiles, searches, and related data.",
  "frontend/src/index.css": "Sets Tailwind base layers, theme color variables for light/dark modes, and custom utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, and B with one decimal precision.",
  "frontend/src/lib/pondNameValidation.ts": "Provides functions to validate, normalize, and error‑check pond names using strict alphanumeric rules.",
  "frontend/src/lib/shareLily.ts": "Implements lily sharing via Web Share API with clipboard and textarea fallbacks plus toast notifications.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase backup/restore, and localStorage settings with simple hashing and obfuscation.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per‑lily view cooldowns in localStorage to prevent repeated increments within five minutes.",
  "frontend/src/main.tsx": "Initializes React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, membership badges, and links to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Page for creating a new lily with text, image, or link, including pond selection, tag suggestions, and form validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond with name validation, description, froggy phrase check, and optional banner/profile images.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/HomePage.tsx": "Homepage displaying trending or new lilies, supporting search and loading states with sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with comments, likes, view tracking, and image lightbox support.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including moderators, visibility, images, and allows leaving the pond.",
  "frontend/src/pages/PondPage.tsx": "Page showing a pond’s feed, joining logic, and lily sorting, with loading and not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file with no content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lilies with loading, missing-post handling, and removal support.",
  "frontend/src/pages/TagHubPage.tsx": "Tag hub showing top, trending, and newest tags with tabbed browsing and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with canonical redirect handling and sorting options.",
  "frontend/src/pages/UserSettingsPage.tsx": "User settings for username management, avatar upload, security phrase, joined ponds, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration including theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Metadata describing project state, feature requests, and pending alphanumeric validation requirements."
}