{
  "backend/main.mo": "Main Motoko canister defining the Ribbit backend with storage, access control, and core data models for ponds, posts, ribbits, users, likes, tags, and activity tracking, including upgrade-safe state restoration.",
  "feature_evidence.json": "Machine-readable report listing implemented frontend features, affected files, dependent components, test IDs, and confidence levels for recent UI changes.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend files, pages, components, and hooks used for documentation or build planning.",
  "frontend/index.html": "Base HTML entry point that mounts the React app, sets metadata, favicon, viewport, and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Application bootstrap that configures TanStack Router routes, wraps the app with theme and toast providers, and defines all top-level pages.",
  "frontend/src/components/CommentItem.tsx": "Comment item component file intended to render individual ribbits/comments, currently empty or omitted in this snapshot.",
  "frontend/src/components/EmojiReactions.tsx": "Placeholder or omitted component file intended for emoji-based reaction UI, with no implementation shown.",
  "frontend/src/components/Footer.tsx": "Footer component rendering navigation links, copyright notice, and attribution branding with consistent styling.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, search, mobile hamburger menu, action buttons, user avatar, and responsive behavior for mobile and desktop.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with header and footer, manages mobile left sidebar drawer state, and closes it on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main left navigation sidebar with links (Home, Ponds, Create, Settings) and a recent activity list, highlighting active routes and supporting a mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post (lily) card with metadata, avatar, image handling, counts (views, likes, comments), and like/unlike interactions, integrating multiple data-fetching hooks.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide-in mobile drawer wrapper for the LeftSidebar, including a scrim overlay and body scroll locking when open.",
  "frontend/src/components/PostCard.tsx": "This file is currently empty and contains no implementation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "This file is currently empty and contains no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Renders a single ribbit (comment) with nested replies, likes, reply creation, avatars, timestamps, and depth-based indentation.",
  "frontend/src/components/RightSidebar.tsx": "Renders the right sidebar showing trending ponds, popular tags, and popular recent posts computed from fetched ponds and lilies data.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook to create and manage an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login, logout, identity persistence, and detailed login status state using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating pond, user, and content data via an actor, including listing/searching ponds, joining/leaving ponds, creating ponds, and fetching user profiles, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens (CSS variables) for light and dark themes, base styles for body and inputs, and a small utility for hover darkening on light buttons.",
  "frontend/src/lib/formatNumber.ts": "Utility function that formats large numbers into compact k/M/B notation with one decimal precision and trimmed trailing zeros.",
  "frontend/src/lib/user.ts": "Client-side user utility managing anonymous usernames, user IDs, and a recoverable \"Froggy Phrase\" using localStorage, including backup, restore, and simple hashing/obfuscation.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up the React Query client, wraps the app with Internet Identity and Query providers, and mounts to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Static informational page describing the Ribbit platform, its features, and community guidelines using styled UI components.",
  "frontend/src/pages/AllPondsPage.tsx": "Page that lists all ponds with loading states, membership badges, and navigation to pond pages, using query hooks to fetch ponds and joined status.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form-driven page for creating a new Lily post (text, image, or link), handling pond selection, tag suggestions, image uploads, validation, and submission via query mutations.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a form page for creating a new pond, handling input validation, image uploads with previews, and submission via the create pond mutation with user feedback via toasts.",
  "frontend/src/pages/CreatePostPage.tsx": "File exists but currently contains no implementation or exported component.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home feed with left/right sidebars, supports searching and sorting lilies by trending or new, and displays loading skeletons or empty states.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily post with its image, metadata, likes, views, and ribbits (comments), and allows users to like/unlike and create new ribbits.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed information about a pond including description, moderators, visibility, and creation date, with actions to navigate tabs or leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s feed with banner and profile imagery, lists lilies belonging to the pond, and allows users to join the pond if not already a member.",
  "frontend/src/pages/PostPage.tsx": "File exists but currently contains no implementation or exported component.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies associated with a specific tag, resolves canonical tags, supports multiple sort options, and shows related pond context with sidebars.",
  "frontend/src/pages/UserSettingsPage.tsx": "React settings page handling username changes with availability/cooldown checks, avatar upload and preview, Froggy Phrase management, joined-ponds listing with leave actions, and admin-only tag tools. It orchestrates many React Query hooks, local state, and shadcn UI components to manage user profile data and mutations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, defining content paths, and extending the theme with CSS-variable-driven colors, radii, animations, and container settings. Includes animate and typography plugins.",
  "project_state.json": "Project metadata file describing Ribbit, its architecture, and a versioned catalog of existing features. Serves as a structured snapshot of backend/frontend capabilities, roles, and major systems for planning and tracking."
}