{
  "backend/main.mo": "Main Motoko actor defining storage, user, post, pond, tag, and activity state maps with associated types and access control initialization.",
  "feature_evidence.json": "Empty feature evidence report structure containing no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including components, pages, and layout behavior.",
  "frontend/DEPLOYMENT.md": "Deployment instructions for building and deploying the app to the Internet Computer using DFX and Node tooling.",
  "frontend/index.html": "Base HTML document that loads the root React application and sets favicon and metadata.",
  "frontend/scripts/combined-update.sh": "Automation script that generates backend bindings, builds the frontend, and deploys canisters with status output and error handling.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes, theme provider, global layout, and Froggy Phrase initialization.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component with customizable colors using the bookmarks hook.",
  "frontend/src/components/CommentItem.tsx": "UI component rendering a comment with avatar, username, timestamp, content, likes, and reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar allowing users to react with predefined emojis and displaying reaction counts.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section including a styled heart icon.",
  "frontend/src/components/Header.tsx": "Implements the main app header with search, navigation, avatar fetching, and responsive mobile/desktop behavior. Manages dropdowns, modals, and search execution with debounced input.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with header, footer, routed content, and a mobile left-sidebar drawer. Automatically closes the drawer on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the left navigation sidebar with active route highlighting and recent activity items. Fetches ponds, activities, and related data for sidebar links.",
  "frontend/src/components/LilyCard.tsx": "Displays an individual lily post with avatar, metadata, stats, like/share actions, and optional tag visibility. Fetches dynamic counts and handles like interactions.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows a lily image with automatic aspect-ratio detection and blurred-backdrop fallback for non‑4:3 images. Supports click handling and lazy loading.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide‑in mobile sidebar drawer with scroll locking and overlay scrim. Hosts the LeftSidebar component inside a mobile drawer layout.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond info including stats, moderators, visibility, and join/leave actions. Fetches pond metadata and handles membership changes with toasts.",
  "frontend/src/components/PondCardJoinControl.tsx": "Provides a join button for pond cards with disabled state when already joined. Executes join actions and shows success/error toasts.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile header for a pond with banner, profile image, description, and tab navigation. Handles routing between feed and about tabs.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting controls, metadata, content preview, optional image, tag badge, and comment/view counts. Supports upvote/downvote callbacks.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Shows a user ribbit on their profile with avatar, linked post title, timestamp, content, and link to conversation. Fetches avatar and associated lily data.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji picker that triggers a callback when an emoji is selected. Uses preset emojis and simple button UI.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit with avatar, content, like button, reply form, and indentation based on depth. Manages liking and creating replies via query hooks.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar image with a blurred placeholder and fade-in transition, supporting avatar or plain img modes. Handles preload success and error gracefully.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and popular recent posts using data-fetch hooks with skeleton loading states. Computes rankings with memoized lists.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal with trending terms, suggestions, and input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under the search bar showing trending searches or suggestions based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using reusable modules with icons and loading states. Fetches tag stats via query hooks.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger, adding underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmark IDs with localStorage persistence and utilities to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login and clear methods.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a media query matches using the browser's matchMedia API.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating ponds, posts, profiles, and other backend data via the actor.",
  "frontend/src/index.css": "Tailwind setup with custom OKLCH theme variables, light/dark modes, and utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, or B.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog terms and a large English word list used for Froggy Phrase generation.",
  "frontend/src/lib/imageCompression.ts": "Validates, loads, resizes, and compresses images client‑side with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric pond‑name validation, normalization, and error messages.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by metrics and returns deterministic rank assignments.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API or falls back to clipboard copying with toasts.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, and Froggy Phrase generation and storage via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per‑lily view cooldown timestamps in localStorage to limit view increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the Ribbit platform, its features, and community guidelines using static content.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with rankings, join controls, and loading states, allowing navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating lilies with support for text, image, and link types, tag suggestions, image compression, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with name validation, description and phrase fields, and image upload with compression and preview.",
  "frontend/src/pages/CreatePostPage.tsx": "Allows users to create posts of various types, handle image uploads with compression, and submit posts to selected ponds.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user profile with avatar, post/comment counts, and tabs for posts and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Renders the home feed with sorting, search handling, and sidebars, showing lily cards or skeletons while loading.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with ribbits, likes, views, and interactions, including view-count tracking and ribbit creation.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including moderators, visibility, and join/leave actions, with loading and not-found handling.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond's feed of lilies with sorting, banners, sidebars, and loading/not-found states.",
  "frontend/src/pages/PostPage.tsx": "Displays a full post with metadata, image/link content, and threaded comments, and allows submitting new comments with sorting options.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows the user's locally bookmarked lilies, loading each bookmark and allowing removal if unavailable.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats in a tabbed layout, with sidebars and loading states.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting, canonical tag redirects, and subcategory listings.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides username management, avatar upload, profile editing, pond membership controls, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, container settings, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state and pending feature requests focused on removing AccessControl checks for normal users and ensuring phrase-hash users and pond creators have seamless access. Includes architectural notes and known authorization issues."
}