{
  "backend/main.mo": "Defines the Ribbit canister with storage, access control, user data, posts, ribbits, ponds, tags, likes, and activity tracking types and state.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files for reference.",
  "frontend/index.html": "HTML entry point loading the React app with favicon and root mount point.",
  "frontend/src/App.tsx": "Configures TanStack Router with all routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Interactive bookmark toggle button using useBookmarks, preventing event bubbling.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with search UI, user avatar, mobile search modal, create menu, and responsive layout behavior.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing header, footer, outlet, and mobile sidebar drawer handling.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activity with lily previews and active-state highlighting.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image handling, like/share actions, and pond/user info.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a mobile drawer wrapper for the left sidebar with body scroll locking and animated open/close.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave controls, including loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile-friendly pond header with banner, profile info, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder component file.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit reply with nested depth, avatar, timestamp, like actions, and a reply form.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full‑screen mobile search modal showing trending terms, suggestions, and an input field.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar showing trending searches or suggestions based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using shared tag modules with loading states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger to render underline-style tab controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper methods to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication and status.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query currently matches.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods for ponds, profiles, search, and mutations.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark mode, and custom utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, and B.",
  "frontend/src/lib/pondNameValidation.ts": "Provides validation, normalization, and error messaging for strictly alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard fallbacks and user feedback toasts.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns error messages for invalid input.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase recovery, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily cooldown tracking for view count increments using localStorage timestamps.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity context, importing global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page explaining Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with join status, loading skeletons, and navigation to pond creation.",
  "frontend/src/pages/CreateLilyPage.tsx": "UI for creating a lily post with text, image, link, pond selection, tag suggestions, validation, and form submission.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a pond with name, description, froggy phrase validation, image uploads, previews, and submission.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page for creating posts.",
  "frontend/src/pages/HomePage.tsx": "Home feed showing lilies with trending/new sorting, search results, sidebars, and loading states.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with comments, likes, views, image lightbox, and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details, moderators, visibility, membership state, and allows users to leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed, loads pond and lily data, and lets users join a pond with loading and not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, loading states, and removal options using SavedLilyItem components.",
  "frontend/src/pages/TagHubPage.tsx": "Presents top, trending, and newest tag rankings with sidebars and tab‑based navigation.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting and canonical‑tag redirection handling.",
  "frontend/src/pages/UserSettingsPage.tsx": "User settings panel supporting username changes, avatar uploads, profile updates, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, layout, animations, and enabled plugins.",
  "project_state.json": "Project metadata describing anonymous‑friendly feature requirements and pending removal of authentication constraints."
}