{
  "backend/main.mo": "Main Motoko canister defining storage, access control, user data maps, activity tracking, ponds, posts, ribbits, and related types and state.",
  "feature_evidence.json": "Feature evidence report listing two UI changes related to the Header search bar logo and styling with linked files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing component responsibilities and layout/behavior details.",
  "frontend/index.html": "Root HTML document loading the app with a favicon, meta tags, and mounting point for the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global toaster, defining all main page routes including pond, lily, tag, and profile pages.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks to display and switch bookmark state with configurable colors.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, username, timestamp, content, and optional like and reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar showing selectable emoji counts with hover animation and selection highlighting.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and caffeine.ai attribution using simple layout and theme styling.",
  "frontend/src/components/Header.tsx": "Header component with navigation, search (desktop and mobile), user avatar, and responsive UI handling including dropdowns and mobile modal search.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header, footer, main outlet, and mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Renders navigation links and recent activity list with active-route highlighting; supports mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post preview with avatar, metadata, image, counts, like/share actions, and navigation links.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images with a blurred backdrop for non-4:3 ratios and a normal frame for 4:3 images, detecting aspect ratio on load.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile slide-in drawer wrapping the LeftSidebar with body scroll locking and scrim overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond info, stats, moderators, and join/leave controls, with loading and visibility handling.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button for pond cards that triggers join mutations and handles pending state and toasts.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for a pond showing banner, profile image, details, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting, metadata, image, tags, and links to pond and post pages.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit with avatar, timestamp, linked post title, and navigation to conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Emoji picker popover for selecting preset emojis.",
  "frontend/src/components/RibbitItem.tsx": "Shows a threaded ribbit with avatar, likes, reply form, and nested indentation.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Progressively loads an avatar image using a tiny blurred placeholder with smooth transition.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent popular posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches or suggestions and handling input, selection, and submission.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown beneath a search bar showing trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar listing top, trending, and newest tags with activity counts and navigation.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger to create underline-style tab components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the current Internet Identity, invalidating related queries on change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using localStorage with functions to toggle, add, remove, clear, and retrieve bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a media query matches and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating ponds, posts, lilies, and related data through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers, theme color variables, dark mode overrides, and utility classes for UI elements.",
  "frontend/src/lib/formatNumber.ts": "Provides a helper to format large numbers into short forms like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image validation, GIF detection, resizing, and compression before upload.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric rules and generates error messages.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name, returning deterministic rank assignments.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API with clipboard fallback and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric-only tags and returns user-friendly errors.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, Froggy Phrase storage, and settings backup using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per-lily view cooldowns in localStorage to limit repeated increments.",
  "frontend/src/main.tsx": "App entrypoint setting up React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page explaining Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with rankings, join controls, and loading states, fetching pond and membership data.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily with text, image, or link, including tag suggestions, image compression, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Allows users to create a pond with name validation, description, froggy phrase, and optional compressed banner/profile images.",
  "frontend/src/pages/CreatePostPage.tsx": "Creates a post of type text, image, or link with pond selection, optional tag, and image compression before submit.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile, posts, and comments with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with search, sorting, and sidebars, fetching posts and showing loading placeholders.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, views, image display, and view-count tracking, allowing posting ribbits and sorting replies.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details including visibility, moderators, and metadata, with loading states and leave-pond functionality.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed, filtering lilies by pond name, handling membership, and rendering sidebars and mobile headers.",
  "frontend/src/pages/PostPage.tsx": "Renders a detailed post view with content, image, link, and threaded comments, allowing users to submit new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies, loading each individually and allowing removal of unavailable or saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Displays top, trending, and newest tags with stats and loading states using tabs and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Shows posts for a specific tag with sorting, canonical tag redirection, and sidebars.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings for username, avatar, profile, ponds, and admin tag tools with various API integrations.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata tracking features, issues, and requirements for updating the desktop search bar logo."
}