{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, and data structures for ponds, posts, ribbits, users, tags, likes, and activity tracking.",
  "feature_evidence.json": "Feature evidence report detailing three UI hover‑background fixes related to LilyCard, including affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of summarized frontend files describing functionality of components and pages across the app.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx with favicon and meta tags.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and main application structure with all page components.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button for lilies using useBookmarks hook, handling click behavior and icon styling.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution to caffeine.ai including a heart icon.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, create menu, mobile modal search, avatar loading, and interaction handling.",
  "frontend/src/components/Layout.tsx": "App layout wrapping pages with header, footer, and a mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar component showing navigation links and recent activity with route-aware highlighting.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with avatar, metadata, actions, and optional tags and user info.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images in a 4:3 frame with optional blurred backdrop for non-standard aspect ratios.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with body scroll lock and overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond info, stats, and join/leave actions with moderator and membership data.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header with banner, profile image, description, and feed/about tabs.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's comment activity with avatar, linked post title, timestamp, and content preview.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a single ribbit with avatar, content, likes, timestamp, and nested replies, supporting liking and replying via query hooks.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar image with a tiny blurred placeholder and transition, supporting both avatar and img render modes.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using data from query hooks with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full-screen mobile search modal showing trending searches or suggestions based on query input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown showing trending searches or suggestions beneath a search bar based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Renders sections for top, trending, and newest tags, each listing tags with activity stats from backend queries.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab lists and triggers using custom underline-themed classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating related queries when the identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper methods to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Returns whether a CSS media query matches, updating reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls into React Query hooks for ponds, profiles, membership, and related mutations.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, dark mode settings, and utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into abbreviated strings like 1.2k or 3M.",
  "frontend/src/lib/imageCompression.ts": "Validates and compresses images on the client, including resizing, format conversion, and animated GIF detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric lowercase format with error messages.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using the Web Share API with clipboard and manual fallback handling.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes tags to alphanumeric lowercase format with optional empty values.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, and Froggy Phrase recovery with localStorage, including hashing, backup, and restore functions.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements localStorage-based cooldown tracking to prevent frequent view count increments per lily post.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Displays an About page describing Ribbit's purpose, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with join status, loading skeletons, and navigation to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating text, image, or link lilies with tag suggestions, validation, and image handling.",
  "frontend/src/pages/CreatePondPage.tsx": "Offers a pond creation form with name validation, Froggy Phrase input, and compressed banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for creating posts.",
  "frontend/src/pages/FrogProfilePage.tsx": "Renders a user's profile with avatar, stats, posts, and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with sorting, search handling, and sidebars, showing loading skeletons when needed.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, views, posting ribbits, and image lightbox, including view-count cooldown logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond details, moderators, visibility, and join/leave actions with loading and not-found handling.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed of lilies with sorting, membership status, and sidebars, including loading and missing-pond states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and removal support, rendering each via LilyCard or fallback.",
  "frontend/src/pages/TagHubPage.tsx": "Renders a tag discovery hub with tabs for top, trending, and newest tags, fetching tag stats and displaying TagItem lists with loading states.",
  "frontend/src/pages/TagPage.tsx": "Displays posts under a specific tag with canonical tag redirection, sortable views, and loading states, wrapped in the app’s sidebar layout.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar upload/compression, profile editing, pond management, and admin tag tools with extensive query/mutation usage.",
  "frontend/tailwind.config.js": "TailwindCSS config extending theme colors, radius, and animations, and enabling typography and animation plugins.",
  "project_state.json": "Project state describing bug‑fix requirements for the LilyCard hover background layering and theme compatibility."
}