{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, and numerous maps for ponds, posts, ribbits, profiles, tags, likes, and activity tracking.",
  "feature_evidence.json": "Lists feature evidence items describing UI modifications to LilyPage and the associated frontend files, components, and requirements.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files, describing layout, component behavior, and page purposes.",
  "frontend/index.html": "Root HTML file that loads the app, sets metadata, and mounts the React application into the #root element.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Renders a bookmark toggle button using useBookmarks, updating UI state without triggering navigation.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and a copyright line referencing caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, search bar, mobile search modal, avatar display, and create-menu actions.",
  "frontend/src/components/Layout.tsx": "Top-level layout wrapping pages with Header, Footer, and a mobile sidebar drawer that closes on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main navigation sidebar with links and recent activity items, adapting styles based on route matching and mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with title, metadata, image handling, like/share actions, and optional user or pond avatar.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a mobile drawer wrapper for the LeftSidebar with scroll locking and animated overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details such as creation info, stats, moderators, and join/leave actions with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile pond header with banner, profile image, description, and tab navigation between feed and about.",
  "frontend/src/components/PostCard.tsx": "Empty file.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file.",
  "frontend/src/components/RibbitItem.tsx": "Displays a single ribbit with nesting, likes, replies, user avatars, and reply form logic.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular posts using data from queries with loading skeletons and fallback messages.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full-screen search modal showing trending searches or suggestions based on input, with selection and submission handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown under a search bar showing trending searches or dynamic suggestions depending on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Renders sections for top, trending, and newest tags with activity stats, using query hooks and reusable tag modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab list and tab triggers using custom underline-themed classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs stored in localStorage with helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a delay when the input changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/clear handlers, and identity loading using Dfinity AuthClient with configurable options.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches using window.matchMedia and a change listener.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating pond, user, and membership data via the actor API.",
  "frontend/src/index.css": "Tailwind base styles and theme variables plus utility classes for UI styling and dark mode.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation such as k, M, and B.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and provides error messages for alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using the Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates, normalizes, and returns error messages for alphanumeric tags.",
  "frontend/src/lib/user.ts": "Manages username, user ID, and Froggy Phrase storage and restoration in localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements a per-lily cooldown system for view counting using timestamps in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the Ribbit About page with platform description, features, and guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, join status, and links to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating lilies with support for text, image, or link posts, tag suggestions, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond including name validation, description, images, and a required multi‑word froggy phrase.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Displays main lily feed with trending/new sorting, search results, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with details, comments, likes, view tracking, and interaction actions.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond details, moderators, visibility, and allows leaving the pond.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed, handles joining ponds, loads pond data and lilies, and shows loading or not‑found states.",
  "frontend/src/pages/PostPage.tsx": "Empty file placeholder for an individual post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, loading states, and allows removing unavailable or saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with loading states and navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a given tag with sorting, canonical tag redirects, and loading UI.",
  "frontend/src/pages/UserSettingsPage.tsx": "User settings panel handling username changes, avatars, profile data, joined ponds, admin features, and Froggy Phrase management.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and enabled plugins.",
  "project_state.json": "JSON file describing the project's state, including existing features, new feature requests, and project metadata. It tracks layout updates, avatar changes, and border additions for the Lily page."
}