{
  "backend/main.mo": "Motoko backend actor defining storage, access control, user data, posts, ribbits, ponds, tags, likes, and activity-tracking types and state.",
  "feature_evidence.json": "Feature evidence report mapping feature changes to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files.",
  "frontend/index.html": "HTML entry point that loads the root div and bootstraps the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and all application routes including tags, ponds, lilies, and settings.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark button that toggles bookmark state for a lily using useBookmarks and updates UI based on state.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for a comment item component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for an emoji reactions component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution, using a border-top design and caffeine.ai credit.",
  "frontend/src/components/Header.tsx": "Opaque global header with search, navigation links, mobile menu, and user avatar handling.",
  "frontend/src/components/Layout.tsx": "Root layout managing header, footer, main content, and mobile left sidebar drawer with auto-close on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar navigation component with route-aware active states and recent activity list rendering.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, image handling, avatar selection, like/share actions, and counts.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the LeftSidebar with body scroll lock and animated overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave actions with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile image, description, and feed/about tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file with no implementation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit (comment) with nesting, avatar, likes, timestamp, and reply form handling.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar component showing trending ponds, popular tags, and recent popular posts using query data and memoized sorting.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar for tag hub displaying top, trending, and newest tags via reusable modules and tag stats queries.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous actor instance and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Hook managing bookmarked lily IDs with localStorage persistence and add/remove/toggle utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication with helpers for login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating ponds, tags, profiles, and related backend data using the actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, theming, and utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Utility formatting large numbers into short notation like k, M, or B.",
  "frontend/src/lib/shareLily.ts": "Provides a shareLily function that uses Web Share API or falls back to clipboard copying with toast notifications.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, and Froggy Phrase security with localStorage, including backup and restore logic.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking in localStorage with helpers to check, record, and clear cooldowns.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, join indicators, and links to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a new lily with support for text, images, links, pond selection, tags, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a pond with fields, Froggy Phrase validation, image uploads, previews, and submit handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty file containing no implementation.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with search, sorting, and sidebars, fetching and rendering lily cards or skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with image, likes, ribbits, view count logic, and actions like replying, liking, and sharing.",
  "frontend/src/pages/PondAboutPage.tsx": "Renders detailed pond info including moderators, visibility, creation date, and leave‑pond controls.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed, showing its lilies, join controls, and sidebars, with loading and not‑found states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies, loading each individually and allowing removal of unavailable items.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with tabbed navigation and tag statistics, plus sidebars.",
  "frontend/src/pages/TagPage.tsx": "Renders a tag detail page that loads canonicalized tag data, fetches lilies by tag with sorting, and displays them with sidebars and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements a comprehensive user settings interface with username management, avatar upload, Froggy Phrase handling, profile editing, pond membership actions, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom theme colors, animations, container settings, and plugins for animations and typography.",
  "project_state.json": "Defines the project’s state, versioning, and detailed feature catalog for the ribbit platform, including frontend/back-end functionality descriptions."
}