{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, maps for ponds, posts, ribbits, users, tags, likes, activities, and related data types. Provides stubs for access control and structures for posts, comments, ponds, and activity tracking.",
  "feature_evidence.json": "Empty feature evidence report container with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend components and pages used elsewhere in the project.",
  "frontend/DEPLOYMENT.md": "Deployment instructions for running, building, and deploying the Ribbit app on the Internet Computer.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx with metadata and favicon.",
  "frontend/scripts/combined-update.sh": "Shell script that generates backend bindings, builds frontend assets, and deploys canisters with colored status output and failure handling.",
  "frontend/src/App.tsx": "Main React router setup defining all application routes and wrapping the app with theme provider and toaster.",
  "frontend/src/components/BookmarkButton.tsx": "UI button component that toggles bookmark state for a lily using the useBookmarks hook.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, username, timestamp, content, and optional like and reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar allowing users to react with predefined emojis, showing counts and selection state.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with search, user avatar menu, responsive mobile/desktop behavior, and search execution logic.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper rendering header, footer, main content, and mobile sidebar drawer with automatic drawer closing on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activities, highlighting active routes and supporting mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post preview with avatar, metadata, counts, like/share actions, optional tags, and image frame.",
  "frontend/src/components/LilyImageFrame.tsx": "Image display component that maintains 4:3 aspect ratio and applies a blurred backdrop for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile slide‑in drawer wrapping the LeftSidebar with scroll lock and overlay handling.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderator info, and join/leave controls with loading states.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button for pond cards handling join mutations and preventing navigation when clicked.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages showing banner, profile info, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting, metadata, preview content, image, tag, and stats.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit activity with avatar, linked post reference, timestamp, and content.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji selector for adding quick reactions.",
  "frontend/src/components/RibbitItem.tsx": "Shows an individual ribbit with nesting, likes, replies, and avatar loading logic.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Handles blurred avatar placeholder loading with smooth transition for avatar images.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar showing trending ponds, popular tags, and recent popular posts using query data.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches or suggestions and handling input and selection.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar showing trending searches or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar presenting top, trending, and newest tags with activity counts.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger with underline-specific class names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a delay when the input changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client behavior.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches in the browser.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for pond, post, and user-related backend operations using the actor system.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables for light and dark themes, and custom utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into shortened strings like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image validation, resizing, and compression with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric format with error messaging.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name to assign deterministic ranks.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard fallbacks and toast feedback.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags with optional input support.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase backup, and restoration using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform info, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with ranks, join controls, loading states, and navigation to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily with text, image, or link types, tag suggestions, image compression, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Form to create a new pond with name validation, description, optional images, and client‑side image compression.",
  "frontend/src/pages/CreatePostPage.tsx": "Form to create text, image, or link posts with pond selection, image compression, and client‑side validation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user profile with avatar, stats, posts, and comments, handling loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Home feed showing all or searched lilies with trending/new sort and skeleton loading states plus sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with ribbits, likes, views, image lightbox, and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details, moderators, visibility, join/leave actions, and loading/fallback states.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s lily feed with sorting, banner, sidebars, and loading/not-found handling.",
  "frontend/src/pages/PostPage.tsx": "Full post view showing content, image/link, metadata, and threaded comments with sorting and creation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with removal, loading states, and fallback for unavailable posts.",
  "frontend/src/pages/TagHubPage.tsx": "Renders a tag hub with tabs for top, trending, and newest tags, fetching tag stats and displaying lists with loading states and sidebars. Includes TagItem and TagList components for ranked tag display.",
  "frontend/src/pages/TagPage.tsx": "Displays a specific tag's page with canonical redirect, tag stats, subcategories, and sorted lilies. Handles loading states and includes left and right sidebars.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides a multi-tab user settings interface for username changes, avatar uploads, profile editing, pond management, and admin tools. Integrates many backend queries and handles validation, debouncing, and UI state.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, container settings, animations, and plugins for the project. Extends theme tokens for UI components and layout.",
  "project_state.json": "Describes project state and requirements focused on removing backend authorization to allow full anonymous access. Lists pending feature requests and known issues related to authorization checks."
}