{
  "backend/main.mo": "Defines the Ribbit canister’s state, data types, maps, likes, activity tracking, tag systems, user identity linkages, and integrates blob storage and access control.",
  "feature_evidence.json": "Lists evidence for a frontend feature enabling automatic Froggy Phrase access control initialization, including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of key frontend files for reference in build or documentation workflows.",
  "frontend/DEPLOYMENT.md": "Explains prerequisites and steps for deploying or updating the Ribbit app on the Internet Computer.",
  "frontend/index.html": "Basic HTML entry point loading the frontend’s root React mount and main script.",
  "frontend/scripts/combined-update.sh": "Shell script automating backend binding generation, frontend build, and canister deployment with error handling.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, theme, and automatic Froggy Phrase generation and access-control initialization.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark button component that toggles bookmark state for a lily with configurable colors.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, timestamp, content, and optional like and reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar supporting selectable and hoverable reactions with counts.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section using a heart icon.",
  "frontend/src/components/Header.tsx": "Renders the main site header with navigation, search handling for mobile and desktop, and user avatar actions. Manages search dropdowns, debouncing, navigation, and mobile sidebar toggle.",
  "frontend/src/components/Layout.tsx": "Defines the page layout with header, footer, outlet content, and a mobile sidebar drawer. Automatically closes the drawer on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Displays the left sidebar navigation with active-state links and recent activity items. Fetches recent activities and pond/lily data for contextual links.",
  "frontend/src/components/LilyCard.tsx": "Shows a card view for a lily post with avatar, metadata, stats, image, and actions like like, share, and bookmark. Fetches counts, pond info, and user avatar data.",
  "frontend/src/components/LilyImageFrame.tsx": "Displays an image with automatic aspect‑ratio detection, applying a blurred backdrop for non‑4:3 images. Wraps the image in a clickable, responsive frame.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide‑in mobile sidebar drawer with a scrim overlay and body scroll lock. Renders the LeftSidebar inside a mobile-friendly drawer panel.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed information about a pond including stats, moderators, visibility, and join/leave controls. Loads pond metadata and membership state, with skeletons for loading.",
  "frontend/src/components/PondCardJoinControl.tsx": "Provides a join button for a pond card with success/error toasts. Handles join interactions while preventing navigation when clicked.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for a pond showing banner, profile image, description, and navigation tabs for feed/about.",
  "frontend/src/components/PostCard.tsx": "Displays a post preview with voting, metadata, content, image, tag, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit in their profile with avatar, timestamp, content, and link to the related post.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Emoji picker popover allowing quick emoji selection for ribbits.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit with nesting, likes, replies, and an expandable reply form.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar with a tiny blurred placeholder that transitions to the final image once loaded.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent popular posts with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches or suggestions and handling input and selection.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under the search bar displaying trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar module displaying top, trending, and newest tags with activity counts.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab list and tab triggers with underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInitializeFroggyPhraseAccessControl.ts": "Initializes Froggy Phrase access control once per session when an actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity state, login/logout functions, and identity loading via AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor methods in React Query hooks for fetching and mutating ponds, lilies, users, roles, and related data.",
  "frontend/src/index.css": "Tailwind setup defining theme CSS variables for light and dark modes plus utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Provides a helper to format large numbers into k, M, or B suffixes.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog-related terms and a large general word list for generating Froggy Phrases.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image validation, resizing, and compression with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric format with error messaging.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name, returning a rank map.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard and fallback support.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns error messages for invalid input.",
  "frontend/src/lib/types.ts": "Defines local TypeScript interfaces for activity and tag statistics types.",
  "frontend/src/lib/user.ts": "Manages user IDs, usernames, backups, and generation/storage of 12‑word Froggy Phrases.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily view cooldown tracking via timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays an About page describing the Ribbit platform, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Fetches and lists all ponds with join controls, loading states, and computed ranking badges.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a lily with text, image, or link content, including tag suggestions, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with name validation, description fields, and image uploads with compression and previews.",
  "frontend/src/pages/CreatePostPage.tsx": "Form for creating text, image, or link posts with validation, pond selection, optional tagging, and image compression.",
  "frontend/src/pages/FrogProfilePage.tsx": "Renders a user profile page showing avatar, stats, posts, and comments with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the home feed with trending/new sorting, search results, sidebars, and loading skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily post with comments, likes, views, image lightbox, and view‑increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond metadata, moderators, visibility, and join/leave actions with loading and not‑found handling.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s feed sorted by newest, with sidebars, banner, and loading/not‑found states.",
  "frontend/src/pages/PostPage.tsx": "Displays a single post with content, image, link, metadata, and threaded comments, and allows users to submit new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows bookmarked lily posts stored locally and renders each with loading, missing, or card states plus removal support.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with ranking and stats, switching between categories via tabs.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag, auto-redirects to the canonical tag, and shows subcategories with sort options.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings for username changes, avatar uploads, pond membership management, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Describes project metadata, known issues, and feature requests related to Froggy-Phrase user role initialization."
}