{
  "backend/main.mo": "Primary backend actor defining storage maps, types, and state for ponds, posts, ribbits, users, tags, likes, and activity tracking.",
  "backend/migration.mo": "Migration module converting pond member lists from Principals to Text identifiers and producing a new actor state.",
  "feature_evidence.json": "Metadata report linking a frontend feature update to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI behavior of various frontend files.",
  "frontend/DEPLOYMENT.md": "Guide explaining prerequisites and steps for deploying the Ribbit application to the Internet Computer.",
  "frontend/index.html": "HTML entry point that loads the frontend root element and main TypeScript bundle.",
  "frontend/scripts/combined-update.sh": "Bash script automating backend binding generation, frontend build, and canister deployment.",
  "frontend/src/App.tsx": "Main React application wiring routes, layout, theme provider, and Froggy Phrase initialization.",
  "frontend/src/components/BookmarkButton.tsx": "Button component that toggles bookmark state for a lily using useBookmarks.",
  "frontend/src/components/CommentItem.tsx": "Renders an individual comment with avatar, timestamp, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Component showing interactive emoji reaction buttons with counts and hover/selection states.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links and a credit message.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, search, user avatar, and mobile interactions.",
  "frontend/src/components/Layout.tsx": "Wraps page layout with header, footer, and mobile sidebar drawer control.",
  "frontend/src/components/LeftSidebar.tsx": "Displays the left navigation menu and recent activity list, highlighting active routes.",
  "frontend/src/components/LilyCard.tsx": "Shows a lily post preview with avatar, metadata, image, and interaction buttons.",
  "frontend/src/components/LilyImageFrame.tsx": "Displays images with aspect‑ratio handling and optional blurred backdrop for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a mobile slide‑in drawer containing the left sidebar and handles body scroll lock.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond information, stats, moderators, and join/leave controls.",
  "frontend/src/components/PondCardJoinControl.tsx": "Renders a join button for pond cards, handling join actions and states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile info, and navigation tabs for feed and about.",
  "frontend/src/components/PostCard.tsx": "Card component rendering post metadata, content preview, image, tags, and vote/comment/view stats.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, linked post title, timestamp, and link to view the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Popover tray offering quick emoji reactions and invoking a callback on selection.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit with avatar, timestamp, likes, and reply form, handling like and reply actions.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar image with a tiny blurred placeholder and smooth transition, supporting avatar or img modes.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent popular posts based on fetched data.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full‑screen search modal showing trending searches and suggestions with input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Desktop search dropdown displaying trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar displaying top, trending, and newest tags using reusable tag stats modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger with underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper actions.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities and exposing login and clear methods.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches using a React hook.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for ponds, profiles, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark modes, and custom utilities for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation such as k, M, and B.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog-related terms and a large word list used for Froggy Phrase generation.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image validation, resizing, and compression while preserving animated GIFs.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and provides error messages for pond names using alphanumeric rules.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds deterministically by lilyCount, memberCount, and name, returning a rank map.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API with clipboard and textarea fallbacks.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns related error messages.",
  "frontend/src/lib/user.ts": "Manages user identity, settings, and Froggy Phrase generation/storage via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider, importing global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page describing the Ribbit platform, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with ranking, join controls, loading states, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a lily with text, image, or link, including tag suggestions, image compression, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with validation and image upload/compression for banner and profile images.",
  "frontend/src/pages/CreatePostPage.tsx": "Offers a post creation interface supporting text, image, or link posts with pond selection and image compression.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, stats, posts, and comments using tabs and loading/not-found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with trending/new sorting, search handling, and loading placeholders.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily with ribbits, likes, views, and image handling, including submission and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond info, moderators, visibility, join/leave actions, and loading/not-found handling.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond's feed of lilies with sorting, sidebars, mobile header, and loading/not-found states.",
  "frontend/src/pages/PostPage.tsx": "Displays a single post with metadata, media, threaded comments, and a form for submitting new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies and allows removing individual bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats and navigation to each tag page.",
  "frontend/src/pages/TagPage.tsx": "Shows lilies for a specific tag with sorting, canonical redirects, and subcategory display.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar upload, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, containers, animations, and plugins for the project.",
  "project_state.json": "Tracks project state for fixing pond membership issues caused by mixed identity systems. Lists architectural notes, known issues, existing features, and new backend migration and identity-consistency feature requests."
}