{
  "backend/main.mo": "Main Motoko canister defining Ribbit’s core state maps, data types, access control, storage mixins, and activity/like/user systems.",
  "backend/migration.mo": "Migration module transforming pond member lists by inserting creator first and recalculating memberCount.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference or documentation.",
  "frontend/DEPLOYMENT.md": "Deployment guide describing prerequisites and steps for deploying Ribbit to the Internet Computer.",
  "frontend/index.html": "HTML entry point loading the frontend bundle and setting metadata and root element.",
  "frontend/scripts/combined-update.sh": "Deployment script automating bindings generation, frontend build, and canister deployment with error handling.",
  "frontend/src/App.tsx": "Application root configuring routes, layout, theme provider, and Froggy Phrase initialization.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks hook to manage lily save state.",
  "frontend/src/components/CommentItem.tsx": "UI component rendering a comment with avatar, metadata, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar supporting selection, hover effects, and reaction counts.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section including caffeine.ai credit.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, search (desktop dropdown and mobile modal), and user avatar, handling navigation and search execution.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with header, footer, routed content, and mobile sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activity items with active‑route highlighting.",
  "frontend/src/components/LilyCard.tsx": "Card displaying a lily post with avatar, metadata, image, likes, views, and sharing, using multiple data-fetch hooks.",
  "frontend/src/components/LilyImageFrame.tsx": "Image frame that adapts layout with a blurred backdrop for non‑4:3 images and standard display for 4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with scroll locking and animated overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave controls with loading states.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button control for pond cards, handling join mutation and preventing navigation.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile info, and tab navigation for feed and about pages.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting, metadata, content preview, optional image, tag, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit with avatar, timestamp, linked post title, and link to the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "A popover emoji picker allowing users to select preset emojis.",
  "frontend/src/components/RibbitItem.tsx": "Displays a threaded ribbit with avatar, timestamp, likes, and reply functionality with nesting support.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads a blurred avatar placeholder that transitions to the full image once loaded, supporting avatar or img modes.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar showing trending ponds, popular tags, and recent popular posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches or suggestions and handling query input and selection.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar with trending searches or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar displaying top, trending, and newest tags using reusable tag stats modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around tab list and tab trigger components with underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions for modifying the list.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state across the app.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating pond, user, and search-related backend data via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light/dark modes, and custom utility classes for UI components.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, and B.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog-related terms and a large word list used for Froggy Phrase generation.",
  "frontend/src/lib/imageCompression.ts": "Provides client-side image validation, resizing, and compression logic with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes alphanumeric pond names and returns error messages for invalid input.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lilyCount, memberCount, and name, producing deterministic rank mappings.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API or falls back to clipboard copy with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Handles alphanumeric tag validation, normalization, and user-facing error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, Froggy Phrase generation/storage, and settings backups in localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing the platform, its features, and community guidelines with styled sections.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, join controls, and rank indicators, allowing navigation to individual ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily with text, image, or link content, tag suggestions, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond including validation, banner and profile image upload with compression, and error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Post creation page supporting text, image, or link posts with pond selection, validation, and optional tag and image upload.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, stats, posts, and comments using tabs and query hooks.",
  "frontend/src/pages/HomePage.tsx": "Shows the main lily feed with sorting, search handling, and loading states using sidebars and LilyCard components.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily post with comments, likes, views, image viewer, and ribbit creation plus view count logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond information including moderators, visibility, join/leave actions, and metadata.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s lily feed with sorting, banners, sidebars, and loading or not-found states.",
  "frontend/src/pages/PostPage.tsx": "Displays a full post with comments, handles loading states, sorting, and submitting new ribbit comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows bookmarked lily posts stored locally and allows removing individual bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats and navigation, using tabs and sidebar layout.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting, canonical tag redirects, and subcategory listings.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user account settings including username changes, avatar upload, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Defines project state, architectural notes, and known issues, plus feature requests focused on removing AccessControl barriers and fixing pond creator auto-join behavior."
}