{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control setup, and data structures for ponds, posts, ribbits, users, tags, likes, and activity tracking.",
  "feature_evidence.json": "Contains feature evidence reports listing feature requirements, associated files, components, and testing identifiers.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files, describing layouts, pages, and components.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads src/main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router configuration, routes, and global theme/toaster providers for the React app.",
  "frontend/src/components/BookmarkButton.tsx": "Renders a bookmark toggle button using bookmark state and styling based on active/inactive status.",
  "frontend/src/components/CommentItem.tsx": "Displays a comment with avatar, timestamp, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Shows interactive emoji reaction buttons with hover effects, counts, and selection handling.",
  "frontend/src/components/Footer.tsx": "Simple footer with navigation links and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, search (desktop and mobile), user avatar, and responsive behaviors including dropdowns and modals.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, footer, main outlet, and manages the mobile sidebar drawer state on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Provides the left navigation sidebar with links and recent activity, highlighting active routes and supporting mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with avatar, metadata, image, and interactive actions such as likes, shares, and bookmarks.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders an image with automatic aspect ratio handling and a blurred backdrop for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide‑in mobile sidebar drawer with scrim overlay and scroll‑locking behavior.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, moderators, stats, and join/leave controls with loading states and error handling.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders the mobile header for a pond, including banner, profile image, description, and feed/about tab navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post card with voting, metadata, optional image, tag, and comment/view counts, linking to pond and post pages.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit activity with avatar, linked post title, timestamp, content, and a link to view the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji picker that calls a callback when an emoji is selected.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit with avatar, timestamp, like/unlike logic, replies, and an optional reply form with depth-based indentation.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads avatar images with a tiny blurred placeholder and transitions to the final image once loaded, supporting avatar or plain img modes.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent high‑view posts using data from queries with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "A mobile search modal that shows trending searches and suggestions, handles input, selection, and submission, and displays results in a scrollable overlay.",
  "frontend/src/components/search/SearchDropdown.tsx": "A desktop dropdown component that displays trending searches or suggestions based on the query and lets users select a term.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using a modular stats component with loading states and tag links.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab lists and tab triggers with underline-focused styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using localStorage with functions to toggle and retrieve bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context with login, logout, identity loading, and status handling via AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches using matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating ponds, posts, lilies, user data, and search suggestions using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light/dark themes plus utility classes for UI behaviors.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short k/M/B notation with one decimal precision.",
  "frontend/src/lib/imageCompression.ts": "Validates, detects animation, resizes, and compresses images client-side with fallbacks and format adjustments.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric pond name validation, normalization, and error messaging.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard-based fallbacks and user notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly errors for invalid tags.",
  "frontend/src/lib/user.ts": "Manages username, user ID, Froggy Phrase, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per-lily view cooldown timestamps in localStorage to limit view increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the Ribbit about page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with join status, loading states, and navigation to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a lily with text, image, or link, including pond selection, tag suggestions, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "UI for creating a new pond with name validation, descriptions, and compressed banner and profile images.",
  "frontend/src/pages/CreatePostPage.tsx": "Page to create text, image, or link posts with pond selection, optional tag, and image compression before submission.",
  "frontend/src/pages/FrogProfilePage.tsx": "User profile page showing avatar, basic stats, and tabs for posts and comments fetched by username.",
  "frontend/src/pages/HomePage.tsx": "Home feed showing trending or new lilies, supporting search results and responsive sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a lily post with comments, handles view increments, likes, and creating ribbits.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond info including description, moderators, membership status, and leave-pond action.",
  "frontend/src/pages/PondPage.tsx": "Displays the main pond feed with lilies, join-pond controls, and responsive layout.",
  "frontend/src/pages/PostPage.tsx": "Renders a single post with its details, image, link, and threaded comments plus comment creation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with options to remove or view them.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with stats and navigation to each tag's page.",
  "frontend/src/pages/TagPage.tsx": "Renders a tag page that loads canonical tags and associated lilies, handles redirects, and supports sorting with tabs.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements a complex user settings interface including username changes, avatar upload/compression, froggy phrase management, pond membership, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, plugins, and content paths.",
  "project_state.json": "Describes current project status, issues, and feature requests focused on restoring the frontend and implementing avatar upload functionality."
}