{
  "backend/main.mo": "Motoko canister defining storage, access control, data maps, and types for ponds, posts, ribbits, users, tags, and activity tracking.",
  "feature_evidence.json": "Feature evidence report listing files and components related to implementing blurred placeholder avatars for ribbits.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend files and pages.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global theme provider, and app layout structure.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks to show and update bookmark state.",
  "frontend/src/components/CommentItem.tsx": "Empty component file placeholder for comment item UI.",
  "frontend/src/components/EmojiReactions.tsx": "Empty component file placeholder for emoji reactions UI.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation, create menu, user avatar, and mobile/desktop behavior handling.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main navigation sidebar with active-route highlighting and recent activity items. Fetches recent activities and lily titles and displays navigation links for core app sections.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post card with metadata, counts, avatar, like/share actions, and optional tags. Fetches interaction counts, pond info, and user/pond avatar data.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows an image in a 4:3 frame, using a blurred backdrop for non‑4:3 aspect ratios. Measures image ratio dynamically and supports click and lazy loading.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Wraps the left sidebar in a mobile drawer with overlay and body‑scroll locking. Opens and closes with transitions and renders the sidebar inside.",
  "frontend/src/components/PondAboutSidebar.tsx": "Displays pond information, stats, moderators, and join/leave controls. Fetches pond details, moderator profiles, and membership state.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile header for pond pages with banner, profile image, and tab navigation. Shows pond name, description, and switches between feed and about.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, timestamp, linked lily title, and the comment content. Fetches avatar and post info and links to the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty or missing implementation.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit post with avatar, content, likes, and nested replies, handling like and reply actions. Uses queries for avatar, likes, and reply creation.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Displays an avatar image with a tiny blurred placeholder and smooth transition once loaded. Supports avatar and plain img render modes.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using pond and lily query data. Renders skeletons while loading.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full-screen mobile search modal showing trending searches or suggestions based on user input. Handles search submission, selection, and closing.",
  "frontend/src/components/search/SearchDropdown.tsx": "Desktop search dropdown showing trending searches or suggestions under the search bar. Allows selecting a term and hides when no results.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags with activity counts using tag stats queries. Includes reusable tag stats module and list items.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab lists and triggers with underline-focused classes. Used to create consistent tab UI styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using React state and localStorage with functions to query and modify bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for Internet Identity authentication, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query matches using React state and matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend pond, user, and activity data via an actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into compact notation such as k, M, or B.",
  "frontend/src/lib/imageCompression.ts": "Client-side utility for validating, resizing, and compressing images, with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to alphanumeric lowercase, with error messages for invalid inputs.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes tags as alphanumeric lowercase, returning errors for invalid tags.",
  "frontend/src/lib/user.ts": "Manages user identity and Froggy Phrase recovery using localStorage, including username generation, phrase hashing, backups, and restore logic.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-post cooldown tracking in localStorage to prevent repeated view count increments within five minutes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, key features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, membership indicators, and links to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating new lilies with support for text, image, or link posts, tag suggestions, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Offers a form for creating new ponds with name validation, optional images, Froggy Phrase input, and image compression handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile, avatar, posts, and comments with loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with search, sorting, sidebars, and loading placeholders.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily with comments, likes, view tracking, and reply creation.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond info including moderators, visibility, creation date, and leave-pond actions.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond's feed of lilies with join actions, sorting, and responsive layout.",
  "frontend/src/pages/PostPage.tsx": "Placeholder page with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Renders the tag hub with tabs for top, trending, and newest tags, fetching data and displaying tag lists with skeletons and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Shows posts filtered by a specific tag with sorting, redirects to canonical tags, and displays tag metadata with sidebars.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements user settings for username changes, avatars, froggy phrase recovery, pond management, and admin tools using many queries and dialogs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and content paths for the frontend.",
  "project_state.json": "Describes project state and requirements for preserving layout while implementing blurred placeholder optimization for Ribbits."
}