{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, ordered maps for ponds, posts, ribbits, users, tags, likes, activity tracking, and various supporting types.",
  "feature_evidence.json": "Contains metadata describing a feature evidence report linking a frontend React Query update to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists concise summaries of multiple frontend React components and pages used across the application.",
  "frontend/DEPLOYMENT.md": "Provides deployment instructions for building and deploying the Ribbit app on the Internet Computer.",
  "frontend/index.html": "Main HTML entry point that loads the frontend root and initializes the React application.",
  "frontend/scripts/combined-update.sh": "Bash script automating backend binding generation, frontend build, and canister deployment with error handling.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and route tree for all main application pages.",
  "frontend/src/components/BookmarkButton.tsx": "Button component that toggles bookmark state for a lily using useBookmarks.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, metadata, content, and optional like/reply interactions.",
  "frontend/src/components/EmojiReactions.tsx": "Displays emoji-based reaction buttons with counts, hover effects, and click handling.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with navigation links and attribution.",
  "frontend/src/components/Header.tsx": "Implements the main site header with search, navigation, user avatar, and responsive mobile/desktop interactions including dropdowns and modals.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with header, footer, routed content, and a mobile sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the left navigation sidebar with links and recent activity items, highlighting active routes and supporting mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with avatar, metadata, counts, image, and actions such as like, share, and bookmark.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows an image with a fixed aspect ratio, adding a blurred backdrop for non-4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a mobile slide‑in drawer containing the left sidebar and manages body scroll lock and overlay behavior.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond information including stats, moderators, visibility, and join/leave controls.",
  "frontend/src/components/PondCardJoinControl.tsx": "Renders a join button for pond cards, handling join actions and disabled state for existing members.",
  "frontend/src/components/PondMobileHeader.tsx": "Responsive mobile header for a pond page showing banner, profile image, name, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting, metadata, preview content or image, tags, and links to the pond and full post.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit in their profile with avatar, timestamp, content, and link to the related lily conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Popover emoji picker that lets users insert preset emojis via a selection callback.",
  "frontend/src/components/RibbitItem.tsx": "Shows a ribbit with avatar, timestamp, likes, and threaded replies, including reply form and like handling.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar with a blurred placeholder and smooth transition, usable as an img or AvatarImage component.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent high‑view posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full‑screen mobile search modal showing trending searches, suggestions, and handling query input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown under a search bar with trending searches and suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar for tag hub pages listing top, trending, and newest tags with activity counts.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for TabsList and TabsTrigger with underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs in localStorage with helpers to add, remove, toggle, and retrieve them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useMediaQuery.ts": "Evaluates a CSS media query and updates when it changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating ponds, lilies, profiles, and related data using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers plus light and dark theme CSS variables and utility classes for UI behaviors and sizing.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, or B with basic rounding.",
  "frontend/src/lib/imageCompression.ts": "Provides client‑side image validation, resizing, and compression with special handling for animated GIFs.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric format and returns related error messages.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name, returning a map of ranks.",
  "frontend/src/lib/shareLily.ts": "Shares a lily via Web Share API or falls back to clipboard copy with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns error messages for invalid input.",
  "frontend/src/lib/user.ts": "Manages user identifiers, usernames, and Froggy Phrase backup/restore using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily cooldown tracking in localStorage to limit view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing the Ribbit platform, features, and guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, ranking, membership status, and links to create or visit ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily with text, image, or link types, tag suggestions, image compression, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a pond with name validation, description, images, and automated image compression and preview.",
  "frontend/src/pages/CreatePostPage.tsx": "Creates a text, image, or link post with pond selection, image compression, validation, and submission handling.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile, avatar, posts, and comments with loading and not-found handling.",
  "frontend/src/pages/HomePage.tsx": "Displays the home feed of lilies with search, sorting, loading states, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, view tracking, and ribbit creation.",
  "frontend/src/pages/PondAboutPage.tsx": "Renders detailed pond info including moderators, visibility, join/leave actions, and metadata.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed with its banner, sidebar layout, and sorted lilies.",
  "frontend/src/pages/PostPage.tsx": "Shows a post with its content, metadata, and threaded comments, allowing new comment creation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading/error states and removal support.",
  "frontend/src/pages/TagHubPage.tsx": "Page displaying top, trending, and newest tags with loading states and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Tag detail page that resolves canonical tags, lists lilies with sorting, and shows subcategories.",
  "frontend/src/pages/UserSettingsPage.tsx": "User settings interface for username changes, profile editing, avatar upload, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors, radius, animations, and plugins.",
  "project_state.json": "Project state describing Step 3 migration to phrase-hash UserId with pending related feature requests."
}