{
  "backend/main.mo": "Defines the Ribbit canister with storage, access control, maps for ponds, posts, ribbits, users, tags, likes, activities, and related data types.",
  "feature_evidence.json": "Feature evidence report describing a UI layout change to LilyPage and listing affected file, components, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files, used as a reference for build planning.",
  "frontend/index.html": "Base HTML file that loads the React app with root element and main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global theme provider, and app-level layout and notifications.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using bookmark state from useBookmarks and stopping click propagation.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Renders footer with navigation links and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation links, user avatar, create menu, and mobile interactions.",
  "frontend/src/components/Layout.tsx": "Wraps pages with header and footer and manages mobile left sidebar drawer state.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main left navigation sidebar with links, active-state icons, and recent activity items.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post card with avatar, metadata, image handling, and like/share/bookmark actions.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a slide-in mobile drawer containing the LeftSidebar and manages body scroll lock.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave actions with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages with banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user ribbit entry showing avatar, comment content, metadata, and link to the related lily.",
  "frontend/src/components/RibbitEmojiTray.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a threaded ribbit with avatar, content, like/reply actions, and nested indentation.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar showing trending ponds, popular tags, and recent popular posts using query hooks and memoized calculations.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile fullscreen search modal showing trending searches and suggestions with interactive input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown under search bar showing trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar module displaying top, trending, and newest tags with activity stats using reusable components.",
  "frontend/src/components/UnderlineTabs.tsx": "Thin wrappers around TabsList and TabsTrigger adding underline-themed styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions for mutation.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and status management.",
  "frontend/src/hooks/useMediaQuery.ts": "Hook that tracks whether a media query currently matches via matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor API calls for ponds, memberships, users, and mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind base and custom CSS variables, themes, and utility classes for global styling.",
  "frontend/src/lib/formatNumber.ts": "Utility to format large numbers into short forms like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Client-side image validation, resizing, and compression with GIF handling and canvas-based output.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric rules with error helpers.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API or clipboard fallback with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and provides error messages.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase storage, hashing, backups, and restoration via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and mounts App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the Ribbit platform, its features, and community guidelines using static text and UI components.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a grid of all ponds with loading states, join status, and a link to create a new pond.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating lilies with support for text, images, links, tag suggestions, pond selection, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with validation, image uploads, compression, previews, and error handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Placeholder file containing no implementation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Shows a frog user's profile, avatar, stats, and tabs for their posts and ribbits with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Renders the main feed with trending/new sorting, search results, sidebars, and loading skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily post, handles loading data, view count increments, sorting ribbits, and posting replies.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including moderators, visibility, and join/leave functionality with loading states.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond's feed of lilies, handles join status, sorting, and loading skeletons with sidebars.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lilies, handles missing posts, and allows removing bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats, loading states, and navigation to each tag.",
  "frontend/src/pages/TagPage.tsx": "Shows lilies for a specific tag with sorting, canonical tag redirects, and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "React page that manages user settings including username changes, avatar upload/compression, Froggy Phrase handling, profile saving, pond membership, and admin tag tools using many hooks and UI components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing the goal to align lily page layout elements and tracking related features and requests."
}