{
  "backend/main.mo": "Large Motoko canister implementing storage, access control, user profiles, ponds, posts, ribbits, tags, likes, and activity tracking with many ordered maps.",
  "feature_evidence.json": "Feature evidence report linking a UI requirement to impacted files and components with high confidence.",
  "frontend-file-summaries.txt": "JSON-style list of high-level summaries for numerous frontend React/TSX files and pages.",
  "frontend/index.html": "Base HTML document setting up root container and loading the main React entry script.",
  "frontend/src/App.tsx": "Defines TanStack Router routes, wraps app in ThemeProvider, and renders RouterProvider with toaster notifications.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks hook to manage bookmarked lily IDs with customizable colors.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Responsive header with search, avatar, create menu, mobile drawer trigger, and search term recording.",
  "frontend/src/components/Layout.tsx": "Page layout wrapping header, footer, and routed content while managing mobile sidebar drawer state.",
  "frontend/src/components/LeftSidebar.tsx": "Navigation sidebar showing links and recent activity with route-aware highlighting and activity previews.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image, and actions like like, share, and bookmark.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images with automatic aspect-ratio handling and blurred backdrops for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with body scroll locking and animated open/close.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave actions with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages showing banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file with no implemented component.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit with avatar, timestamp, related lily link, and comment preview.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file with no implemented component.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit with avatar, timestamp, content, likes, and nested replies, including reply and like actions via query hooks.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Renders an avatar image with a tiny blurred placeholder and smooth transition once the full image loads.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using fetched data with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full‑screen mobile search modal showing trending searches or suggestions and allowing query submission.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown under search input showing trending terms or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using shared tag list module components and query hooks.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and trigger components with underline-focused appearance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBookmarks.ts": "Provides bookmark state synced to localStorage with helpers to toggle, add, remove, and clear lily IDs.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading, login, logout, and status tracking using DFINITY AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query currently matches the viewport.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for interacting with backend actors to fetch and mutate ponds, profiles, posts, and related data.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, dark mode tokens, and utility classes for consistent UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into compact units like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Client-side image validation, resizing, and compression with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to lowercase alphanumeric and provides error messaging.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard fallback and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-facing error messages.",
  "frontend/src/lib/user.ts": "Handles username, user ID, and Froggy Phrase storage in localStorage, including hashing, obfuscation, and settings backup/restore.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-post cooldown tracking in localStorage to limit view count increments within a 5‑minute window.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with join status, loading states, and navigation to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides UI and logic for creating new lilies, including content types, tags, image handling, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "UI for creating a new pond with validation and optional banner/profile image uploads with compression.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty or placeholder file for a create-post page.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, post and comment counts, and tabs for posts and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with sorting, search handling, sidebars, and loading or empty states.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily with likes, views, ribbits, posting replies, image viewing, and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond details including metadata, moderators, membership status, and a leave button with loading and not-found handling.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed with join logic, sorting by newest, sidebars, and loading or not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists bookmarked lilies stored locally, showing each item or a message when none exist, with removal support.",
  "frontend/src/pages/TagHubPage.tsx": "Displays top, trending, and newest tags with loading states and sidebars, using TagItem and TagList components. Fetches tag stats and renders ranked tag lists with navigation links.",
  "frontend/src/pages/TagPage.tsx": "Shows posts under a specific tag with sorting options and redirects to the canonical tag if needed. Fetches tag data, displays lily cards, and includes sidebars.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings for username changes, avatar uploads, froggy phrase management, pond membership, and admin tag tools. Integrates multiple queries, mutations, and UI controls.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, color tokens, animations, and plugins, defining extended colors, radii, and container settings.",
  "project_state.json": "Tracks project metadata, known issues, existing features, and new feature requests related to removing horizontal inset on LilyCard hover background for desktop."
}