{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, user data maps, activity tracking, ponds, posts, ribbits, tags, likes, and multiple data types for backend logic.",
  "feature_evidence.json": "Contains structured feature evidence reports specifying UI changes, related files, components, and test IDs for FrogProfilePage back button updates.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for numerous frontend files describing layouts, pages, and UI behaviors.",
  "frontend/index.html": "HTML entry point setting up root div, favicon, metadata, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, loads all pages including FrogProfilePage, and wraps the app in theme and router providers.",
  "frontend/src/components/BookmarkButton.tsx": "Provides a bookmark toggle button using useBookmarks with customizable colors and click-handling prevention.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/Footer.tsx": "Footer displaying navigation links and attribution with a heart icon and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Responsive header handling search, navigation, user avatar loading, mobile menu, and search recording with dropdowns and modals.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and mobile sidebar drawer, auto-closing drawer on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar navigation with route matching and recent activity previews, including activity items linking to lily pages.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image handling, like/share interactions, and optional tag/user visibility.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with body scroll locking and slide-in animation.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave actions with loading states and visibility info.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header with banner, profile image, description, and tab navigation for feed/about.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user ribbit with avatar, timestamp, linked lily title, content, and navigation to conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder component file.",
  "frontend/src/components/RibbitItem.tsx": "Displays a threaded ribbit with avatar, timestamp, like and reply interactions, and nested depth indentation.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and popular recent posts using fetched data with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full-screen mobile search modal showing trending searches or suggestions based on user input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown for search input that shows trending searches or suggestions depending on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags via reusable modules with loading and empty states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and tab trigger components with underline-specific classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs in localStorage with helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a media query matches the current viewport.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for ponds, membership, profiles, search, and mutations interacting with an actor API.",
  "frontend/src/index.css": "Tailwind base and utility layers with theme variables, dark mode values, and custom UI utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, and B.",
  "frontend/src/lib/imageCompression.ts": "Client-side image validation, resizing, and compression with GIF detection and canvas-based processing.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to alphanumeric lowercase and provides error messages.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API or falls back to clipboard copying with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes tags to alphanumeric lowercase and returns error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, Froggy Phrase storage, and settings backup using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements a per-lily view count cooldown using timestamps stored in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing the platform, features, and community guidelines with styled sections.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, join status, and links to create or view individual ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating text, image, or link lilies with tag suggestions, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Allows users to create a new pond with validation and optional banner and profile image uploads using compression.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page for post creation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Shows a frog user's profile with avatar, stats, posts, comments, and loading/not-found states.",
  "frontend/src/pages/HomePage.tsx": "Renders the home feed with trending and new sorting, sidebars, search support, and loading placeholders.",
  "frontend/src/pages/LilyPage.tsx": "Displays a lily post, its metadata, ribbits, likes, and handles view count increments with cooldowns.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including visibility, moderators, description, and leave-pond actions.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed of lilies with join/leave functionality and mobile/desktop layouts.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file for a post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies with loading states and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific canonicalized tag with sorting options and redirects if needed.",
  "frontend/src/pages/UserSettingsPage.tsx": "React page providing username changes, avatar upload, froggy phrase management, pond membership actions, and admin tools using numerous queries and UI components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, radii, and plugins for the frontend.",
  "project_state.json": "JSON metadata describing project state, known issue about back button placement on the Frog Profile page, and related feature requirements."
}