{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, extensive ordered maps for ponds, posts, users, tags, likes, activity tracking, and related types. Contains all backend state structures for the platform.",
  "feature_evidence.json": "Placeholder feature evidence report containing an empty features array.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing component behavior and layout details.",
  "frontend/DEPLOYMENT.md": "Documentation outlining prerequisites and steps for deploying the Ribbit application to the Internet Computer.",
  "frontend/index.html": "Main HTML entrypoint that loads the frontend app and sets metadata, favicon, and root div.",
  "frontend/scripts/combined-update.sh": "Bash script automating backend binding generation, frontend build, and canister deployment with error handling and colored output.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theming, and ensures Froggy Phrase generation on app mount.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component that interacts with useBookmarks to mark or unmark a lily.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, metadata, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "UI component for reacting to content with emoji types, showing counts and selection state.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links, copyright text, and attribution link using lucide-react icons.",
  "frontend/src/components/Header.tsx": "Navigation header with logo, search bar, and user avatar, handling mobile and desktop search behaviors with dropdowns and modals.",
  "frontend/src/components/Layout.tsx": "Main app layout wiring header, footer, routed content, and a mobile left-sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activity items with active route highlighting and pond/lily data fetching.",
  "frontend/src/components/LilyCard.tsx": "Card component rendering a lily post with metadata, avatar, stats, like/share actions, and optional tags.",
  "frontend/src/components/LilyImageFrame.tsx": "Image frame that computes aspect ratio and displays images with a blurred backdrop for non‑4:3 formats.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with overlay, slide animation, and body scroll lock.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderator info, and join/leave actions with loading and error handling.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button control for pond cards, handling join mutation, disabled states, and toast feedback.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header showing banner, profile info, and tabs with navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post with voting, metadata, preview content, image, tag, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit on their profile with avatar, linked post title, timestamp, and navigation to the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Popover emoji picker allowing quick emoji selection for ribbits.",
  "frontend/src/components/RibbitItem.tsx": "Shows a ribbit with nesting, like functionality, reply form, and user avatar loading.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Progressively loads an avatar image with a blurred placeholder and transition effects.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar listing trending ponds, popular tags, and recent popular posts.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full-screen search modal showing trending searches and suggestions with input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown for desktop search showing trending terms or suggestions based on query input.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar for the tag hub showing top, trending, and newest tags with activity stats.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides wrapper components for tab lists and triggers with underline-specific styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a delay when the input changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, state management, and AuthClient setup.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given media query matches, updating on window resize events.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for ponds, posts, profiles, and other backend interactions using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark modes, and utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into compact strings like 1.2k or 1.5M.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog-themed and general English word lists used for generating Froggy Phrases.",
  "frontend/src/lib/imageCompression.ts": "Validates, resizes, and compresses images client-side, with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric validation, normalization, and error messages for pond names.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lilyCount, memberCount, and name, returning a rank map.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API or copies it to clipboard as fallback.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly errors.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, settings backup, and generates/stores a 12‑word Froggy Phrase.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily cooldown tracking for view increments using localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, features, and community guidelines using static content and UI components.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with loading states, ranking, join controls, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form for creating lilies with support for text, image, or link types, tag suggestions, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements pond creation with name validation, image uploads with compression, and optional froggy phrase handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Offers a post creation interface supporting text, image, and link posts with pond selection, image compression, and submission logic.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, stats, and tabs for posts and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with search, sorting, sidebars, and loading placeholders.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily post with comments, likes, views, image handling, and view-count increment logic.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed pond information including moderators, metadata, and join/leave controls with loading and not-found states.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s lily feed with sorting, sidebars, banner, and handling for loading and missing ponds.",
  "frontend/src/pages/PostPage.tsx": "Displays a detailed post view with comments, loading states, and the ability to create new ribbit comments. Fetches post data, threaded comments, and handles sorting and form submission.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows a list of locally bookmarked lilies, rendering each with loading/error fallbacks and allowing removal from bookmarks. Uses LilyCard for valid items and displays empty-state messaging.",
  "frontend/src/pages/TagHubPage.tsx": "Renders a hub of top, trending, and newest tags with ranking, stats, and navigation links. Fetches multiple tag lists and displays loading skeletons or empty states.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies associated with a specific tag with sorting options and subcategories. Includes sidebars, loading states, and dynamic list rendering.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings for username changes, avatar uploads, profile data, pond memberships, and admin tools. Handles validation, availability checks, uploads, and various user-related mutations.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, container settings, animations, and plugin integrations for the project.",
  "project_state.json": "Defines project state, architectural notes about removing principal-based checks in pond creation, known auto-join bugs, and pending feature requests to fix pond creator auto-joining using phrase-hash userId."
}