{
  "backend/main.mo": "Defines the Ribbit canister with data models, storage mixins, access control state, maps for ponds, posts, ribbits, users, tags, activity tracking, and a public function to increment post view counts.",
  "feature_evidence.json": "Contains feature evidence entries mapping frontend files to implemented requirements for pond feed, about sidebar, and desktop layout behavior.",
  "frontend-file-summaries.txt": "Lists short summaries of multiple frontend files describing their purpose, layout behavior, and key UI functionality.",
  "frontend/index.html": "HTML entry point that loads the root React app and includes metadata, favicon, and main script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps the app in ThemeProvider, and defines all page routes including SavedLiliesPage.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks hook to mark or unmark lilies with click handling.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and a caffeine.ai attribution section.",
  "frontend/src/components/Header.tsx": "Header with logo, search, navigation buttons, mobile menu, user avatar, and create menu.",
  "frontend/src/components/Layout.tsx": "Root layout containing header, footer, main outlet, and mobile left sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Navigation sidebar showing links and recent activity, with active state detection and conditional mobile drawer styling.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, image handling, interactions (likes, shares), and optional user or pond avatar.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile-only slide‑in drawer that shows the LeftSidebar and manages body scroll lock.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderators, and join/leave controls with loading states and error handling.",
  "frontend/src/components/PostCard.tsx": "Empty file placeholder.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file placeholder.",
  "frontend/src/components/RibbitItem.tsx": "Renders a recursive ribbit (comment) with likes, replies, indentation, and avatar loading.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent popular posts with loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmark state for lily IDs with localStorage persistence and provides helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login flow, status tracking, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for ponds, profiles, membership, and mutations with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables for light and dark modes, and utility classes for UI consistency.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short forms like k, M, and B with simple decimal rounding.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using the Web Share API with clipboard fallbacks and toast notifications.",
  "frontend/src/lib/user.ts": "Handles user identity and settings in localStorage including username generation, Froggy Phrase storage, hashing, backup, and restoration.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily cooldown logic using localStorage to throttle view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing platform features and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with loading states, membership indicators, and navigation links.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily post with support for text, images, links, pond selection, and tag suggestions.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond with validation, image uploads, and custom froggy phrase handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Main feed showing lilies with sorting, search results, sidebars, and loading skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with ribbits, likes, view tracking, and posting new ribbits.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays pond details, moderators, membership status, and allows users to leave the pond with loading and error states.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed with lilies, join functionality, and sidebars, including loading and missing-pond handling.",
  "frontend/src/pages/PostPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and removal options for unavailable posts.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies filtered by tag with sorting, canonical redirects, pond context, and sidebar layout.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user account settings including username changes, avatar upload, froggy phrase management, admin tools, and joined pond management.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Tracks project state version, a high-level platform summary, and a list of implemented frontend and backend features with IDs, descriptions, synonyms, and versions."
}