{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control initialization, and extensive persistent maps for ponds, posts, ribbits, users, tags, likes, and activity tracking.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing component behavior, layout rules, and UI constraints.",
  "frontend/index.html": "HTML entry point defining root mount element and loading the main frontend script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps the app in ThemeProvider, and renders global toasts.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button that interacts with bookmark state and displays an icon with active/hover styling.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, metadata, content, and optional like and reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Displays selectable emoji reaction buttons with counts, hover effects, and selected state styling.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and caffeine.ai credit.",
  "frontend/src/components/Header.tsx": "Header with search UI, mobile/desktop behaviors, user avatar loading, create-menu dropdown, and search term recording.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping all pages with header, footer, and mobile sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Navigation sidebar showing links and recent activity, with active-state detection and optional mobile drawer styling.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, avatar, counts, like/share actions, and optional tags or user avatar.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images with a 4:3 frame, adding a blurred backdrop for non‑4:3 aspect ratios.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile slide-in drawer wrapping LeftSidebar with scroll lock and scrim overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave controls with loading states.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button for pond cards, handling join mutations and success/error toasts.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header with banner, profile image, description, and tab navigation for feed/about.",
  "frontend/src/components/PostCard.tsx": "Card for a generic post including votes, preview content, image, tags, and metadata.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit within their profile, showing avatar, linked lily title, timestamp, content, and a link to the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Renders a popover emoji picker that calls a callback when an emoji is selected.",
  "frontend/src/components/RibbitItem.tsx": "Shows a ribbit with nesting, likes, replies, avatar loading, and reply form handling.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar with a tiny blurred placeholder and smooth transition, supporting avatar or img modes.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular lilies with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full-screen search modal showing trending searches, suggestions, and a query input.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown showing trending searches or suggestions based on the query, allowing selection of a term.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags using shared list modules with activity counts.",
  "frontend/src/components/UnderlineTabs.tsx": "Custom wrappers for TabsList and TabsTrigger adding underline-style classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using localStorage with helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query currently matches.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for ponds, posts, and user-related operations.",
  "frontend/src/index.css": "Tailwind base styling with custom CSS variables, dark mode values, global utilities, and component-specific styles.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short forms like 1.2k, 1.5M, or 2B.",
  "frontend/src/lib/imageCompression.ts": "Client-side utility for validating, resizing, and compressing images, with special handling to skip animated GIF recompression.",
  "frontend/src/lib/pondNameValidation.ts": "Provides validation, normalization, and user-friendly error messages for alphanumeric pond names.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by activity metrics and assigns deterministic ranks using lily count, member count, and name.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API or falls back to clipboard copying with toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and generates optional tag error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, Froggy Phrase backup/restore, and related localStorage state.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using localStorage timestamps.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with ranks, join controls, loading skeletons, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Page for creating a lily with text, image, or link, including tag suggestions, pond selection, and image compression with previews.",
  "frontend/src/pages/CreatePondPage.tsx": "Page to create a new pond with validation, description fields, and compressed banner/profile image uploads with previews.",
  "frontend/src/pages/CreatePostPage.tsx": "Page for creating a post of type text, image, or link, supporting pond selection, image compression, and form validation.",
  "frontend/src/pages/FrogProfilePage.tsx": "Profile page displaying a user's avatar, stats, posts, and comments with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing trending or new lilies, handling search results, and rendering sidebars and loading skeletons.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily, its replies, and metadata, with view count, likes, and ribbit creation handling.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including moderators, visibility, creation date, and membership controls.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s feed with lilies filtered by pond name, join actions, and responsive layout components.",
  "frontend/src/pages/PostPage.tsx": "Displays a post with content, images, metadata, and threaded comments, allowing users to add new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with ranking and stats, organized in tabbed views.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a given tag, fetching canonical tags, sorting options, and handling redirects while rendering sidebars and tag metadata.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings UI including username changes, avatar upload, froggy phrase management, pond memberships, and admin tools.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to fixing pond-creation membership behavior."
}