{
  "backend/main.mo": "Defines the Ribbit canister with storage, access control, ponds, posts, ribbits, users, likes, tags, and activity tracking types and state.",
  "feature_evidence.json": "Lists implemented frontend feature changes with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files describing layout, pages, components, and UI behaviors.",
  "frontend/index.html": "HTML entry point setting up the root div and loading the main React script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks to add or remove a lily bookmark.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including a heart icon and caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, mobile menu, user avatar, and create menu, handling search term recording and navigation.",
  "frontend/src/components/Layout.tsx": "App layout wrapping pages with Header, Footer, and a mobile left sidebar drawer that closes on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main navigation sidebar with active-route highlighting and recent activity list. Fetches lily data for activities and supports mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, image handling, and actions like like, share, and bookmark. Fetches counts and user/pond info dynamically.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the LeftSidebar with body scroll lock and animated overlay. Opens and closes via props.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond info including stats, moderators, join/leave actions, and visibility. Loads pond data and user profiles with skeleton states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for pond pages showing banner, profile image, description, and tab navigation. Supports switching between feed and about tabs.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder component file.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder component file.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit (comment) with nested depth, likes, replies, and user avatar. Supports posting replies and liking/unliking ribbits.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular posts using query data with loading states and memoized calculations.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full‑screen search modal showing trending searches or suggestions based on query with selection handlers.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown search panel showing trending terms or suggestions depending on query input.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags with shared tag stat modules and loading handling.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers for tab lists and triggers using custom underline classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries on identity change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions for modification.",
  "frontend/src/hooks/useDebounce.ts": "Debounces a value with a configurable delay using a timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given media query matches using window.matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating pond, user, and membership data through the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode tokens, and custom utility classes for UI elements.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, and B with one-decimal rounding.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and returns error messages for pond names restricted to alphanumeric characters.",
  "frontend/src/lib/shareLily.ts": "Implements lily sharing via Web Share API with clipboard and textarea fallbacks plus toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates, normalizes, and provides error messages for alphanumeric-only tags.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase handling, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily cooldown tracking for view count increments using timestamps in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, membership badges, and links to start or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating lilies with support for text, image, link types, tag suggestions, validation, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond with name validation, images, description, and froggy phrase checks.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for a create‑post page.",
  "frontend/src/pages/HomePage.tsx": "Renders the main feed of lilies with trending/new sorting, search handling, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with comments, likes, view tracking, and lightbox image handling.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows pond details, moderators, metadata, and allows leaving the pond with loading and error states.",
  "frontend/src/pages/PondPage.tsx": "Loads pond info, lists lilies filtered by pond name, and handles joining ponds with loading and error states.",
  "frontend/src/pages/PostPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lilies, loading states, and allows removing bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with loading states and navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with canonical tag redirection and sorting options.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides UI for managing username, profile, avatar, joined ponds, and admin tag tools with multiple queries and mutations.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state, listing UI spacing fix requirements and pending feature requests for multiple pages. Contains existing features, new requests, and metadata like versions and project name."
}