{
  "backend/main.mo": "Motoko canister defining the Ribbit backend with storage, access control, and core data models for ponds, posts (lilies), ribbits, users, likes, activity tracking, and usernames, including upgrade-safe role restoration.",
  "feature_evidence.json": "Machine-readable report describing implemented frontend bookmark and Saved Lilies features, listing affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend React components, pages, hooks, and utilities used as documentation or planning reference.",
  "frontend/index.html": "HTML entry point that mounts the React app, sets metadata, favicon, viewport, and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes, theme provider, toaster notifications, and registering all main pages including Saved Lilies.",
  "frontend/src/components/BookmarkButton.tsx": "UI button component that toggles a local bookmark state for a lily using the useBookmarks hook and displays a filled or outlined bookmark icon.",
  "frontend/src/components/CommentItem.tsx": "Placeholder or empty file intended for rendering individual comment (ribbit) items.",
  "frontend/src/components/EmojiReactions.tsx": "Placeholder or empty file intended for emoji or reaction UI functionality.",
  "frontend/src/components/Footer.tsx": "Footer component rendering navigation links, copyright text, and attribution with iconography.",
  "frontend/src/components/Header.tsx": "Top navigation header with branding, search, navigation links, mobile menus, user avatar display, and actions for creating content.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes Header, Footer, routed content outlet, and manages mobile left sidebar drawer state on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main left navigation with links (Home, Ponds, Create, Saved, Settings) and a recent activity list, highlighting active routes and supporting mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Displays a post (lily) card with avatar, metadata, content preview, image handling, and interactive actions like like, share, bookmark, and counts fetched via hooks.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide-in mobile drawer wrapper for the LeftSidebar, including a scrim overlay and body scroll locking when open.",
  "frontend/src/components/PostCard.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "File is empty or contains no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Renders a single ribbit (comment) with nested replies, avatar, timestamp, like functionality, and an inline reply form with depth-based indentation.",
  "frontend/src/components/RightSidebar.tsx": "Renders the right sidebar showing trending ponds, popular tags, and popular recent posts computed from fetched pond and lily data.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and manages an authenticated or anonymous backend actor based on identity, and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages client-side bookmarked lily IDs using localStorage, exposing helpers to toggle, add, remove, and query bookmarks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, hook, and provider for managing Internet Identity authentication, including login/logout, persisted identity loading, and detailed login status flags using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of React Query hooks and mutations for interacting with backend actors, covering ponds, memberships, user profiles, posts, and related cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, base element styles, and a small custom utility for hover effects.",
  "frontend/src/lib/formatNumber.ts": "Utility function that formats large numbers into abbreviated strings (k, M, B) with one decimal of precision.",
  "frontend/src/lib/shareLily.ts": "Helper to share a lily URL via the Web Share API with clipboard-based fallbacks and user feedback via toast notifications.",
  "frontend/src/lib/user.ts": "Client-side user utilities managing anonymous usernames, user IDs, and a recoverable \"Froggy Phrase\" using localStorage with simple hashing and backups.",
  "frontend/src/main.tsx": "Frontend entry point that renders the app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page component describing the Ribbit platform, its features, and community guidelines with styled layout and separators.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a grid of all ponds with loading states, member counts, and a Joined badge for ponds the user belongs to, plus a button to start a new pond.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a new Lily (text, image, or link) with pond selection, tag suggestions, image upload preview, and validation requiring pond membership.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with required metadata, banner and profile image uploads with previews, froggy phrase validation, and submission via createPond mutation.",
  "frontend/src/pages/CreatePostPage.tsx": "File is present but contains no implementation or content.",
  "frontend/src/pages/HomePage.tsx": "Renders the main feed of lilies with trending/new sorting, search support, loading skeletons, and left/right sidebars on desktop.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single Lily post with image handling, likes, views, sharing, bookmarking, and a threaded ribbit (comment) section with creation support.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed information about a pond including description, moderators, visibility, creation date, and allows members to leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond feed page that fetches pond metadata, membership state, and lilies, supports joining a pond, and displays lilies sorted by newest with loading and not-found states plus sidebars.",
  "frontend/src/pages/PostPage.tsx": "File is currently empty or missing implementation, likely intended to render an individual lily/post detail page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays a list of locally bookmarked lilies, fetching each lily by ID, handling removed/missing posts, and allowing users to remove bookmarks.",
  "frontend/src/pages/TagPage.tsx": "Shows a feed of lilies for a given tag with canonical tag redirection, sorting tabs, pond context display, and standard left/right sidebars with loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements a comprehensive user settings page for username management, avatar upload, profile editing, joined ponds, froggy phrase backup, and admin-only tag management features.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with class-based dark mode, OKLCH semantic color tokens, container sizing, custom animations, and typography/animation plugins.",
  "project_state.json": "Defines the project’s current state and feature inventory, summarizing ribbit’s architecture, frontend stack, backend capabilities, and implemented features with versioning."
}