{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, user data maps, posts, ponds, ribbits, likes, tags, and activity tracking types and state.",
  "feature_evidence.json": "Feature evidence report listing two LilyCard hover‑related features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files detailing layout, pages, components, and UI behavior.",
  "frontend/index.html": "HTML entry point defining root div, metadata, favicon, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global providers including theme and toast for all pages.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using bookmark state hooks with customizable colors.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file for a comment display component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file for emoji reaction UI.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution section linking to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation, avatar, mobile menu, and search dropdown/modal behavior.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and a mobile sidebar drawer that closes on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the main navigation sidebar with route-aware highlighting and a recent activity list. Includes mobile drawer styling support.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with metadata, avatar, counts, like/share actions, and optional tag and user avatar visibility. Fetches related data such as counts, pond info, and user avatars.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows an image in a fixed 4:3 frame, using a blurred backdrop for non‑4:3 images. Supports click handling and lazy loading.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a slide‑in mobile drawer that hosts the LeftSidebar and manages body scroll lock. Includes a scrim overlay and animated transitions.",
  "frontend/src/components/PondAboutSidebar.tsx": "Displays pond details, stats, moderators, and join/leave actions with loading states. Fetches pond metadata and membership info.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile‑optimized pond header showing banner, profile image, name, description, and tab navigation. Navigates between feed and about views.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user's ribbit with avatar, timestamp, content, and link to the related lily. Fetches avatar and lily information.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file with no component content.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit with avatar, timestamp, likes, and a nested reply form with like/unlike and reply creation logic.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Renders an avatar image with a tiny blurred placeholder that transitions to the full image once loaded.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using fetched pond and lily data.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full‑screen mobile search modal showing trending searches or suggestions and handling query input and selection.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown for desktop search input that displays trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags with activity stats using modular tag list components.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and tab trigger components with underline-focused classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage sync and provides helpers to toggle, add, remove, and clear bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context for Internet Identity, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Returns whether a given media query matches and updates reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor queries and mutations for ponds, profiles, membership, and search using React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode themes, and custom utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notation like k, M, or B.",
  "frontend/src/lib/imageCompression.ts": "Validates and compresses images client‑side, handling resizing, GIF detection, and output optimization.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names to strict alphanumeric rules and provides error messages.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link via Web Share API or falls back to clipboard copying with toast feedback.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes tag strings to alphanumeric format and returns user-friendly errors.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, and Froggy Phrase recovery using localStorage with hashing, backup, and restore logic.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-post view cooldown tracking in localStorage with check, record, and clear helpers.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with loading states, membership indicators, and links to pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form for creating a lily post with pond selection, tags, media handling, validation, and submission.",
  "frontend/src/pages/CreatePondPage.tsx": "Form for creating a new pond with name validation, description, optional images, and compression.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for a post creation page.",
  "frontend/src/pages/FrogProfilePage.tsx": "Renders a user's profile with avatar, stats, posts, and comments, handling loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with sorting, search support, and sidebars, showing skeletons while loading.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, view tracking, and ribbit creation, including cooldown logic for view increments.",
  "frontend/src/pages/PondAboutPage.tsx": "Displays detailed pond information including moderators, visibility, creation date, and membership actions.",
  "frontend/src/pages/PondPage.tsx": "Shows a pond’s feed with its lilies, join/leave functionality, and loading and not-found handling.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file for a post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and the ability to remove unavailable or saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Renders a tag discovery hub with tabs for top, trending, and newest tags using sidebar layout and tag list components.",
  "frontend/src/pages/TagPage.tsx": "Displays posts for a specific tag with canonicalization, sorting options, and sidebar layout.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings UI for username changes, avatar upload, profile edits, pond membership, and admin tag tools.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, layout settings, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, requests, and state for the Ribbit UI."
}