{
  "backend/main.mo": "Main canister defining storage maps, pond/post/ribbit types, activity tracking, likes, tag stats, user identity linkage, and access control setup.",
  "backend/migration.mo": "Stub migration module providing run() to transform old actor state to new format.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components and pages for reference or documentation.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites, build steps, and commands for deploying the app to the Internet Computer.",
  "frontend/index.html": "Base HTML file providing root container and loading the main frontend entry script.",
  "frontend/scripts/combined-update.sh": "Bash script automating backend binding generation, frontend build, and canister deployment with error handling.",
  "frontend/src/App.tsx": "Main React entry configuring routes, global layout, theming, and Froggy Phrase initialization.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component handling bookmark state and icon display.",
  "frontend/src/components/CommentItem.tsx": "Comment display component showing avatar, metadata, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar supporting multiple emoji types, counts, hover animation, and selection.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution message displayed across the site.",
  "frontend/src/components/Header.tsx": "Header component with navigation, search (desktop and mobile), user avatar loading, and search dropdown/modal behavior.",
  "frontend/src/components/Layout.tsx": "Defines the main layout with header, footer, outlet content, and a mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Left sidebar showing navigation links and recent activity with active-state detection and pond/lily lookups.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, stats, like/share actions, optional tags, and image preview.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders an image with aspect‑ratio detection, using a blurred backdrop for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the LeftSidebar with scroll‑locking and animated open/close states.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows detailed pond info including stats, moderators, visibility, and join/leave controls.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button logic for pond cards with mutation handling and toast feedback.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header showing pond banner, profile info, and navigation tabs for Feed and About.",
  "frontend/src/components/PostCard.tsx": "Card displaying a post with votes, metadata, content preview, image, tag, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, linked post title, timestamp, content, and link to the conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Popover tray providing quick emoji buttons for ribbit reactions.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit with avatar, timestamp, likes, and a reply form with nested depth indentation.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar with a blurred placeholder and transitions to the full image once loaded.",
  "frontend/src/components/RightSidebar.tsx": "Sidebar showing trending ponds, popular tags, and recent high‑view posts with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full‑screen mobile search modal with trending searches, suggestions, and input handling.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown showing trending searches or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar listing top, trending, and newest tags using modular tag sections with loading states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components for tab lists and triggers with underline classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity persistence, and auth client setup.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend pond, user, and search operations using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light and dark modes, base typography, and various utility classes.",
  "frontend/src/lib/formatNumber.ts": "Provides a helper to format large numbers into k, M, and B shorthand.",
  "frontend/src/lib/froggyPhraseWordList.ts": "Exports frog-related terms and a large general word list for Froggy Phrase generation.",
  "frontend/src/lib/imageCompression.ts": "Implements client‑side image validation, resizing, and compression with GIF animation detection.",
  "frontend/src/lib/pondNameValidation.ts": "Validates and normalizes pond names as strict alphanumeric strings with error messaging.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name to assign deterministic ranks.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard and textarea fallbacks.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly errors.",
  "frontend/src/lib/user.ts": "Manages usernames, IDs, Froggy Phrase generation/storage, and settings backup in localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per‑lily cooldown timestamps in localStorage to limit view count increments.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity context, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, key features, and community guidelines using static content and UI components.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with ranking, join controls, and loading states, using pond and membership data from queries.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a lily with support for text, images, links, tags, validation, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form including name validation, description, froggy phrase, and compressed banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Allows creating text, image, or link posts with pond selection, image compression, validation, and submission to backend.",
  "frontend/src/pages/FrogProfilePage.tsx": "Renders a user profile page showing avatar, name, post/comment counts, and tabs for posts and comments with loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with trending/new sorting, search handling, and sidebars, including loading and empty states.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, likes, views, and ribbit creation, handling view count increment logic and media display.",
  "frontend/src/pages/PondAboutPage.tsx": "Renders detailed pond information including moderators, visibility, join/leave actions, and loading/not-found states.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed of lilies with sorting, sidebars, banner header, and loading/not-found handling.",
  "frontend/src/pages/PostPage.tsx": "Displays a full post with metadata, image/link content, and threaded comments, and allows creating new comments.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, loading each by ID and allowing removal from saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats, switchable via tabs and navigable to tag detail pages.",
  "frontend/src/pages/TagPage.tsx": "Shows lilies for a specific tag with sorting, canonical tag redirects, and subcategory listings.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar uploads, profile editing, pond management, and admin tools.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, containers, animations, and enabled plugins for the frontend.",
  "project_state.json": "Defines project metadata, architectural notes, and multiple feature requests focused on removing AccessControl checks for normal users and auto‑joining pond creators. Also tracks issues with unauthorized errors and describes pending/in‑progress backend updates."
}