{
  "backend/main.mo": "Defines the main Ribbit canister with storage, access control, user profiles, ponds, posts, ribbits, likes, activity tracking, and tag stats data structures.",
  "feature_evidence.json": "Contains a feature evidence report describing a frontend layout update to LilyPage and its associated files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend files, describing their roles in routing, layout, UI components, and pages.",
  "frontend/index.html": "Basic HTML entry file that mounts the React app and loads main.tsx, setting metadata and favicon.",
  "frontend/src/App.tsx": "Defines the app’s TanStack Router routes and wraps the application in ThemeProvider and RouterProvider.",
  "frontend/src/components/BookmarkButton.tsx": "Renders a bookmark toggle button for a lily using local bookmark state with click handling.",
  "frontend/src/components/CommentItem.tsx": "Empty file placeholder for a comment display component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty file placeholder for emoji reaction UI.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution to caffeine.ai, styled with border and muted text.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation, user avatar, dropdowns, and mobile search modal handling.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping all pages with Header, Footer, and mobile sidebar drawer, auto-closing on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar navigation component showing links and recent activity, with active-route highlighting and mobile drawer support.",
  "frontend/src/components/LilyCard.tsx": "Displays a post card with pond/user info, image handling, like/share actions, and metadata counts.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer component that shows the left sidebar with scroll lock and animated overlay.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderator info, and join/leave controls.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header with banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file placeholder for a post card component.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file placeholder for an emoji tray component.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit reply with avatar, timestamp, like button, and reply form.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar showing trending ponds, popular tags, and recent popular posts.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full‑screen mobile search modal showing trending searches and suggestions with input handling and selection callbacks.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown panel for desktop search showing trending searches or suggestions based on query state.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar displaying top, trending, and newest tags with activity counts.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components around TabsList and TabsTrigger to create underline-style tabs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper methods for modifying the list.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication, including login, logout, and identity state management.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates on change.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating ponds, profiles, searches, and related backend data via the actor.",
  "frontend/src/index.css": "Tailwind base and custom CSS variables for light/dark themes plus utility classes for UI behavior and styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short notations like k, M, and B with simple rounding.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric validation, normalization, and error messaging for pond names.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using the Web Share API with clipboard and textarea fallbacks plus toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Handles alphanumeric validation, normalization, and optional error messaging for tags.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, Froggy Phrase authentication, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view cooldown tracking using timestamps in localStorage.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Static page explaining Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Lists all ponds with join status, loading states, and navigation to individual pond pages.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a new lily with text, image, or link, including pond selection, tag suggestions, validation, and image preview handling.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with name and phrase validation, description input, and banner/profile image upload and preview.",
  "frontend/src/pages/CreatePostPage.tsx": "Placeholder page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed of lilies with trending/new sorting, search handling, and sidebars, including loading and empty states.",
  "frontend/src/pages/LilyPage.tsx": "Shows a single lily with comments, like/view counts, image lightbox, and logic for cooldown-based view count increments.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond information including moderators, visibility, creation date, membership status, and leave-pond functionality.",
  "frontend/src/pages/PondPage.tsx": "Pond feed page that loads pond data, lilies, membership state, and renders join actions, tabs, and sidebars with loading and not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lilies, loading states, and removal actions using LilyCard components.",
  "frontend/src/pages/TagHubPage.tsx": "Tag discovery hub showing top, trending, and newest tags with loading states and sidebars.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with canonical-tag redirect logic and sort controls.",
  "frontend/src/pages/UserSettingsPage.tsx": "User settings panel handling username changes, avatar uploads, profile editing, pond membership, admin tools, and Froggy Phrase backup/restore.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, and plugin setup.",
  "project_state.json": "Project metadata tracking state, known issues, and a pending feature request about aligning LilyPage layout."
}