{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control state, multiple ordered maps for ponds, posts, ribbits, users, tags, and activity tracking, plus related data types.",
  "feature_evidence.json": "Feature evidence report documenting UI changes enabling anonymous access and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend source files and pages.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx with metadata and favicon.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and all route definitions for pages including tags and saved lilies.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks hook to add or remove a lily from saved items.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Renders site footer with navigation links and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with search, navigation, create menu, and avatar display, supporting mobile and desktop interactions.",
  "frontend/src/components/Layout.tsx": "Page layout wrapping content with header, footer, and a mobile sidebar drawer that closes on navigation.",
  "frontend/src/components/LeftSidebar.tsx": "Left sidebar navigation with active-state highlights and recent activity list supporting lily previews.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post card with avatar, stats, like/share actions, and optional user or pond context.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Implements a mobile slide-in left sidebar drawer with body scroll locking.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, stats, moderator info, and join/leave controls with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Renders a mobile pond header with banner, profile image, info, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty file placeholder for a PostCard component.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty file placeholder for a RibbitEmojiTray component.",
  "frontend/src/components/RibbitItem.tsx": "Renders a threaded ribbit reply item with avatar, likes, reply form, and nesting support.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and popular recent posts with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Implements a full-screen mobile search modal showing trending searches and suggestions with interactive selection.",
  "frontend/src/components/search/SearchDropdown.tsx": "Displays a dropdown under the search bar with trending terms or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags using reusable modules with loading states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger with underline-themed classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs using localStorage with helpers to add, remove, toggle, and list bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth state, loading stored identities, login flow, and exposes identity/context helpers.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query currently matches.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with ponds, profiles, searches, and membership via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, base styling, and custom utility classes including search input, icon sizes, and hover effects.",
  "frontend/src/lib/formatNumber.ts": "Provides a helper to format large numbers into k/M/B shorthand with simple rounding.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and provides error messages for pond names restricted to alphanumeric characters.",
  "frontend/src/lib/shareLily.ts": "Implements lily link sharing via Web Share API with clipboard fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric-only tags and returns user-friendly error messages.",
  "frontend/src/lib/user.ts": "Manages user identity and settings in localStorage, including username generation, Froggy Phrase handling, and settings backup/restore.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per‑lily view count cooldowns in localStorage to limit increment frequency.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing Ribbit, its features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with loading states, join status, and a link to start a new pond.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a lily with text, image, or link, including pond selection, tag suggestions, validation, and image preview handling.",
  "frontend/src/pages/CreatePondPage.tsx": "Form page for creating a pond with name validation, froggy phrase rules, and banner/profile image upload with previews.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder page for creating a post.",
  "frontend/src/pages/HomePage.tsx": "Home feed displaying lilies sorted by trending or new, with search integration and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with details, ribbits, likes, view count logic, and image lightbox support.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed information about a pond including moderators, visibility, images, and leave-pond functionality.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond’s feed with lilies, handles joining ponds, and shows loading or not-found states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file for an individual post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows bookmarked lilies using local storage and loads each lily or a fallback if missing.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with loading states and sidebar layout.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting and canonical tag redirection.",
  "frontend/src/pages/UserSettingsPage.tsx": "Manages user settings including username changes, avatar upload, ponds, admin tools, and Froggy Phrase recovery.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s state and requirements for enabling full anonymous access, highlighting current authorization issues that block anonymous users. Lists existing features and new backend requests needed to remove user-role gating for actions like creating ponds, lilies, and saving avatars."
}