{
  "backend/main.mo": "Defines the Ribbit canister with storage mixins, access control, user/pond/post/ribbit maps, activity tracking, tag stats, and type definitions for core data structures.",
  "feature_evidence.json": "Describes evidence for a UI feature change affecting mobile Join Pond button placement, listing impacted files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing their structure, UI behavior, and layout details.",
  "frontend/index.html": "Base HTML file setting up the root mount point and loading the main React entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all app pages and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks hook with customizable colors and click handling.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, username, timestamp, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Displays emoji reaction buttons with counts, hover effects, and a callback for selecting reactions.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and a caffeine.ai attribution line.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, mobile menu, create dropdown, and user avatar handling including search behavior and dropdown logic.",
  "frontend/src/components/Layout.tsx": "Layout component with header, footer, and mobile sidebar drawer, closing the drawer on route changes.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar showing navigation links and recent activity, with route-based highlighting and optional mobile drawer mode.",
  "frontend/src/components/LilyCard.tsx": "Card displaying a lily post with avatar, metadata, image, and interactive like/share/bookmark controls.",
  "frontend/src/components/LilyImageFrame.tsx": "Image frame that preserves a 4:3 aspect ratio and adds a blurred backdrop for non‑4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with scrim overlay and body scroll locking.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, moderators, stats, and join/leave controls with loading states.",
  "frontend/src/components/PondCardJoinControl.tsx": "Join button for pond cards handling join actions and disabling when already a member.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile header for a pond page showing banner, profile image, details, and feed/about tab navigation.",
  "frontend/src/components/PostCard.tsx": "Displays a post with votes, metadata, preview content, optional image, tag, and comment/view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Renders a user’s comment with avatar, timestamp, content, and link to the related lily.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji picker that calls a callback when an emoji is selected.",
  "frontend/src/components/RibbitItem.tsx": "Shows a threaded ribbit with avatar, content, likes, replies, and supports creating nested replies.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Lazily loads an avatar image with a blurred placeholder and supports avatar or plain img rendering modes.",
  "frontend/src/components/RightSidebar.tsx": "Displays trending ponds, popular tags, and recent popular posts using fetched data with loading skeletons.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile search modal showing trending terms or suggestions based on query, with selection and submit handlers.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown under search bar displaying trending searches or query-based suggestions for selection.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Shows top, trending, and newest tags using reusable tag stats modules with loading states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and trigger components for underline-style tab navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor and invalidates dependent queries on identity change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs in localStorage with helpers to toggle, add, remove, clear, and read bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client creation, login, identity load, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given media query matches using window.matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for ponds, posts, user data, and mutations.",
  "frontend/src/index.css": "Tailwind base and custom CSS variables for theming, plus utility classes for UI styling and behaviors.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into short k/M/B notation with rounding.",
  "frontend/src/lib/imageCompression.ts": "Validates, resizes, and compresses images client‑side, skipping animated GIFs and returning compression results.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric validation, normalization, and error messages for pond names.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lilyCount, memberCount, and name, returning a map of pond names to ranks.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns user-friendly error messages.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase storage, and settings backup via localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per‑lily cooldown tracking in localStorage to limit view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with app description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays all ponds with ranking, join controls, and loading states.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a lily with text, image, or link, including tag suggestions, validation, image compression, and pond selection.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with name validation, descriptions, and compressed banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Allows creating a post of type text, image, or link with pond selection, optional tag, image compression, and submission handling.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user profile with avatar, stats, and tabs showing the user's posts and comments, with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with trending/new sorting, search results handling, and sidebars for navigation.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily post with comments, likes, views, and interaction handlers including ribbit creation and view count incrementing.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed information about a pond, including moderators, visibility, description, and join/leave actions.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s feed with its lilies, banners, and navigation, supporting loading and not‑found states.",
  "frontend/src/pages/PostPage.tsx": "Displays an individual post with its content, image, metadata, threaded comments, and comment creation.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading states and removal options.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with stats and navigation to individual tag pages.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies associated with a tag, handling canonical tag redirects and sorting options, with sidebars and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user profile settings including username changes, avatar uploads, froggy phrase management, pond membership actions, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for the project UI.",
  "project_state.json": "Tracks project state, requirements, and pending tasks related to correcting pond creation behavior and mobile UI adjustments."
}