{
  "backend/main.mo": "Defines the Ribbit canister with storage, access control, user data, ponds, posts, ribbits, tags, likes, and activity-tracking structures.",
  "feature_evidence.json": "Feature evidence report mapping a layout update request to the affected frontend LilyPage file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing layout, components, and behavior across the app.",
  "frontend/index.html": "HTML entry point defining the root container and loading the frontend’s main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and all application routes including TagHubPage.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks to add or remove a lily from saved items.",
  "frontend/src/components/CommentItem.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/Footer.tsx": "Footer component with navigation links and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, navigation controls, user avatar, and mobile/desktop behavior handling.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with header, footer, and a mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Left sidebar navigation showing links and recent activity with active-route highlighting.",
  "frontend/src/components/LilyCard.tsx": "Card component displaying a post with avatar, metadata, image handling, and like/share interactions.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper that toggles a sliding left sidebar and manages body scroll locking.",
  "frontend/src/components/PondAboutSidebar.tsx": "Sidebar showing pond details, stats, moderators, and join/leave controls with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header rendering banner, profile image, description, and tab navigation.",
  "frontend/src/components/PostCard.tsx": "Empty placeholder file for a post card component.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty placeholder file for an emoji tray component.",
  "frontend/src/components/RibbitItem.tsx": "Displays a threaded ribbit reply with avatar, content, timestamp, like button, and reply form.",
  "frontend/src/components/RightSidebar.tsx": "Right sidebar listing trending ponds, popular tags, and recent high‑view posts with loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full‑screen search modal showing trending searches, suggestions, and a search input with callbacks.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown search panel displaying trending searches and suggestions based on the query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Sidebar showing top, trending, and newest tags using tag stats modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrappers around TabsList and TabsTrigger with custom underline classes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and helper functions to modify them.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and client creation.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating pond, user, and search data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light and dark modes, and custom utility classes for UI behaviors.",
  "frontend/src/lib/formatNumber.ts": "Provides a helper to format large numbers into short notation like k, M, or B.",
  "frontend/src/lib/pondNameValidation.ts": "Validates, normalizes, and returns error messages for alphanumeric pond names.",
  "frontend/src/lib/shareLily.ts": "Implements sharing a lily URL using Web Share API with clipboard and textarea fallbacks and toast feedback.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and provides optional tag error messages.",
  "frontend/src/lib/user.ts": "Manages user identity, Froggy Phrase storage, and backup/restore logic using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Tracks per-lily cooldown timestamps in localStorage to limit view count increments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with project description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of ponds with join status, loading states, and navigation to create or view ponds.",
  "frontend/src/pages/CreateLilyPage.tsx": "Form page for creating a lily post with support for text, image, or link types, tag suggestions, pond selection, and input validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Page for creating a new pond with name validation, description, froggy phrase rules, and optional banner/profile image uploads.",
  "frontend/src/pages/CreatePostPage.tsx": "Empty placeholder file for a create-post page.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing a feed of lilies with trending/new sorting, optional search results, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with image handling, view count incrementing, likes, and ribbit (comment) creation.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed pond info including moderators, visibility, images, and allows the user to leave the pond.",
  "frontend/src/pages/PondPage.tsx": "Fetches pond data, lists lilies sorted by timestamp, and handles join actions with loading and error states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder file for a post page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Displays locally bookmarked lily posts, fetching each lily and allowing removal from bookmarks.",
  "frontend/src/pages/TagHubPage.tsx": "Shows top, trending, and newest tags with stats using tabbed navigation and server-fetched tag lists.",
  "frontend/src/pages/TagPage.tsx": "Displays lilies for a specific tag with sorting options and redirects to canonical tags when needed.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user profile and settings management including username changes, avatars, ponds, and admin tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, radius, animations, and plugin setup.",
  "project_state.json": "Project metadata and feature request tracking for aligning LilyPage layout elements."
}