{
  "backend/main.mo": "Defines the Ribbit canister with storage, access control, user data, posts, ponds, tags, likes, activity tracking, and related types.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files for reference.",
  "frontend/index.html": "HTML entry point loading the React app with root div and main.tsx script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme provider and toaster.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button using useBookmarks with customizable colors.",
  "frontend/src/components/CommentItem.tsx": "Renders a comment with avatar, metadata, content, and optional like/reply actions.",
  "frontend/src/components/EmojiReactions.tsx": "Emoji reaction bar supporting five emoji types with hover and selection states.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, create menu, mobile drawer trigger, and avatar loading.",
  "frontend/src/components/Layout.tsx": "Page layout with header, footer, and route outlet plus mobile sidebar drawer handling.",
  "frontend/src/components/LeftSidebar.tsx": "Renders the app's left sidebar with navigation links and recent activity items, highlighting the active route. Fetches recent activities and related lily data.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post with avatar, metadata, like/share actions, and optional tags. Fetches counts, pond data, and user avatar dynamically.",
  "frontend/src/components/LilyImageFrame.tsx": "Shows an image in a fixed aspect ratio, using a blurred backdrop if the image isn’t 4:3. Handles aspect ratio detection on load.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Provides a slide-in mobile drawer containing the LeftSidebar with a backdrop overlay. Disables body scrolling while open.",
  "frontend/src/components/PondAboutSidebar.tsx": "Displays detailed pond information, stats, moderators, and join/leave controls. Fetches pond data and handles membership actions.",
  "frontend/src/components/PondCardJoinControl.tsx": "Renders a join button for pond cards, handling join mutations and disabling when already joined. Provides toast feedback on success or failure.",
  "frontend/src/components/PondMobileHeader.tsx": "Shows mobile pond header with banner, profile image, description, and tab navigation for feed/about. Navigates to related routes on tab click.",
  "frontend/src/components/PostCard.tsx": "Displays a generic post with voting controls, metadata, content preview, optional image, and tag. Supports comment and view counts.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, timestamp, related lily link, and a link to view the full conversation.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Provides a popover emoji picker that triggers a callback when an emoji is selected.",
  "frontend/src/components/RibbitItem.tsx": "Renders a ribbit with avatar, timestamp, like button, and threaded replies with optional reply form logic.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Loads an avatar image with a tiny blurred placeholder and transitions to the final image once loaded.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular lilies with loading states and basic sorting logic.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Mobile full-screen search modal showing trending searches or suggestions and handling input and selection events.",
  "frontend/src/components/search/SearchDropdown.tsx": "Renders a dropdown showing trending searches or live suggestions based on user input and triggers selection callbacks.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags using tag stats modules with loading and empty states.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled tab list and trigger components that apply underline-based tab styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmarked lily IDs with localStorage persistence and provides helpers to toggle and query bookmarks.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced value that updates after a delay when the input changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities via AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches and updates reactively.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend ponds, posts, and user-related actions using the actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dark mode overrides, and utility classes for UI styling.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into compact notation such as k, M, or B.",
  "frontend/src/lib/imageCompression.ts": "Handles client‑side image validation, resizing, and compression, skipping animated GIFs and adjusting formats based on transparency.",
  "frontend/src/lib/pondNameValidation.ts": "Provides alphanumeric pond-name validation, normalization, and user-friendly error messages.",
  "frontend/src/lib/pondRank.ts": "Sorts ponds by lily count, member count, and name, returning a map of ranks.",
  "frontend/src/lib/shareLily.ts": "Shares a lily URL using Web Share API with clipboard and textarea fallbacks and toast notifications.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes alphanumeric tags and returns appropriate error messages.",
  "frontend/src/lib/user.ts": "Manages usernames, user IDs, and Froggy Phrase backup/restore logic using localStorage.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-lily view count cooldown tracking via localStorage with check, record, and clear helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the Ribbit about page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Shows a list of all ponds with ranks, join controls, loading states, and navigation.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create a lily with text, image, or link content, including pond selection, tag suggestions, and image compression.",
  "frontend/src/pages/CreatePondPage.tsx": "Implements a pond creation form with name validation, description, optional images, and image compression handling.",
  "frontend/src/pages/CreatePostPage.tsx": "Allows users to create text, image, or link posts with pond selection, tag input, and optional image compression.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile, avatar, posts, and comments with loading and not‑found states.",
  "frontend/src/pages/HomePage.tsx": "Shows the main lily feed with trending/new sorting, search support, and sidebars.",
  "frontend/src/pages/LilyPage.tsx": "Displays a single lily with ribbits, handles view count incrementing, sorting, commenting, liking, and image lightbox.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed information about a pond including moderators, visibility, and join/leave actions.",
  "frontend/src/pages/PondPage.tsx": "Renders a pond’s feed with its lilies, join controls, and mobile/desktop layouts.",
  "frontend/src/pages/PostPage.tsx": "Displays a single post with threaded ribbits, posting comments, and metadata like timestamp and pond link.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Shows locally bookmarked lilies, loading each lily and allowing removal of missing or saved items.",
  "frontend/src/pages/TagHubPage.tsx": "Lists top, trending, and newest tags with stats and navigation to tag pages.",
  "frontend/src/pages/TagPage.tsx": "Renders a tag-specific feed showing lilies filtered by tag with sorting and automatic redirect to canonical tags, along with sidebars and loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Implements user settings for username changes, avatar upload, Froggy Phrase management, pond membership management, and admin tools.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project state and requirements focused on fixing pond creation so only the creating user becomes a member."
}