{
  "backend/main.mo": "Main Motoko canister defining storage, access control, user data, posts, ponds, ribbits, tags, and activity tracking types and maps.",
  "feature_evidence.json": "Feature evidence report listing UI hover fixes and affected frontend component files with metadata.",
  "frontend-file-summaries.txt": "Textfile containing prewritten summaries of many frontend React components and pages.",
  "frontend/index.html": "Base HTML document mounting the React app via root div and main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps app in theme provider, and defines main application routing tree.",
  "frontend/src/components/BookmarkButton.tsx": "Bookmark toggle button component using useBookmarks hook with customizable colors.",
  "frontend/src/components/CommentItem.tsx": "Empty file placeholder for a comment item component.",
  "frontend/src/components/EmojiReactions.tsx": "Empty file placeholder for emoji reactions component.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links and attribution including heart icon.",
  "frontend/src/components/Header.tsx": "Responsive header with search UI, logo behavior, user avatar, create menu, and mobile search modal.",
  "frontend/src/components/Layout.tsx": "Root layout with header, footer, and mobile sidebar drawer that closes on route change.",
  "frontend/src/components/LeftSidebar.tsx": "Sidebar component rendering navigation links and recent activity with route-aware highlighting.",
  "frontend/src/components/LilyCard.tsx": "Displays a lily post card with avatar, metadata, image, and like/share interactions.",
  "frontend/src/components/LilyImageFrame.tsx": "Renders images with a blurred backdrop for non‑4:3 ratios and standard display for 4:3 images.",
  "frontend/src/components/MobileLeftSidebarDrawer.tsx": "Mobile drawer wrapper for the left sidebar with scroll locking and animated slide-in.",
  "frontend/src/components/PondAboutSidebar.tsx": "Shows pond details, moderators, stats, and join/leave controls with loading states.",
  "frontend/src/components/PondMobileHeader.tsx": "Mobile pond header displaying banner, profile image, and tab navigation for feed/about.",
  "frontend/src/components/PostCard.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ProfileRibbitItem.tsx": "Displays a user's ribbit with avatar, timestamp, linked lily title, and conversation link.",
  "frontend/src/components/RibbitEmojiTray.tsx": "Empty component file with no implementation.",
  "frontend/src/components/RibbitItem.tsx": "Displays a ribbit with avatar, timestamp, likes, and reply form, handling like/unlike and reply creation via query hooks.",
  "frontend/src/components/RibbitMiniBlurAvatarImage.tsx": "Renders an avatar image with a blurred placeholder that transitions to the final image once loaded.",
  "frontend/src/components/RightSidebar.tsx": "Shows trending ponds, popular tags, and recent popular posts using data from query hooks with skeleton loading states.",
  "frontend/src/components/search/MobileSearchModal.tsx": "Full‑screen mobile search modal showing trending searches and suggestions with input handling and selection callbacks.",
  "frontend/src/components/search/SearchDropdown.tsx": "Dropdown search panel showing trending searches or suggestions based on the current query.",
  "frontend/src/components/TagHubRightSidebar.tsx": "Displays top, trending, and newest tags with activity stats using reusable tag stats modules.",
  "frontend/src/components/UnderlineTabs.tsx": "Provides styled wrapper components for tab lists and tab triggers with underline styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Provides bookmark state synced to localStorage with helpers to add, remove, toggle, and clear lily IDs.",
  "frontend/src/hooks/useDebounce.ts": "Returns a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a given CSS media query matches and updates reactively.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating pond, user, post, and activity data via an actor API.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables, including light/dark themes and utility classes.",
  "frontend/src/lib/formatNumber.ts": "Formats large numbers into compact strings like 1.2k or 3.4M.",
  "frontend/src/lib/imageCompression.ts": "Validates, resizes, and compresses images client‑side, including GIF detection and canvas-based optimization.",
  "frontend/src/lib/pondNameValidation.ts": "Provides helpers to validate and normalize pond names to strict alphanumeric rules.",
  "frontend/src/lib/shareLily.ts": "Shares a lily link using Web Share API with clipboard and fallback support.",
  "frontend/src/lib/tagValidation.ts": "Validates and normalizes tags to lowercase alphanumeric form with optional empty values.",
  "frontend/src/lib/user.ts": "Handles user identity and Froggy Phrase storage in localStorage, including username generation, settings backup, and recovery.",
  "frontend/src/lib/viewCountCooldown.ts": "Implements per-post cooldown tracking for view counts using timestamps stored in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with platform description, features, and community guidelines.",
  "frontend/src/pages/AllPondsPage.tsx": "Displays a list of all ponds with join status, loading states, and navigation links.",
  "frontend/src/pages/CreateLilyPage.tsx": "Provides a form to create new lilies with text, image, or link types, tag suggestions, and validation.",
  "frontend/src/pages/CreatePondPage.tsx": "Provides a form to create new ponds with validation and optional banner/profile image upload and compression.",
  "frontend/src/pages/CreatePostPage.tsx": "Placeholder file with no implemented content.",
  "frontend/src/pages/FrogProfilePage.tsx": "Displays a user's profile with avatar, post and comment counts, and tabs for posts and comments using multiple data-fetching hooks.",
  "frontend/src/pages/HomePage.tsx": "Shows the main feed of lilies with trending/new sorting, search handling, and sidebars with skeleton loading states.",
  "frontend/src/pages/LilyPage.tsx": "Renders a single lily with comments, likes, view tracking, posting ribbits, image lightbox, and sorting for comments.",
  "frontend/src/pages/PondAboutPage.tsx": "Shows detailed information about a pond including moderators, visibility, creation date, and membership controls.",
  "frontend/src/pages/PondPage.tsx": "Displays a pond's feed with join controls, sorting, sidebars, and loading/error states.",
  "frontend/src/pages/PostPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/SavedLiliesPage.tsx": "Lists locally bookmarked lilies with loading/error handling and removal controls.",
  "frontend/src/pages/TagHubPage.tsx": "Renders the tag hub with tabs for top, trending, and newest tags, fetching tag stats and listing them with loading and empty states.",
  "frontend/src/pages/TagPage.tsx": "Displays posts associated with a specific tag, handles canonical tag redirects, and supports sorting options with loading states.",
  "frontend/src/pages/UserSettingsPage.tsx": "Provides user settings including username changes, avatar upload, profile editing, pond management, and admin tools with extensive form and query logic.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, color tokens, animations, and plugins for styling across the app.",
  "project_state.json": "Describes the project’s state, known issues, and feature requests related to fixing hover backgrounds and rounding sidebar hover highlights."
}