{
  "kind": "build_request",
  "title": "Fix Ribbits image uploads (store + display) including blurred background",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add end-to-end support for images attached to Ribbits: the frontend must upload the selected image when creating a ribbit, the backend must persist the image blob with the ribbit, and ribbit queries must return the image so it can be displayed.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i just need you to fix ribbits so that image uploads actually work. dont do anything else."
        ]
      },
      "acceptanceCriteria": [
        "On the Lily page, selecting an image in the ribbit composer and posting creates a ribbit that includes an image attachment.",
        "After a page refresh, the ribbit image still loads (i.e., it was persisted in the canister, not only in client state).",
        "The ribbit image is returned as an optional blob field on the ribbit object from the backend APIs used by the UI (threaded ribbits and any other ribbit lists).",
        "Creating ribbits without an image continues to work exactly as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure ribbit images render with the same blurred background/backdrop behavior used for non-4:3 images (i.e., a blurred backdrop behind the image), and apply this consistently anywhere ribbits are rendered with images (thread view on Lily page and the profile ribbit/comments list if applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also image uploads for ribbits dont include the blurred background."
        ]
      },
      "acceptanceCriteria": [
        "Ribbit images display with a blurred backdrop when the image aspect ratio does not match the intended frame (no plain hard-edge rendering).",
        "The blurred backdrop behavior is visible on ribbits on the Lily page ribbits list.",
        "If ribbits are shown on the user profile ribbits/comments list, the same blurred backdrop behavior is used there as well."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Perform a safe state upgrade for existing deployed data to support the new optional ribbit image field without breaking existing ribbits.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "dont change anything else but that."
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister preserves all existing ponds, posts, ribbits, likes, and other state.",
        "All pre-existing ribbits load successfully after upgrade and have ribbit.image = null/empty.",
        "New ribbits created after upgrade can include an image and return it correctly."
      ]
    }
  ],
  "constraints": [
    "Do not make any changes unrelated to ribbit image upload and ribbit image rendering.",
    "Do not change overall site layout/styling except what is strictly necessary to display ribbit images and their blurred backdrop.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Only create backend/migration.mo if required to preserve/upgrade existing stable state."
  ],
  "nonGoals": [
    "Fixing or changing any other layout issues.",
    "Adding new features to ribbits beyond image upload + blurred backdrop rendering (e.g., editing, deleting, new reactions, new sorting, new composer UI features).",
    "Changing how lily (post) image uploads work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}