{
  "kind": "build_request",
  "title": "Add client-side compression for all image uploads",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a shared client-side image compression utility and apply it to all image uploads before converting to ExternalBlob bytes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add compression to all image uploads."
        ]
      },
      "acceptanceCriteria": [
        "A reusable utility exists (e.g., in frontend/src/lib/) that takes an image File and returns a compressed File or Uint8Array suitable for upload.",
        "The utility resizes images to a reasonable maximum dimension (to prevent huge uploads) and applies lossy compression (quality setting) for JPEG/WebP outputs.",
        "Non-image files are rejected and produce a clear error.",
        "Animated GIFs (if supported by the browser input) are not recompressed (to avoid stripping animation) and are uploaded as-is.",
        "Compression failures fall back to uploading the original file bytes with a user-facing error toast indicating compression could not be applied."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Compress images uploaded when creating a Lily (CreateLilyPage) so the uploaded ExternalBlob is built from the compressed bytes, and ensure the preview reflects what will be uploaded.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add compression to all image uploads."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/CreateLilyPage.tsx, when lilyType === 'image', the selected image is compressed prior to ExternalBlob.fromBytes(...).",
        "The on-screen preview for an image Lily uses the compressed image (not the original), so users preview exactly what will be uploaded.",
        "Submitting a non-image file (if forced via devtools) does not crash and shows an English error message."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Compress pond banner and profile images during pond creation (CreatePondPage) so both uploaded ExternalBlobs use compressed bytes, and ensure previews reflect the compressed images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add compression to all image uploads."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/CreatePondPage.tsx, both bannerImageFile and profileImageFile are compressed before arrayBuffer()/ExternalBlob.fromBytes(...).",
        "Both previews (banner and profile) display the compressed versions that will be uploaded.",
        "If compression fails for either image, the UI shows an English toast error and falls back to uploading the original bytes for that image."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Compress avatar images in User Settings before uploading so the avatar ExternalBlob is built from compressed bytes, while keeping the existing upload progress behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add compression to all image uploads."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/UserSettingsPage.tsx, the selected avatar is compressed before ExternalBlob.fromBytes(...).withUploadProgress(...).",
        "Upload progress continues to display and updates as before.",
        "The avatar preview reflects the compressed image that will be uploaded.",
        "If compression fails, show an English toast error and upload the original avatar bytes instead."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose them only).",
    "Do not modify files listed in frontend.immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/main.tsx).",
    "Keep all changes within the existing React + TypeScript + Tailwind + React Query stack; do not add external backend services."
  ],
  "nonGoals": [
    "Backend-side image compression or transcoding in Motoko.",
    "Adding new image upload features or new upload destinations beyond existing flows.",
    "Changing existing data models or canister storage schema for images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}