{
  "kind": "build_request",
  "title": "Mobile-only: Move “Join Pond” button from Pond Feed to Pond About page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "For mobile layouts only, remove the \"Join Pond\" button from the Pond Feed page and instead render a \"Join Pond\" button on the Pond About page in the same UI location where the \"Leave Pond\" button appears (i.e., within the About page’s membership controls section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "this is just for mobile version, can you relocate the join pond button from the feed page to the about page. put it in the same place the leave pond button shows up."
        ]
      },
      "acceptanceCriteria": [
        "On mobile (lg:hidden) in frontend/src/pages/PondPage.tsx, the Join Pond button is no longer displayed.",
        "On mobile (lg:hidden) in frontend/src/pages/PondAboutPage.tsx, when the user is not a member, a Join Pond button is displayed in the same section where the Leave Pond button is displayed for members.",
        "On mobile in PondAboutPage, when the user is a member, the existing Leave Pond button behavior remains unchanged (including loading/disabled state).",
        "Joining from the About page triggers the existing join mutation and displays the existing success/error toast messaging consistent with the current app patterns (e.g., “Successfully joined the pond!” / “Failed to join pond”).",
        "Desktop behavior is unchanged: the feed’s desktop right sidebar join/leave control (frontend/src/components/PondAboutSidebar.tsx) continues to work as before, and no new desktop-only Join button is introduced on the About page unless it already existed."
      ]
    }
  ],
  "constraints": [
    "Frontend change must be mobile-only (use existing responsive patterns such as lg:hidden).",
    "Do not edit any files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Fixing or changing backend pond-creation/membership logic.",
    "Changing desktop layout or relocating desktop join/leave controls.",
    "Changing the text labels beyond the existing English strings already used for Join/Leave toasts and buttons."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}