{
  "kind": "build_request",
  "title": "Fix LilyCard inset hover background not visible",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the LilyCard inset hover background so it is visibly rendered on hover (the inset layer must not be placed behind the LilyCard’s own background).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "the on hover back ground is not visible, why? --- dont code yet",
          "can you fix it?"
        ]
      },
      "acceptanceCriteria": [
        "Hovering a LilyCard shows a clearly visible inset (inset-2) rounded hover background.",
        "The hover background remains visible regardless of the LilyCard’s base background color (e.g., bg-card).",
        "The hover transition remains smooth (opacity transition) and does not flicker."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the inset hover background layer does not interfere with LilyCard interactions (links, like button, share button, bookmark button) and that click targets work normally while the hover effect is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "the on hover back ground is not visible, why? --- dont code yet",
          "can you fix it?"
        ]
      },
      "acceptanceCriteria": [
        "All LilyCard interactive elements remain clickable and behave the same with and without hover.",
        "The hover background layer does not capture pointer events.",
        "No new layout shift is introduced when hovering."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the inset hover background color compatible with both light and dark themes (avoid a hard-coded light-only gray that becomes invisible or visually incorrect in dark mode).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the on hover back ground is not visible, why? --- dont code yet"
        ]
      },
      "acceptanceCriteria": [
        "In light theme, the inset hover background appears as a subtle tint distinct from the card background.",
        "In dark theme, the inset hover background appears as a subtle tint distinct from the card background.",
        "Theme switching does not break hover visibility."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "No backend/canister changes.",
    "No redesign of LilyCard layout beyond what is necessary to restore the hover background visibility and preserve interactions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}