{
  "kind": "build_request",
  "title": "Allow anonymous visitors to create ponds, create lilies, and save avatars by removing #user role gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend authorization so anonymous visitors (Principal.isAnonymous(caller) == true) are allowed to perform all actions required for the anonymous-first product model, specifically including: creating ponds, creating lilies/posts, joining/leaving ponds, liking/unliking, creating ribbits/replies, and saving user settings/avatars—without trapping with errors like \"Unauthorized: Only users can ...\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "why cant i create ponds, save custom avatars, or create lilies? it says only users can do it. but the site is supposed to be anonymous and all users should have full access.",
          "just do it fix it"
        ]
      },
      "acceptanceCriteria": [
        "Using the app without Internet Identity login (anonymous principal), a user can successfully create a pond from the Create Pond page and is navigated to the new pond page.",
        "Using the app without Internet Identity login (anonymous principal), a user can successfully create a lily/post from the Create Lily page and see it appear in feeds.",
        "Using the app without Internet Identity login (anonymous principal), a user can join and leave a pond without backend authorization traps.",
        "Using the app without Internet Identity login (anonymous principal), a user can like/unlike a lily and like/unlike a ribbit without backend authorization traps.",
        "Using the app without Internet Identity login (anonymous principal), a user can create ribbits/replies without backend authorization traps.",
        "No backend method invoked by these flows throws/traps with a message indicating \"Only users can do it\" for anonymous callers."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust backend profile and avatar endpoints to support anonymous usage without trapping. In particular, ensure `getCallerUserProfile` and `saveCallerUserProfile` work for anonymous callers (or return safe results) so that the User Settings page can load and save an avatar for an anonymous visitor.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "why cant i create ponds, save custom avatars, or create lilies? it says only users can do it. but the site is supposed to be anonymous and all users should have full access.",
          "just do it fix it"
        ]
      },
      "acceptanceCriteria": [
        "Opening the User Settings page while anonymous does not crash due to `getCallerUserProfile` trapping; it returns a safe value (e.g., null) and the page renders.",
        "Saving an avatar on the User Settings page while anonymous completes successfully and the saved avatar is shown on subsequent reloads (as supported by the backend’s current avatar storage approach).",
        "No backend method used by User Settings traps with \"Unauthorized: Only users can access/save profiles\" for anonymous callers."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Frontend: remove or relax any UI-side gating that blocks anonymous visitors from initiating pond creation, lily creation, or avatar saving based on a “user role” check, so the UI matches the new backend behavior (anonymous users have full access).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "but the site is supposed to be anonymous and all users should have full access.",
          "just do it fix it"
        ]
      },
      "acceptanceCriteria": [
        "While not logged in, the Create Pond and Create Lily entry points remain available and their forms submit without the UI blocking due to role/permission assumptions.",
        "While not logged in, the User Settings avatar upload flow is available and does not show a role-based restriction message before attempting the save.",
        "Any error messaging shown for these actions reflects real validation issues (e.g., pond name validation) rather than role/permission restrictions for anonymous users."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or non-Internet-Computer storage systems.",
    "Introducing real-time features (WebSockets/push/chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}