{
  "kind": "build_request",
  "title": "Fix pond membership so anonymous users do not auto-join all ponds (use Froggy Phrase hash identity)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update pond membership logic to use Froggy Phrase hash (userId) instead of caller Principal, so anonymous users (shared principal `2vxsx-fae`) do not appear as the same member across all ponds. This includes updating the Pond storage model and all membership-related backend methods (join/leave/check/get joined ponds) to read/write membership by userId.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "why are all users automatically joining all ponds? i thought we fixed that? --- dont code yet",
          "go ahead and fix it"
        ]
      },
      "acceptanceCriteria": [
        "If two different browsers/devices have different Froggy Phrase hashes, joining a pond in one browser does not cause the other browser to appear as a member of that pond.",
        "Joining/leaving a pond updates membership status based on userId and does not depend on `msg.caller` for normal users.",
        "The backend no longer uses `pond.members : [Principal]` (or equivalent principal-based member lists) as the source of truth for user membership in ponds.",
        "Membership checks used by pond pages/cards/about sidebar are evaluated against the requesting userId (phrase hash) and not against the anonymous principal.",
        "Any remaining authorization failures (admin-only operations) continue to be enforced and return clear English error messages (e.g., \"Unauthorized: This operation is restricted to admins only.\")."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add/adjust phrase-hash-based membership endpoints used by the frontend so that the UI can fetch joined ponds and membership status using userId (Froggy Phrase hash), and update the frontend React Query hooks to call those phrase-hash endpoints (no principal-based fallback for pond membership).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "go ahead and fix it"
        ]
      },
      "acceptanceCriteria": [
        "Frontend membership actions (join/leave) call phrase-hash membership methods (e.g., `joinPondByPhraseHash(userId, pondName)` / `leavePondByPhraseHash(userId, pondName)`) and no longer rely on `joinPond(pondName)` / `leavePond(pondName)` for the anonymous-site flow.",
        "The joined-ponds query used by the UI is fetched by phrase hash (userId) so that joined ponds are scoped to the current Froggy Phrase identity.",
        "After join/leave, the frontend invalidates and refetches the pond + joined-ponds queries and the UI immediately reflects the correct membership state for that userId."
      ]
    },
    {
      "id": "REQ-7",
      "text": "If changing the stored type/schema for ponds is required to move from principal-based membership to userId-based membership, implement a conditional Motoko state migration so existing deployed state upgrades safely without trapping, and existing ponds remain readable after upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "go ahead and fix it"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister with existing state succeeds without traps.",
        "Existing ponds remain listable/readable after the upgrade.",
        "Legacy principal-based membership data (if present) does not cause all anonymous users to appear as members after migration; membership is determined solely by userId going forward."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Only create `backend/migration.mo` if a state upgrade/migration is necessary; follow the conditional migration policy.",
    "Do not edit any frontend files under `frontend/src/components/ui` or other `frontend.immutablePaths`."
  ],
  "nonGoals": [
    "Implementing or re-introducing principal-based authentication/authorization for normal user actions.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Building real-time presence or live membership updates (no websockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}