{
  "kind": "build_request",
  "title": "Desktop Pond page: remove Feed/About tabs and show About content in right sidebar (Reddit-style)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "On the Pond feed page route (/pond/$name), for desktop breakpoints (lg and up) remove the in-page \"Feed\" and \"About\" navigation tabs and keep the feed as the center column content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "in desktop mode, in the pond page, can you make the right sidebar/column contain the content in the about tab just like reddit does it.",
          "the about tab and the feed tab need to be removed  (just for desktop mode) additionally since they would be redundant",
          "ok go ahead"
        ]
      },
      "acceptanceCriteria": [
        "At viewport width >= Tailwind `lg`, PondPage no longer renders the \"Feed\" and \"About\" tab buttons currently shown above the feed (PondPage.tsx navigation section).",
        "At viewport width < `lg`, the current tab UI remains available (or an equivalent mobile navigation remains) so users can still reach the About view from mobile."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the Pond feed page route (/pond/$name), for desktop breakpoints (lg and up) replace the current generic RightSidebar discovery widgets with a pond-specific About sidebar that displays the same information currently shown in PondAboutPage (e.g., About This Pond, created date, member count, visibility, rules, tags, moderators, and join/leave actions as applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "in desktop mode, in the pond page, can you make the right sidebar/column contain the content in the about tab just like reddit does it.",
          "the about tab and the feed tab need to be removed  (just for desktop mode) additionally since they would be redundant"
        ]
      },
      "acceptanceCriteria": [
        "At viewport width >= `lg`, the right column on PondPage shows pond-specific About content (not Trending Ponds / Popular Tags / Hot This Week).",
        "The About sidebar uses the pond’s current data (name/title/description/images/stats/rules/tags/moderators) and updates consistently with existing join/leave mutations and query invalidation behavior.",
        "At viewport width < `lg`, the existing RightSidebar behavior (hidden on mobile) and the separate About page behavior remain functional."
      ]
    },
    {
      "id": "REQ-4",
      "text": "On the Pond About route (/pond/$name/about), for desktop breakpoints (lg and up) remove the in-page \"Feed\" and \"About\" navigation tabs and avoid presenting redundant desktop-only navigation; ensure the desktop experience aligns with the new Reddit-style layout where the About content is presented in the right sidebar on the feed route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "the about tab and the feed tab need to be removed  (just for desktop mode) additionally since they would be redundant"
        ]
      },
      "acceptanceCriteria": [
        "At viewport width >= `lg`, PondAboutPage does not render the current \"Feed\" and \"About\" tab buttons.",
        "The desktop UX does not require users to use the About route to see pond About information (it is available on the feed route via the right sidebar).",
        "At viewport width < `lg`, PondAboutPage remains accessible and usable for viewing pond About details."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend.immutablePaths must not be modified (compose existing components instead).",
    "Do not introduce additional backend canisters/services; keep the existing single-actor Motoko backend unchanged unless strictly required by this UI change."
  ],
  "nonGoals": [
    "Do not redesign the global RightSidebar widgets for other routes (Home, Tag, etc.); limit the pond-specific sidebar behavior to pond pages only.",
    "Do not change pond data models, backend APIs, or persistence as part of this layout change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}