{
  "kind": "build_request",
  "title": "Fix Lily detail page engagement row placement (likes/replies/views always below content)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Lily detail page (frontend/src/pages/LilyPage.tsx) so the engagement row (likes, replies, views) always renders in a fixed location directly below the lily’s main content block: title + description, then image (if present) and link (if present), then the engagement row. Do not change engagement row placement on feed cards or any other pages/components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "the likes replies and views in the lilypage should always be displayed below the image and description.",
          "the only page that needs it is the lily page as far as i know",
          "ok do it clocksucker"
        ]
      },
      "acceptanceCriteria": [
        "On the lily detail page, when a lily has an image, the likes/replies/views row appears below the image and below the description text (it is not shown above the image).",
        "On the lily detail page, when a lily has no image, the likes/replies/views row still appears below the description (or below the title if there is no description).",
        "The likes/replies/views row styling and functionality (like toggle, counts formatting) remain unchanged aside from its placement.",
        "No layout/placement changes are made to the engagement row in frontend/src/components/LilyCard.tsx or other pages."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must not modify any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep changes scoped to the Lily detail page layout; do not refactor backend or shared query hooks for this request."
  ],
  "nonGoals": [
    "Repositioning engagement metrics on feed cards or other post listings",
    "Changing like/reply/view logic, counts, or backend behavior"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}