{
  "kind": "build_request",
  "title": "Add local Bookmark + Saved Lilies feature",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Add a local-only Bookmark toggle for each lily (post) and persist bookmarked lily IDs in browser storage (no backend changes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Bookmark + Saved Lilies feature as described: a local-only bookmark toggle in the lily action bar (after Share)"
        ]
      },
      "acceptanceCriteria": [
        "Bookmark state persists across page reloads in the same browser profile",
        "Bookmarking/unbookmarking does not call any backend method",
        "Bookmark toggle works for lilies displayed in both the feed card view and the lily detail page",
        "If a lily is bookmarked in one place (card or detail), it appears bookmarked when viewed elsewhere after navigation or refresh"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the lily action bar UI order to include Bookmark after Share (order: Likes → Replies → Views → Share → Bookmark) wherever the action bar is rendered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "a local-only bookmark toggle in the lily action bar (after Share)"
        ]
      },
      "acceptanceCriteria": [
        "Action bar ordering is consistent across LilyCard (feed) and LilyPage (detail)",
        "Bookmark control appears immediately after the existing Share control",
        "The Bookmark control has clear English label/tooltip/aria-label (e.g., \"Bookmark\" / \"Remove bookmark\")"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create a new \"Saved Lilies\" view that lists the user’s bookmarked lilies and allows navigating to each lily detail page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "plus a Saved Lilies view for later access"
        ]
      },
      "acceptanceCriteria": [
        "There is a dedicated route/page for \"Saved Lilies\" reachable from the existing app navigation (e.g., sidebar and/or settings)",
        "The Saved Lilies page renders a list of bookmarked lilies using existing lily card/list UI patterns",
        "Removing a bookmark from the Saved Lilies page updates the list immediately",
        "Empty state is shown (in English) when there are no bookmarked lilies"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Handle missing/unavailable lilies in the Saved Lilies view gracefully (e.g., if a bookmarked lily ID no longer resolves): show an English placeholder row and allow removing that bookmark.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Saved Lilies view so users can revisit bookmarked posts"
        ]
      },
      "acceptanceCriteria": [
        "If a bookmarked lily cannot be fetched/resolved, the Saved Lilies page still loads and shows a clear English message for that entry (e.g., \"This post is no longer available\")",
        "User can remove the missing entry from bookmarks",
        "No unhandled exceptions occur when saved IDs contain invalid/stale values"
      ]
    }
  ],
  "constraints": [
    "Do not add or modify backend Motoko APIs for bookmarking; this feature must be local-only (browser storage).",
    "Do not edit any files under frontend/src/components/ui, frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (compose instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Syncing bookmarks across devices or identities",
    "Making bookmarks visible to other users",
    "Adding backend persistence, indexing, or analytics for bookmarks",
    "Changing the existing Share Lily behavior beyond placing Bookmark after Share in the action bar"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}