{
  "kind": "build_request",
  "title": "Fix authorization: treat Froggy Phrase userId as full #user for all actions (even with anonymous principal)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Backend: Implement Froggy Phrase–based authorization so any call that includes a valid stored Froggy Phrase phrase-hash userId is authorized as a full `#user` regardless of the caller principal (including anonymous `2vxsx-fae`). This must eliminate current `Debug.trap(\"Unauthorized...\")` failures for Froggy Phrase users performing write actions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "its still saying unauthorized when trying actions such as creating ponds, lilies, saving avatars, etc. why?",
          "If the call includes a Froggy Phrase hash, treat that caller as a full user, even if the principal is anonymous.",
          "Do you want all Froggy Phrase users (regardless of principal) to be treated exactly as #user for every action?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Given a request that includes a Froggy Phrase phrase-hash userId that the canister recognizes as a Froggy Phrase user (e.g., `userIdRoleOverrides[userId] == true`), backend authorization checks treat the call as `#user` even if `caller` is anonymous.",
        "No write/mutation method used by the app for Froggy Phrase flows traps with an \"Unauthorized\" error solely due to `caller` being anonymous.",
        "Principal-based authorization for non–Froggy Phrase users continues to behave as before (i.e., anonymous callers without a valid Froggy Phrase userId remain unauthorized where `#user` is required)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Backend: Add/extend phrase-hash variants for all user write actions that currently rely on `getUserRoleText(caller) == #user` (e.g., creating ponds, creating lilies/posts, creating ribbits/comments, liking/unliking, view-count increments, username/avatar/profile saves, and any other mutations triggered from the UI) so the frontend can pass the Froggy Phrase phrase-hash userId and succeed even when the actor is anonymous.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "unauthorized when trying actions such as creating ponds, lilies, saving avatars, etc.",
          "If the call includes a Froggy Phrase hash, treat that caller as a full user, even if the principal is anonymous."
        ]
      },
      "acceptanceCriteria": [
        "For each write action exposed in the UI, there exists a backend method that accepts a phrase-hash `userId : Text` and does not depend on principal-based role checks when `isFroggyPhraseUser(userId)` is true.",
        "Calling these phrase-hash variants with a recognized Froggy Phrase `userId` succeeds even if the caller principal is anonymous.",
        "Where ownership checks exist (e.g., profile/username/avatar writes), the phrase-hash variant uses `userId` as the identity boundary for Froggy Phrase users (i.e., does not require `verifyPhraseHashCaller` when `isFroggyPhraseUser(userId)` is true, consistent with existing `saveUserProfileByPhraseHash`)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Frontend: Update React Query mutations/queries to consistently use phrase-hash backend endpoints whenever `getPhraseHashUserId()` returns a non-empty userId, including (at minimum) create pond, create lily/post, create ribbit/comment, like/unlike actions, view-count increments, and avatar/profile saving, so Froggy Phrase users do not hit unauthorized errors when not using Internet Identity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "unauthorized when trying actions such as creating ponds, lilies, saving avatars, etc."
        ]
      },
      "acceptanceCriteria": [
        "When `getPhraseHashUserId()` returns a non-empty string, the app calls the corresponding `*ByPhraseHash(userId, ...)` backend methods for mutations that require `#user` authorization.",
        "A Froggy Phrase user can successfully: create a pond, create a lily/post, create a ribbit/comment, and save their avatar/profile without seeing \"Unauthorized\" errors, even when not logged in with Internet Identity.",
        "Existing behavior for Internet Identity users remains functional (i.e., if no phrase-hash userId is present, the app continues to call the principal-based methods as it does today)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit frontend files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or off-canister storage beyond the existing canister state.",
    "Introducing real-time/WebSocket features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}