{
  "kind": "build_request",
  "title": "Fix LilyCard hover inset background regression and round right sidebar hover highlights",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the LilyCard hover inset background so it reliably becomes visible on hover (not hidden by stacking context/background painting) across the app feed, including in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "its still not working. fix it."
        ]
      },
      "acceptanceCriteria": [
        "When hovering any LilyCard, an inset background highlight is clearly visible behind the card content.",
        "The hover highlight works in both light and dark mode (no near-invisible contrast).",
        "The hover highlight remains inset (does not bleed outside the card) and respects rounded corners."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the LilyCard hover inset background layer never blocks or breaks interactions (links, like button, share button, bookmark button) while the hover effect is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "its still not working. fix it."
        ]
      },
      "acceptanceCriteria": [
        "All clickable elements in LilyCard remain clickable on hover, with normal cursor/hover behavior.",
        "No element becomes unclickable due to the hover background layer overlaying it."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the right column (RightSidebar and TagHubRightSidebar) list items so the hover background highlight has visible border radius (rounded corners) consistent with the item shape.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "also can you make the onhover background for the items in the right column have border radius too."
        ]
      },
      "acceptanceCriteria": [
        "In RightSidebar sections (Trending Ponds, Popular Tags, Hot This Week), hovered items show a rounded hover background (no square corners).",
        "In TagHubRightSidebar tag items, hovered items show a rounded hover background (no square corners).",
        "The rounded hover highlight remains visually correct even with the current negative horizontal margins (-mx-2) and the sidebar container’s overflow clipping."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI primitives).",
    "Do not modify immutable hook/bootstrap files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "No backend/canister changes.",
    "No redesign of sidebar content, ordering, or data fetching logic beyond hover/visual behavior fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}