{
  "kind": "build_request",
  "title": "Fix Settings desktop tab alignment and avatar placeholder + header avatar refresh",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Adjust the desktop layout of the Settings page so the vertical Settings tabs are visually aligned to the left edge of the Settings content block (desktop mode / md+), with consistent left alignment between the tabs column and the main content column.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make sure the tabs in settings are aligned to the left of the content block in desktop mode."
        ]
      },
      "acceptanceCriteria": [
        "On md+ viewports, the Settings tabs column and the Settings content area share a consistent left alignment within the Settings page container (no unintended horizontal offset/centering of the tabs relative to the content block).",
        "The desktop Settings tabs remain vertical and usable; no regressions to mobile tabs behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Settings > Avatar tab, display a clear placeholder avatar when the user has not selected an avatar yet (i.e., user profile has no avatar and there is no local preview), instead of showing no avatar display.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also make sure the user avatar in settings has a placeholder when no avatar has been selected yet."
        ]
      },
      "acceptanceCriteria": [
        "When the logged-in user has no saved avatar and has not chosen a new file to preview, the Settings > Avatar section still renders an avatar placeholder (e.g., fallback initials or existing fallback styling).",
        "When the user selects a file, the preview continues to show as it does today, and when an avatar exists on the profile it continues to display correctly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the header avatar updates immediately after a user uploads/saves a new avatar in Settings, without requiring a full page refresh (keep React Query cache in sync so Header re-renders with the new avatar).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also make sure to update the avatar in the header when a user uploads an avatar."
        ]
      },
      "acceptanceCriteria": [
        "After successfully saving an avatar in Settings, the avatar shown in the main Header updates to the newly saved avatar without requiring navigation or hard refresh.",
        "The update works even if the user remains on the Settings page after saving (i.e., Header reflects the new avatar immediately).",
        "React Query cache keys used for the header avatar (e.g., ['userAvatar', username]) are refreshed/updated as part of the avatar-save flow so the header query is not left stale."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI sources); compose and override via page/component classes or app-level CSS instead.",
    "Keep all changes within the existing React + TypeScript + Tailwind + React Query stack."
  ],
  "nonGoals": [
    "No backend (Motoko) changes are required for these UI behavior fixes.",
    "No redesign of the Settings information architecture or adding new settings features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}