{
  "kind": "build_request",
  "title": "Disable backend authorization so Ribbit is fully anonymous with full access",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove/disable all backend authorization enforcement so anonymous callers (unauthenticated principals) have full access to all canister functionality, including creating ponds/posts/ribbits, liking, joining/leaving ponds, username management, profile read/write, view count increments, and admin-only utilities.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "its supposed to be an anonymous site. everyone should have full access/authorization",
          "yes remove them.",
          "Try it again idiot"
        ]
      },
      "acceptanceCriteria": [
        "No backend method traps or denies requests due to role/permission checks for anonymous callers.",
        "Calls that previously required #user or #admin (e.g., getCallerUserProfile, saveCallerUserProfile, incrementLilyViewCount, registerUsername, releaseUsername, canChangeUsername, mergeSimilarTags, and any other permission-guarded operations in backend/main.mo) succeed for anonymous callers when given otherwise-valid inputs.",
        "The canister no longer produces \"Unauthorized:\" trap messages during normal site usage by anonymous visitors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Preserve frontend compatibility by keeping existing access-control-related Candid methods present in the backend interface (e.g., initializeAccessControl, getCallerUserRole, assignCallerUserRole, isCallerAdmin), but ensure they do not gate or block any functionality in an anonymous mode.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "why are authorization checks showing up again? i thought you removed them long time ago? its supposed to be an anonymous site.",
          "yes remove them."
        ]
      },
      "acceptanceCriteria": [
        "Frontend calls to initializeAccessControl (triggered by frontend/src/hooks/useActor.ts) do not introduce any authorization requirements and do not cause traps for either authenticated or anonymous actors.",
        "isCallerAdmin and getCallerUserRole return values that do not prevent the UI from operating for anonymous users (e.g., avoid triggering admin/user-only blocking flows in the app)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not modify any files under frontend immutablePaths (per SYSTEM_CONTEXT).",
    "Use English for any user-facing text surfaced by the app or traps; avoid introducing new non-English strings."
  ],
  "nonGoals": [
    "Implementing a new authentication system (Internet Identity remains optional but must not be required).",
    "Adding new product features unrelated to removing/disabling authorization checks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Keep Ribbit fully anonymous: everyone has full access and no authorization checks are enforced."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}