{
  "kind": "build_request",
  "title": "Redo Ribbits mini blurred placeholder image loading without any layout/style changes (keep v214 layout)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement the “mini blurred placeholder” image-loading optimization for Ribbits avatar images (and only Ribbits), while preserving the Version 214 UI layout/styles exactly (no Tailwind class changes, no spacing/typography changes, no element repositioning). Apply this to ribbits rendered on the Lily page ribbits list and to ribbits rendered in the user profile ribbits/comments list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "can you redo the image optimization for ribbits again (the mini blurred placeholder) but this time dont change any layout styles whatsoever?",
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "Ribbit avatar images show a small blurred placeholder while the full avatar loads, then transition to the final image without flicker.",
        "No layout changes occur compared to Version 214: classNames, spacing, sizing, and positioning of existing elements in ribbit rows remain visually identical.",
        "The optimization is applied in ribbit UI components (e.g., ribbits on LilyPage and profile ribbit items), and does not alter lily main post image rendering or other unrelated images.",
        "If an avatar URL is missing/unavailable, the existing fallback behavior (initials/placeholder) continues to work and no broken image icon appears.",
        "No changes are made to the ribbit sorting toggle placement/styling on the Lily page (it must remain directly below the composer textarea as currently implemented)."
      ]
    }
  ],
  "constraints": [
    "Do not change any layout styles whatsoever (must match Version 214 layout exactly).",
    "Do not edit files under frontend/src/components/ui (read-only shadcn components); compose/wrap them instead if needed.",
    "Do not introduce any backend changes (no Motoko changes) for this request."
  ],
  "nonGoals": [
    "Repositioning or restyling any UI elements on the Lily page or elsewhere.",
    "Adding new ribbit features (attachments, new reactions UI, new sorting modes).",
    "Optimizing non-ribbit images (e.g., lily post images) beyond what is required for ribbits avatar placeholders."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}