{
  "kind": "build_request",
  "title": "Fix pond creation so only the creator joins the new pond",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the backend pond-creation logic so that when a new pond is created, the new Pond record’s membership is initialized with exactly one member: the creating principal (the shared update call `caller`). Do not use or copy any global principal list (e.g., `initializedUsers`) when populating `Pond.members`, and set `memberCount` to match the initialized membership.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-6"
        ],
        "quotes": [
          "its still not working. all users are autojoining ponds. why is this happening still? dont code yet",
          "apply the correction now"
        ]
      },
      "acceptanceCriteria": [
        "Creating a new pond results in `pond.members == [caller]` (order not important but only one element).",
        "Creating a new pond sets `pond.memberCount == 1`.",
        "No principals other than `caller` are added to the new pond’s `members` list during pond creation (including any principals present in `initializedUsers`).",
        "A second, different principal viewing the newly created pond is not considered a member until they explicitly join."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure pond creation updates membership-related user state only for the creating principal’s profile (e.g., `UserProfile.joinedPonds`) and does not append the new pond to any other user profile or any global per-user membership list for other principals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-6"
        ],
        "quotes": [
          "apply the correction now"
        ]
      },
      "acceptanceCriteria": [
        "After pond creation, only the creator’s `UserProfile.joinedPonds` (if maintained by the canister) is updated to include the new pond.",
        "No other principals’ `UserProfile.joinedPonds` values change as a result of pond creation.",
        "There is no code path in pond creation that iterates over `initializedUsers` (or any global set of users) to modify user profiles or pond membership."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any frontend files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change join/leave behavior beyond fixing the incorrect auto-membership caused by pond creation.",
    "Do not introduce new authentication mechanisms beyond the existing identity model.",
    "Do not redesign pond data models beyond what is necessary to correct initial membership and profile updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}