{
  "kind": "build_request",
  "title": "Auto-join pond creator as a member on pond creation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update the backend pond creation flow so that the pond creator is automatically added as a member of the pond at creation time, using the creator’s phrase-hash userId membership model (pond.members is [Text] of userIds). Ensure the new pond’s memberCount and the creator’s joinedPonds (in their UserProfile stored by phrase-hash) reflect this auto-join immediately after creation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "why arent pond creators automatically added as members to their own ponds? --- dont code yet",
          "ok do that"
        ]
      },
      "acceptanceCriteria": [
        "After calling the existing backend createPond(...) method, getPond(name) returns a pond where members includes the creator’s phrase-hash userId.",
        "The newly created pond’s memberCount is 1 higher than it would otherwise be, reflecting inclusion of the creator (and is consistent with the members array).",
        "After successful pond creation, fetching the creator’s profile via getUserProfileByPhraseHash(userId) shows the pond name included in joinedPonds (without requiring a separate joinPond call).",
        "If the creator is already present in the member list for any reason, the implementation does not create duplicate entries in pond.members and does not double-increment memberCount."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only generate backend/migration.mo if a stable-state upgrade is required; otherwise do not add migrations.",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT (not needed for this change).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement the broader AccessControl neutralization/authorization audit in this change (only auto-join on pond creation).",
    "Do not change pond visibility, moderator/admin assignment behavior, or pond naming/validation rules beyond what is required to auto-join the creator."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}