{
  "kind": "build_request",
  "title": "Auto-assign #user role to all Froggy Phrase identities to stop unauthorized errors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the backend so that calling `initializeFroggyPhrase(userId : Text)` always results in the caller having AccessControl role `#user` (in addition to recording `userIdLinkage`). This must work for Froggy-Phrase-based sessions so that any backend methods guarded by `AccessControl.hasPermission(..., #user)` no longer trap as unauthorized for Froggy Phrase users.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "fix it so every froggy phrase identity receives the user role"
        ]
      },
      "acceptanceCriteria": [
        "After a client calls `initializeFroggyPhrase(<sha256 phrase hash>)`, `getCallerUserRole()` returns `#user` for that same caller.",
        "A Froggy Phrase user can successfully call at least one previously failing `#user`-gated method (e.g., `incrementLilyViewCount`) without receiving a trap containing \"Unauthorized\".",
        "`initializeFroggyPhrase` remains idempotent (re-calling it does not error and does not downgrade any existing higher privilege such as admin, if applicable)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the frontend initializes Froggy Phrase access control automatically on app startup by computing the Froggy Phrase SHA-256 hash (via `getPhraseHashUserId()`), then calling the backend `initializeFroggyPhrase(userId)` once an actor is available, so Froggy Phrase users are authorized before they perform actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "fix it so every froggy phrase identity receives the user role"
        ]
      },
      "acceptanceCriteria": [
        "On first page load in a fresh browser profile, the app generates a Froggy Phrase (existing behavior) and then successfully calls `initializeFroggyPhrase(<sha256 phrase hash>)` without user interaction.",
        "After initialization completes, user actions that previously produced \"not authorized\" errors (e.g., liking, creating content, incrementing views where applicable) no longer show authorization errors for Froggy Phrase users.",
        "The initialization call is not executed in a tight loop; it runs at most once per app session (or is otherwise clearly rate-limited/idempotent on the client)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in `backend/main.mo`).",
    "Do not edit any files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Removing AccessControl authorization checks across the backend.",
    "Implementing or integrating third-party authentication providers beyond existing Internet Identity support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}