{
  "kind": "build_request",
  "title": "Simplify Tag page stats and make the global header fully opaque",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the Tag detail page to remove the “Total Activity” and “Last Activity” fields from the UI (including their labels, icons, and values).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Remove total activity and last activity from the tag view page."
        ]
      },
      "acceptanceCriteria": [
        "On /tag/:tag, the tag stats block no longer shows “Total Activity” or “Last Activity”.",
        "No empty/placeholder layout gaps remain where those fields were previously rendered.",
        "The tag page continues to load and render the tag name, lily count, sort tabs, and lily list as before."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Remove transparency effects from the global top header so it renders fully opaque (no translucent background and no backdrop blur-based translucency).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Also remove the transparency from the header"
        ]
      },
      "acceptanceCriteria": [
        "The header background is fully opaque in both light and dark mode (no alpha background classes like bg-*/xx).",
        "The header no longer uses backdrop blur styling to create translucent effects.",
        "Header remains sticky and continues to render navigation/search controls correctly across pages."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No changes to backend tag stats APIs or data models.",
    "No redesign of the Tag Hub page (/tags) beyond the requested removals.",
    "No changes to search behavior or routing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}