{
  "kind": "build_request",
  "title": "Update desktop search bar logo image and set logo badge background to accent color",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the desktop header search input, replace the decorative logo image (the badge icon shown inside the search bar on md+ screens) with the provided image URL: https://res.cloudinary.com/dbnj80s9g/image/upload/v1770762364/newribbitlogo_hcnzwy.png.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you change the logo in desktop (the one in the search bar) to this: https://res.cloudinary.com/dbnj80s9g/image/upload/v1770762364/newribbitlogo_hcnzwy.png"
        ]
      },
      "acceptanceCriteria": [
        "On desktop (md+), the icon displayed inside the search input uses the provided Cloudinary URL.",
        "The change only affects the desktop search bar badge icon and does not change the mobile centered logo image."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the background color of the desktop search bar logo badge container div to use the app accent color (matching the text logo and the Create button styling), using the theme accent token/class rather than a hard-coded color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also change the background color of the div the logo is in to the accent color (the same color as the text logo and create button)"
        ]
      },
      "acceptanceCriteria": [
        "On desktop (md+), the circular badge behind the search bar logo uses the theme accent color (e.g., Tailwind bg-accent / CSS variable --accent), not an inline hard-coded oklch value.",
        "The badge remains circular, positioned inside the search input, and remains non-interactive (pointer-events-none)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only shadcn components).",
    "Keep all changes scoped to the desktop search bar logo badge in frontend/src/components/Header.tsx."
  ],
  "nonGoals": [
    "Do not redesign the header layout or change the mobile header logo.",
    "Do not introduce backend changes or new assets generated/stored in the repo for the logo (use the provided external URL)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}