{
  "kind": "build_request",
  "title": "Fix Frog Profile Page back button placement (left of avatar, not overlapping)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Frog Profile page (`frontend/src/pages/FrogProfilePage.tsx`), add/restore a Reddit-style Back button and position it to the left of the profile (pond) avatar within the profile header row so it never overlaps the avatar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ok i reverted. now try it again you dumbfuck"
        ]
      },
      "acceptanceCriteria": [
        "The Frog Profile page shows a Back button in the profile header area.",
        "The Back button is horizontally placed to the left of the avatar (same row) with consistent spacing (i.e., not stacked on top of the avatar).",
        "At common viewport sizes (mobile and desktop), the Back button does not overlap the avatar, username, or counts; the layout remains stable and readable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement Back button navigation behavior on the Frog Profile page to go to the previous page using browser history when possible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ok i reverted. now try it again you dumbfuck"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Back navigates to the previous page when `window.history.length > 1`.",
        "If there is no meaningful browser history entry, the Back button falls back to navigating to the home route (`/`).",
        "The Back button is keyboard accessible and has an accessible label (e.g., visible “Back” text and/or sr-only label)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Match the Frog Profile Back button visual styling to the existing Lily page Back button (icon + “Back” label, muted foreground, hover state, rounded hit area) while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ok i reverted. now try it again you dumbfuck"
        ]
      },
      "acceptanceCriteria": [
        "The Frog Profile Back button uses an arrow-left icon and the label text “Back”.",
        "Default styling is muted and changes on hover similarly to the Lily page Back button.",
        "No new non-English user-facing strings are introduced as part of this change."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep changes scoped to fixing the Frog Profile page back button placement and behavior."
  ],
  "nonGoals": [
    "Do not change the Lily page back button behavior or styling.",
    "Do not introduce new authentication methods or any third-party integrations.",
    "Do not redesign the entire Frog Profile page beyond what is necessary to correctly place the Back button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}