{
  "kind": "build_request",
  "title": "Fix back button placement on Lily page header",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Lily detail page (`frontend/src/pages/LilyPage.tsx`) so the existing Reddit-style Back button is positioned immediately to the left of the pond avatar within the lily header row (same row that currently starts with the pond avatar and metadata), instead of being rendered as a separate block above the content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "On `/lily/:id`, the Back control (ArrowLeft icon + “Back” label) appears directly to the left of the pond avatar in the header area.",
        "The Back control remains keyboard-accessible and clickable, and continues to call the existing `handleBackClick` behavior (history back when possible, otherwise navigate to `/pond/$name`).",
        "There is no duplicate Back button rendered above the lily content after the change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Back button change is scoped to the Lily detail page only, and that no Back button UI is added to or rendered on the frog profile page (`frontend/src/pages/FrogProfilePage.tsx`) as part of this fix.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "On `/f/:username`, there is no Back button UI introduced by this change.",
        "The only page affected by the Back button placement/layout adjustment is `frontend/src/pages/LilyPage.tsx`."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify the Internet Identity or actor hooks located in immutable paths."
  ],
  "nonGoals": [
    "Do not change backend logic or data models.",
    "Do not change the Back button navigation logic (history/back vs pond fallback), only its placement/layout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}