{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Apply pill-shaped (rounded-full) border radius to specified inputs and buttons",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the Header search input pill-shaped by applying a fully-rounded (9999px equivalent) border radius across responsive layouts.",
      "acceptanceCriteria": [
        "On all pages where the Header is shown, the search input renders with a pill-shaped/fully-rounded border radius.",
        "The updated border radius applies consistently in both light and dark themes.",
        "The search input focus/hover styles still render correctly (no clipping or visual artifacts at the corners)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update both desktop and mobile Header <Input type=\"search\" /> usages to include Tailwind fully-rounded styling (e.g., add `rounded-full` to the existing className alongside `pl-10`) so the search field appears pill-shaped without changing shared UI components under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make all Header buttons pill-shaped by applying a fully-rounded (9999px equivalent) border radius across desktop and mobile header layouts.",
      "acceptanceCriteria": [
        "All clickable button-style controls in `frontend/src/components/Header.tsx` render with a fully-rounded/pill border radius.",
        "No Header button regresses in spacing/alignment (icons and text remain centered).",
        "Mobile header and desktop header both reflect the fully-rounded styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add `rounded-full` to the className for every Button instance rendered by Header (including icon buttons, dropdown trigger, nav buttons, and the mobile search dialog submit button) to ensure consistent pill-shaped styling while preserving existing variants/sizes and without editing any files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the 'Start a Pond' button on the All Ponds page pill-shaped by applying a fully-rounded border radius.",
      "acceptanceCriteria": [
        "On `frontend/src/pages/AllPondsPage.tsx`, the 'Start a Pond' button displays as fully-rounded/pill-shaped.",
        "The button remains visually consistent with other primary actions (no loss of padding, font size, or hover/focus behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AllPondsPage.tsx",
          "operation": "modify",
          "description": "Update the 'Start a Pond' <Button asChild> on AllPondsPage to include `rounded-full` in its className while keeping existing hover/focus behavior and without modifying shared UI components under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the 'Save Changes', 'Save Froggy Phrase', and 'Choose Avatar' buttons on the User Settings page pill-shaped by applying a fully-rounded border radius.",
      "acceptanceCriteria": [
        "On `frontend/src/pages/UserSettingsPage.tsx`, each of the three specified buttons renders with a fully-rounded/pill-shaped border radius.",
        "Button disabled/loading states (if present) still look correct with the new border radius.",
        "No other settings controls unintentionally change shape unless they are one of the specified buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UserSettingsPage.tsx",
          "operation": "modify",
          "description": "Add `rounded-full` only to the specified buttons on UserSettingsPage: the 'Save Changes' Button, the 'Save Froggy Phrase' Button (when creating a phrase), and the 'Choose Avatar' Button (the outline Button rendered asChild within the Label), ensuring disabled/loading visuals remain intact and avoiding changes to other buttons not listed."
        }
      ]
    }
  ]
}