{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "LilyPage header metadata layout + pond avatar + lily/ribbits divider",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rework LilyPage header metadata so avatar is left and the text to the right is two lines (pond name • timestamp, then username).",
      "acceptanceCriteria": [
        "On the Lily page, the metadata area to the right of the avatar renders two lines.",
        "Line 1 displays the pond name in bold, then a \"•\" separator, then the relative timestamp.",
        "Line 2 displays the lily author's username in non-bold text.",
        "The existing pond link behavior (navigating to /pond/$name) is preserved for the pond name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LilyPage.tsx",
          "operation": "modify",
          "description": "Update the header section to a horizontal layout: avatar on the left, and a right-side text block with two lines. Keep the pond name as a Link to /pond/$name, render it in bold, followed by a \"•\" separator and the existing relative timestamp on line 1; render the username (non-bold) on line 2."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show the pond profile image in the LilyPage avatar slot (with 🐸 fallback when missing).",
      "acceptanceCriteria": [
        "When a pond profile image exists, the Lily page avatar renders that image.",
        "When no pond profile image exists (or pond data is unavailable), the Lily page avatar falls back to the existing fallback UI.",
        "No user avatar is used in the Lily page header avatar slot."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LilyPage.tsx",
          "operation": "modify",
          "description": "Fetch pond data for the lily's pond (e.g., via existing query hooks) and render the pond profile image in the header Avatar using the blob-storage ExternalBlob capability (use getDirectURL() to obtain an image URL). Keep 🐸 as the AvatarFallback when pond/profileImage is unavailable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a horizontal border divider between the lily content/engagement section and the Ribbits section on LilyPage.",
      "acceptanceCriteria": [
        "There is a clear horizontal border between the end of the lily content/engagement section and the start of the Ribbits section.",
        "The border uses existing Tailwind theme tokens/classes (e.g., border-border) and looks consistent in light/dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LilyPage.tsx",
          "operation": "modify",
          "description": "Insert a section divider element between the lily block (ending after the engagement row) and the Ribbits block, using Tailwind border tokens/classes such as border-t and border-border to ensure consistent theming in light/dark mode."
        }
      ]
    }
  ]
}