{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ribbits avatar mini blurred placeholder loading (no v214 layout/style changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add mini blurred placeholder loading + smooth transition for Ribbit avatar images only, preserving Version 214 layout/styles exactly on Lily ribbits list and profile comments list.",
      "acceptanceCriteria": [
        "Ribbit avatar images show a small blurred placeholder while the full avatar loads, then transition to the final image without flicker.",
        "No layout changes occur compared to Version 214: classNames, spacing, sizing, and positioning of existing elements in ribbit rows remain visually identical.",
        "The optimization is applied in ribbit UI components (e.g., ribbits on LilyPage and profile ribbit items), and does not alter lily main post image rendering or other unrelated images.",
        "If an avatar URL is missing/unavailable, the existing fallback behavior (initials/placeholder) continues to work and no broken image icon appears.",
        "No changes are made to the ribbit sorting toggle placement/styling on the Lily page (it must remain directly below the composer textarea as currently implemented)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RibbitMiniBlurAvatarImage.tsx",
          "operation": "create",
          "description": "Create a Ribbits-only avatar image helper that displays an inline mini blurred placeholder data URL immediately, preloads the real avatar URL, and then swaps to the final image with an opacity/blur transition (using inline styles to avoid any Tailwind/className/layout changes). Must support both AvatarImage-based rendering (for RibbitItem) and plain <img> rendering (for ProfileRibbitItem) without changing sizing/positioning."
        },
        {
          "path": "frontend/src/components/RibbitItem.tsx",
          "operation": "modify",
          "description": "Update RibbitItem avatar rendering to use the new RibbitMiniBlurAvatarImage helper for ribbit usernames when an avatar URL is available, while keeping all existing className strings and element structure/spacing unchanged. Preserve current fallback initials behavior when avatar is missing/unavailable and ensure no broken image icon appears."
        },
        {
          "path": "frontend/src/components/ProfileRibbitItem.tsx",
          "operation": "modify",
          "description": "Update ProfileRibbitItem avatar rendering in the profile comments list to use the new RibbitMiniBlurAvatarImage helper (replacing only the internal avatar <img> behavior) while keeping the existing Avatar wrapper and all current className strings/styles unchanged. Preserve current AvatarFallback initials when avatar URL is missing/unavailable."
        }
      ]
    }
  ]
}