{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix LilyCard inset hover background layering and theme visibility",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make LilyCard inset hover background render above the card background so it is visible on hover.",
      "acceptanceCriteria": [
        "Hovering a LilyCard shows a clearly visible inset (inset-2) rounded hover background.",
        "The hover background remains visible regardless of the LilyCard’s base background color (e.g., bg-card).",
        "The hover transition remains smooth (opacity transition) and does not flicker."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LilyCard.tsx",
          "operation": "modify",
          "description": "Fix the hover inset layer stacking so it is not behind the card’s own background (remove the negative z-index usage and establish a clear stacking context where the inset sits above the card background but below the content). Ensure the inset is still inset-2 and rounded, and keep the existing opacity transition smooth."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure LilyCard hover background layer never blocks pointer interactions with card actions and links.",
      "acceptanceCriteria": [
        "All LilyCard interactive elements remain clickable and behave the same with and without hover.",
        "The hover background layer does not capture pointer events.",
        "No new layout shift is introduced when hovering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LilyCard.tsx",
          "operation": "modify",
          "description": "Keep the inset hover background layer non-interactive (pointer-events-none) and ensure interactive content (links/buttons like like/share/bookmark) remains above it via appropriate z-index on content wrappers. Confirm the hover effect is purely visual (no DOM/layout changes that could cause hover layout shift)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Use theme-aware inset hover background color so it remains visible in light and dark mode.",
      "acceptanceCriteria": [
        "In light theme, the inset hover background appears as a subtle tint distinct from the card background.",
        "In dark theme, the inset hover background appears as a subtle tint distinct from the card background.",
        "Theme switching does not break hover visibility."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LilyCard.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded hover layer background color (currently a light-only gray) with a theme-compatible Tailwind color tied to the design tokens (e.g., muted/foreground-based tint) so it remains distinct from bg-card in both light and dark themes."
        }
      ]
    }
  ]
}