{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use phrase-hash variants for Froggy Phrase users across all write actions",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Route all user-authorized mutations/queries through phrase-hash backend methods when a Froggy Phrase userId is available, preserving existing Internet Identity behavior otherwise.",
      "acceptanceCriteria": [
        "When `getPhraseHashUserId()` returns a non-empty string, the app calls the corresponding `*ByPhraseHash(userId, ...)` backend methods for mutations that require `#user` authorization.",
        "A Froggy Phrase user can successfully: create a pond, create a lily/post, create a ribbit/comment, and save their avatar/profile without seeing \"Unauthorized\" errors, even when not logged in with Internet Identity.",
        "Existing behavior for Internet Identity users remains functional (i.e., if no phrase-hash userId is present, the app continues to call the principal-based methods as it does today)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update React Query hooks to consistently prefer phrase-hash methods when `getPhraseHashUserId()` is non-empty: create pond (switch to the phrase-hash variant once available), create lily/post (use `createPostByPhraseHash`), create ribbit/comment (use `createRibbitByPhraseHash`), like/unlike posts (use `likePostByPhraseHash`/`unlikePostByPhraseHash`), like/unlike ribbits (use `likeRibbitByPhraseHash`/`unlikeRibbitByPhraseHash`), and view-count increments (use `incrementLilyViewCountByPhraseHash`). Also update read queries tied to identity where needed (e.g., `hasUserLikedPost`/`hasUserLikedRibbit`) to use the phrase-hash variants when applicable."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the generated backend type definitions to include any newly-added phrase-hash functions needed by the UI (notably a phrase-hash variant for pond creation and any other UI-triggered mutations that were previously principal-only), so `useQueries.ts` can call them type-safely."
        }
      ]
    }
  ]
}