{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pond desktop layout: move About into right sidebar and remove redundant tabs",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Hide the in-page Feed/About tab buttons on the pond feed route at desktop breakpoints while preserving mobile tab navigation.",
      "acceptanceCriteria": [
        "At viewport width >= Tailwind `lg`, PondPage no longer renders the \"Feed\" and \"About\" tab buttons currently shown above the feed (PondPage.tsx navigation section).",
        "At viewport width < `lg`, the current tab UI remains available (or an equivalent mobile navigation remains) so users can still reach the About view from mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PondPage.tsx",
          "operation": "modify",
          "description": "Update the PondPage navigation section so the Feed/About tab buttons are only rendered for mobile/tablet (e.g., use Tailwind responsive visibility classes) and are not shown at `lg` and up; keep the feed list as the center column content."
        },
        {
          "path": "frontend/src/pages/PondPage.tsx",
          "operation": "modify",
          "description": "Adjust the current inline Join Pond button placement/visibility so mobile users still have a clear join affordance while desktop can rely on the new About sidebar’s join/leave actions (e.g., hide the inline join button at `lg` if it becomes redundant)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace generic RightSidebar widgets on pond pages (desktop) with a pond-specific About sidebar that mirrors the About route content and uses existing pond membership/query behaviors.",
      "acceptanceCriteria": [
        "At viewport width >= `lg`, the right column on PondPage shows pond-specific About content (not Trending Ponds / Popular Tags / Hot This Week).",
        "The About sidebar uses the pond’s current data (name/title/description/images/stats/rules/tags/moderators) and updates consistently with existing join/leave mutations and query invalidation behavior.",
        "At viewport width < `lg`, the existing RightSidebar behavior (hidden on mobile) and the separate About page behavior remain functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PondAboutSidebar.tsx",
          "operation": "create",
          "description": "Create a pond-specific About sidebar component that renders the pond About information currently shown on PondAboutPage (About This Pond header, created date, member count, visibility, rules, tags, moderators) and includes join/leave actions using existing React Query hooks; if pond images are shown, render them via ExternalBlob direct URLs (Use the blob-storage component capability: ExternalBlob.getDirectURL() for efficient image display; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/PondPage.tsx",
          "operation": "modify",
          "description": "Wire the new PondAboutSidebar into the PondPage right column for `lg` and up, replacing the current RightSidebar discovery widgets on this route only; ensure the right column remains hidden on mobile per existing behavior."
        },
        {
          "path": "frontend/src/pages/PondAboutPage.tsx",
          "operation": "modify",
          "description": "Refactor any duplicated About rendering logic (as needed) so PondAboutPage and the new PondAboutSidebar stay consistent (e.g., share small formatting helpers/sections where appropriate) while keeping PondAboutPage fully usable on mobile."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove redundant Feed/About tab buttons from the pond About route on desktop and align the desktop experience with the Reddit-style layout (About info available from the feed route sidebar).",
      "acceptanceCriteria": [
        "At viewport width >= `lg`, PondAboutPage does not render the current \"Feed\" and \"About\" tab buttons.",
        "The desktop UX does not require users to use the About route to see pond About information (it is available on the feed route via the right sidebar).",
        "At viewport width < `lg`, PondAboutPage remains accessible and usable for viewing pond About details."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PondAboutPage.tsx",
          "operation": "modify",
          "description": "Update the PondAboutPage navigation tab UI so the Feed/About tab buttons are not rendered at `lg` and up (keep mobile/tablet navigation intact)."
        },
        {
          "path": "frontend/src/pages/PondAboutPage.tsx",
          "operation": "modify",
          "description": "Align desktop behavior with the new layout by adding a desktop-only redirect or prominent call-to-action to return to the feed route (where the About information is now available in the right sidebar), while ensuring the About content remains accessible on < `lg`."
        }
      ]
    }
  ]
}