{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Inset LilyCard hover background to reveal rounded feed container borders",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust LilyCard hover styling to render an inset light-gray hover background with rounded corners (no layout shift) across lily lists (Home, Pond, etc.).",
      "acceptanceCriteria": [
        "Hovering a lily card shows a light gray background that is inset from the card edges by a small, consistent spacing, rather than flush to the edges.",
        "The inset hover background has rounded corners that visually complement the feed container’s rounded corners.",
        "No layout shift occurs when hovering (card size/spacing does not change).",
        "The change is visible and consistent on HomePage and PondPage lily lists (and any other page that uses the same LilyCard component).",
        "On touch devices, behavior remains unchanged (no stuck hover state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LilyCard.tsx",
          "operation": "modify",
          "description": "Replace the current flush hover background on the LilyCard root with an inset hover background layer (e.g., a pseudo-element or absolutely-positioned child) using a small inset and matching rounded corners; keep the card's layout/box model unchanged to avoid hover layout shift and ensure the effect applies everywhere LilyCard is used (HomePage, PondPage, etc.)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the inset hover layer does not block or shrink LilyCard click targets and preserves smooth hover/focus behavior.",
      "acceptanceCriteria": [
        "All existing LilyCard click targets (title link, pond link, username link, like/share/bookmark actions) work as before.",
        "Hover styling does not block clicks or change focus/keyboard navigation behavior.",
        "The hover styling still animates smoothly (keeps a subtle transition)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LilyCard.tsx",
          "operation": "modify",
          "description": "Ensure the inset hover background layer cannot intercept pointer events (e.g., pointer-events none) and is stacked beneath interactive content (z-index layering); preserve existing event handling (stopPropagation/preventDefault) and keep a subtle transition for hover/focus-visible states without altering click target sizing."
        }
      ]
    }
  ]
}