{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove frontend role gating so anonymous visitors can create ponds, create lilies, and save avatars",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove/relax any UI-side “user role” gating so anonymous visitors can access pond creation, lily creation, and avatar saving flows.",
      "acceptanceCriteria": [
        "While not logged in, the Create Pond and Create Lily entry points remain available and their forms submit without the UI blocking due to role/permission assumptions.",
        "While not logged in, the User Settings avatar upload flow is available and does not show a role-based restriction message before attempting the save.",
        "Any error messaging shown for these actions reflects real validation issues (e.g., pond name validation) rather than role/permission restrictions for anonymous users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust any role/profile-related React Query hooks to be anonymous-safe (no UI-side role gating; avoid surfacing “Only users can …” style authorization messages as a precondition). Where appropriate, catch authorization-style failures and return safe UI values (e.g., null/empty) so anonymous users can proceed and pages render. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/UserSettingsPage.tsx",
          "operation": "modify",
          "description": "Ensure avatar selection and saving are always available for anonymous visitors: remove any role-based restriction messaging/disablement, and rely on actual validation (file present/type/size) plus mutation outcomes. Keep avatar upload using the blob-storage ExternalBlob flow (getDirectURL for display; fromBytes/withUploadProgress for upload) and ensure errors shown are not role/permission-based. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CreatePondPage.tsx",
          "operation": "modify",
          "description": "Audit and remove any UI-side checks that prevent anonymous users from submitting pond creation (e.g., role checks, login-required guards). If any authorization-related errors are currently surfaced, update messaging to be generic and validation-focused rather than role/permission-focused. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CreateLilyPage.tsx",
          "operation": "modify",
          "description": "Audit and remove any UI-side checks that prevent anonymous users from submitting lily creation (e.g., role checks, login-required guards). Ensure any displayed errors are validation-related (required fields, tag validation) rather than role/permission assumptions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Confirm Create entry points (Start a Pond, Create Lily) remain visible/usable for anonymous visitors and are not conditionally hidden/disabled due to user role checks; remove any such gating if present. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}