{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 20,
  "summary": "ribbit is an anonymous, Reddit-style discussion platform built on the Internet Computer (ICP). Communities are “ponds”, posts are “lilies” (text/image/link with optional tags), and threaded comments are “ribbits”. The React + TypeScript frontend uses TanStack Router for navigation and React Query for caching and mutations against a Motoko canister actor (anonymous by default, optionally Internet Identity-authenticated). The backend canister manages ponds and membership, lily and ribbit creation and retrieval (including threaded views), likes on posts and ribbits, tag normalization + canonical redirects (with admin tag merging), principal-based user profiles, a username registry with cooldown enforcement, username-based avatar storage, and recent-activity feeds. Media is stored and transported via ExternalBlob, and the canister includes a Caffeine blob-storage mixin with maintenance endpoints.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "SPA routing and responsive application shell",
      "synonyms": [
        "TanStack Router",
        "Layout",
        "mobile left drawer",
        "three-column layout"
      ],
      "description": "Defines SPA routes for Home, All Ponds, Pond feed, Pond About, Lily detail, Create Lily, Start Pond, Tag pages, Settings, and About. Provides a shared Layout with Header/Footer and a mobile off-canvas left sidebar drawer that locks body scroll and closes on navigation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Light/dark theming with OKLCH design tokens",
      "synonyms": [
        "next-themes",
        "Tailwind semantic tokens",
        "CSS variables theme"
      ],
      "description": "Implements light/dark palettes via OKLCH CSS variables exposed as semantic Tailwind tokens (including dedicated sidebar tokens). Theme switching is handled via next-themes class-based dark mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Header navigation with search and create actions",
      "synonyms": [
        "Header",
        "desktop search",
        "mobile search dialog",
        "create dropdown"
      ],
      "description": "Sticky header includes brand/logo, desktop search bar, mobile search dialog, create actions (Start Pond/Create Lily) including a mobile dropdown, and a settings entry with username-based avatar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Left sidebar navigation and recent activity list",
      "synonyms": [
        "LeftSidebar",
        "Recent Activity"
      ],
      "description": "Left sidebar provides navigation links (Home/All Ponds/Create Lily/Settings) with active-route styling and a Recent Activity section showing relative timestamps and links into lily pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Right sidebar discovery widgets",
      "synonyms": [
        "RightSidebar",
        "Trending Ponds",
        "Popular Tags",
        "Hot This Week"
      ],
      "description": "Sticky right sidebar computes and renders trending ponds by memberCount, popular tags by counting tags on fetched lilies, and hot posts for the last week sorted by viewCount, with skeleton loading states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient",
        "DelegationIdentity"
      ],
      "description": "Provides a React context for Internet Identity login/logout and persisted identity loading using @dfinity/auth-client, exposing explicit status flags for UI integration.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "ICP actor lifecycle management integrated with React Query",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "actor-per-identity"
      ],
      "description": "Creates a backend canister actor per identity (anonymous vs authenticated). When authenticated, actor initialization calls initializeAccessControl(). Actor changes trigger broad React Query invalidation/refetch.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Centralized React Query API layer for backend operations",
      "synonyms": [
        "useQueries",
        "query keys",
        "mutations + invalidation"
      ],
      "description": "Implements React Query hooks/mutations for ponds, membership, lilies, ribbits, likes, tags, profiles, usernames, avatars, and recent activities with consistent query keys and cache invalidation patterns.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Pond discovery and search",
      "synonyms": [
        "listPonds",
        "getPond",
        "searchPonds",
        "AllPondsPage"
      ],
      "description": "Supports listing all ponds, fetching a pond by name, and searching ponds by term. The All Ponds page displays a responsive grid of ponds with images, descriptions, member counts, and joined badges.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Pond creation with image uploads and Froggy Phrase validation",
      "synonyms": [
        "createPond",
        "Start a Pond",
        "profile/banner upload"
      ],
      "description": "Allows users to create a pond with name/title/description, required profile + banner images uploaded as ExternalBlob, and a Froggy Phrase validated client-side and by the canister (>= 5 words).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Pond membership management (join/leave) and joined-ponds UI",
      "synonyms": [
        "joinPond",
        "leavePond",
        "getJoinedPonds",
        "My Ponds"
      ],
      "description": "Backend supports joining/leaving ponds and stores joined ponds in the caller’s UserProfile. Frontend shows a Join button on pond feeds and a Settings “My Ponds” tab with pond listing and leave confirmations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Pond feed page with responsive banner header and pond-scoped lily list",
      "synonyms": [
        "PondPage",
        "pond feed",
        "mobile banner height"
      ],
      "description": "Renders a full-width pond banner/profile header with title/description overlay and shows lilies filtered to the pond and sorted by newest. Banner height is responsive (shorter on mobile, unchanged on md+).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Pond About page (metadata, rules, moderators, tags)",
      "synonyms": [
        "getPondAboutInfo",
        "PondAboutPage"
      ],
      "description": "Displays pond stats (created date, members, visibility), rules, associated tags, and moderators (with avatar lookup by username). Includes leave-pond action for members and feed/about tab navigation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Lily (post) listing and search",
      "synonyms": [
        "listPosts",
        "getPost",
        "searchPosts",
        "Home feed"
      ],
      "description": "Backend supports listing all posts, fetching by id, and searching by term. Frontend Home page renders a feed with Trending/New tabs (currently recency-based) and supports query-param search (q).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Create Lily form with content modes, membership gating, and tag suggestions",
      "synonyms": [
        "CreateLilyPage",
        "createPost",
        "getTagSuggestions"
      ],
      "description": "Create Lily supports text/image/link modes, pond selection, membership gating, optional tag input with debounced server suggestions, and optional image upload as ExternalBlob.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Lily feed card UI with media handling and engagement metrics",
      "synonyms": [
        "LilyCard",
        "blurred backdrop",
        "like toggle"
      ],
      "description": "Renders lilies as feed cards with pond/user metadata, optional tag link, optional image with aspect-aware blurred backdrop, optional external link hostname, and engagement metrics (likes, ribbit count, views) including in-card like toggling. Can show either pond avatar or user avatar depending on context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Lily detail page with image lightbox and threaded ribbits",
      "synonyms": [
        "LilyPage",
        "post detail",
        "lightbox modal"
      ],
      "description": "Displays a lily’s full content (title, tag link, content, image with click-to-open lightbox, and optional external link), engagement metrics (likes/replies/views), a ribbit composer, and a threaded ribbit list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Threaded ribbits (comments) with replies UI",
      "synonyms": [
        "createRibbit",
        "getThreadedRibbits",
        "RibbitItem"
      ],
      "description": "Backend supports creating ribbits with optional parentId and querying ribbits in threaded order. Frontend renders nested ribbits with indentation, reply forms, timestamps, and username-based avatars.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Likes for lilies and ribbits",
      "synonyms": [
        "likePost/unlikePost",
        "likeRibbit/unlikeRibbit",
        "get*LikeCount",
        "hasUserLiked*"
      ],
      "description": "Backend tracks per-target likes keyed by (targetId, principal) and exposes like counts and per-caller liked status. Frontend provides toggles and invalidates relevant caches after mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Tagging system with canonical redirects and tag feeds",
      "synonyms": [
        "normalizeTag",
        "getLiliesByTag",
        "getCanonicalTagForTag",
        "TagPage",
        "getTagRedirects"
      ],
      "description": "Backend normalizes tags, tracks usage counts, supports suggestions, resolves canonical tags via redirects, and returns lilies by tag with sorting (newest/most_viewed/most_replied). Frontend Tag page redirects to canonical tags and renders sorted tagged feeds.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Admin tag merging and redirect inspection UI",
      "synonyms": [
        "mergeSimilarTags",
        "isCallerAdmin",
        "Admin tab"
      ],
      "description": "Backend provides an admin-only tag merge operation using similarity heuristics and stores old→canonical redirects. Frontend Settings shows an Admin tab (only for admins) to trigger merges and view active redirects.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Principal-based user profiles (save/load) and profile lookup",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "getUserProfile"
      ],
      "description": "Stores a UserProfile per principal (including joined ponds). Frontend can load/save the caller profile and fetch other profiles (e.g., for displaying moderators).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Username registry with availability checks and 24-hour cooldown",
      "synonyms": [
        "isUsernameAvailable",
        "registerUsername",
        "releaseUsername",
        "canChangeUsername",
        "recordUsernameChange"
      ],
      "description": "Backend supports username registration, ownership, release, and cooldown checks. Frontend Settings provides debounced availability checks, frog/toad/tadpole substring validation, cooldown-aware saving, and profile-name synchronization after changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Username-based avatar upload and retrieval with progress",
      "synonyms": [
        "saveAvatarByUsername",
        "getUserAvatarByUsername",
        "Settings avatar tab"
      ],
      "description": "Backend stores avatars by username and exposes public retrieval. Frontend supports avatar selection, preview, uploading as ExternalBlob with progress callback, and rendering avatars in header, lily cards, and ribbits when available.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Local anonymous identity and Froggy Phrase backup/restore (client-side)",
      "synonyms": [
        "localStorage identity",
        "Froggy Phrase",
        "restore settings"
      ],
      "description": "Frontend generates/stores an anonymous username and user id in localStorage. Users can create a Froggy Phrase (>=5 words) that backs up/restores local settings across devices, with UI to show/copy/clear and restore.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Recent activity endpoints and sidebar consumption",
      "synonyms": [
        "getAllRecentActivities",
        "getRecentPosts",
        "getRecentRibbits",
        "getRecentlyLikedPosts"
      ],
      "description": "Backend exposes recent activity query endpoints and a combined recent activity list. Frontend consumes getAllRecentActivities() to render a recent activity list in the left sidebar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Role-based access control with upgrade restoration (backend)",
      "synonyms": [
        "AccessControl",
        "initializeAccessControl",
        "admin/user/guest roles",
        "postupgrade restore"
      ],
      "description": "Implements role-based access control (admin/user/guest), initialization, admin-only role assignment, and postupgrade restoration using persisted initialized principal tracking; frontend calls initializeAccessControl() on authenticated actor creation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Blob storage mixin with maintenance endpoints (backend)",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Backend composes a Caffeine blob-storage mixin supporting gateway principal updates, authorized dead-blob listing/pruning (with GC trigger), and a cashier refill endpoint for cycles top-ups.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Compact number formatting utility",
      "synonyms": [
        "formatNumber",
        "k/M/B formatting"
      ],
      "description": "Utility formats large counts into compact k/M/B notation for display in the UI (members, likes, replies, views).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Reproducible build/deploy template scaffolding",
      "synonyms": [
        "build-template",
        "Dockerfile",
        "deploy.sh",
        "icp.yaml",
        "image resize/prune scripts",
        "workspace template"
      ],
      "description": "Adds a reusable build-template (frontend+backend canister YAMLs, Dockerfile, deploy script, workspace/package scaffolding, lint rules, and image resize/prune utilities) to support consistent local/CI builds and deployments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Share Lily (copy link + native share sheet)",
      "synonyms": [
        "Share button",
        "copy link",
        "navigator.share",
        "shareLily"
      ],
      "description": "Adds a Share action for lilies that copies the canonical lily URL to the clipboard by default and uses the native share sheet when available (e.g., on mobile via navigator.share). Integrated into the lily action bar per the decided button order.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-a-local-only-bookmark-toggle-for-each-lily-post-and-persist-bookmarked-lily-ids-in-browser-storage-no-backend-changes",
      "title": "Add a local-only Bookmark toggle for each lily (post) and persist bookmarked lily IDs in browser storage (no backend changes).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-lily-action-bar-ui-order-to-include-bookmark-after-share-order-likes-replies-views-share-bookmark-wherever-the-action-bar-is-rendered",
      "title": "Update the lily action bar UI order to include Bookmark after Share (order: Likes → Replies → Views → Share → Bookmark) wherever the action bar is rendered.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-new-saved-lilies-view-that-lists-the-user-s-bookmarked-lilies-and-allows-navigating-to-each-lily-detail-page",
      "title": "Create a new \"Saved Lilies\" view that lists the user’s bookmarked lilies and allows navigating to each lily detail page.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-handle-missing-unavailable-lilies-in-the-saved-lilies-view-gracefully-e-g-if-a-bookmarked-lily-id-no-longer-resolves-show-an-english-placeholder-row-and-allow-removing-that-bookmark",
      "title": "Handle missing/unavailable lilies in the Saved Lilies view gracefully (e.g., if a bookmarked lily ID no longer resolves): show an English placeholder row and allow removing that bookmark.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-2",
      "summary": "Add a bookmark/save feature for lilies so users can save and later view a list of bookmarked lilies.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement Bookmark Lily as a local-only save (browser storage) with a Saved Lilies view (e.g., in Settings/sidebar) and a bookmark toggle in the lily action bar (order: Likes → Replies → Views → Share → Bookmark).",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack Router with a shared Layout (Header/Footer) and responsive sidebars (desktop 3-column layout; mobile off-canvas left drawer).",
    "All backend/canister interactions are centralized in a single React Query hook module (queries + mutations) keyed by stable query keys and explicit cache invalidation on writes.",
    "Actor lifecycle is identity-aware: useActor creates an anonymous actor when unauthenticated; when authenticated, it creates an identity-bound actor and calls initializeAccessControl() before use. Actor changes trigger broad query invalidation/refetch.",
    "Internet Identity authentication is encapsulated in a React context/provider using @dfinity/auth-client with persisted identity loading and explicit login status flags.",
    "Styling uses TailwindCSS with shadcn/ui components and OKLCH CSS-variable design tokens; theme switching is handled via next-themes class-based dark mode.",
    "Backend is a single Motoko canister using OrderedMap for persistent collections, with role/access control and postupgrade restoration of roles via persisted initialized principal tracking.",
    "Images/avatars are handled as ExternalBlob values; the frontend converts File -> Uint8Array -> ExternalBlob, and uses getDirectURL() for rendering (avatar upload supports progress callbacks).",
    "Backend includes a blob-storage mixin exposing authorized dead-blob pruning, gateway principal refresh, and cashier cycles refill endpoints.",
    "Project now includes a build-template scaffold (Dockerfile, deploy.sh, icp.yaml, workspace/package configs, canister.yaml stubs, and helper scripts like prune-unused-images/resize-images) to standardize builds and deployments across environments.",
    "Planned: add 'Bookmark Lily' as local-only (browser storage) to preserve anonymity; optionally restorable via Froggy Phrase; include a 'Saved Lilies' view (e.g., Settings/sidebar) and an action-bar toggle icon.",
    "Decision: Lily action bar button order should be: Likes → Replies → Views → Share → Bookmark (Share/Bookmark to follow views, not placed earlier).",
    "Implemented 'Share Lily' via a shared frontend utility (shareLily) that prefers navigator.share on supported devices and falls back to clipboard copy; wired into lily UI action surfaces following the agreed action-bar order."
  ],
  "known_issues": [
    "Post viewCount is read and displayed (and used for “Hot This Week” and tag sorting), but there is no backend update path to increment viewCount; view-based widgets will likely remain at 0.",
    "Recent Activity UI assumes Activity.targetId is always a lily id (it fetches a lily for each activity). Backend also records #viewRibbit activities whose targetId is a ribbit id, so those entries won’t render.",
    "Activity logging is inconsistent/incomplete: createPost does not log #post activity; createRibbit records a #viewRibbit activity rather than a #ribbit activity; likePost logs like activity with empty username/pond fields.",
    "mergeSimilarTags() uses Iter.range(0, tagCount - 1); when tagCount is 0 this can underflow/trap in Motoko (Nat subtraction).",
    "AccessControl.getUserRole() traps for non-anonymous principals that have not been initialized; the frontend mitigates this for authenticated users by calling initializeAccessControl(), but direct calls/missed initialization can still trap.",
    "Anonymous users share the same anonymous principal on-chain, so likes, membership, and profiles can collide between anonymous users; local usernames are not enforced at the principal level.",
    "Post and ribbit IDs are generated from map size (e.g., \"post_\" # (size+1)); after deletions IDs can be reused/collide.",
    "Frontend Froggy Phrase validation splits on whitespace, while backend createPond validates by splitting only on the literal ' ' character; unusual whitespace may disagree on word count.",
    "CreatePondPage implies the Froggy Phrase secures pond admin access, but the backend does not persist the phrase; pond admin rights are based on the caller principal.",
    "Username-based avatar save/retrieve has no authorization checks (by design in code), allowing anyone to overwrite an avatar for a given username.",
    "createPost updates usernameOwnership/principalToUsername mappings based on the provided username argument, allowing callers to post under arbitrary usernames and undermining intended username registry semantics.",
    "createRibbit does not validate that the referenced post exists nor enforce pond membership before allowing comments.",
    "Backend getRecentRibbitViews() comment says “last 30 days” but uses a 1-day window (24h) constant (lastDay)."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "ribbit",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}