{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Authorization currently gates core actions (create ponds/lilies, save avatars, etc.) behind a #user role; anonymous principals are not treated as users, conflicting with the intended fully-anonymous access model."
  ],
  "known_issues": [
    "Anonymous visitors cannot create ponds/lilies or save custom avatars due to backend permission checks requiring a #user role; site is intended to allow full access anonymously."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-frontend-remove-or-relax-any-ui-side-gating-that-blocks-anonymous-visitors-from-initiating-pond-creation-lily-creation-or-avatar-saving-based-on-a-user-role-check-so-the-ui-matches-the-new-backend-behavior-anonymous-users-have-full-access",
      "title": "Frontend: remove or relax any UI-side gating that blocks anonymous visitors from initiating pond creation, lily creation, or avatar saving based on a “user role” check, so the UI matches the new backend behavior (anonymous users have full access).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update backend authorization so anonymous visitors (Principal.isAnonymous(caller) == true) are allowed to perform all actions required for the anonymous-first product model, specifically including: creating ponds, creating lilies/posts, joining/leaving ponds, liking/unliking, creating ribbits/replies, and saving user settings/avatars—without trapping with errors like \"Unauthorized: Only users can ...\".",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Adjust backend profile and avatar endpoints to support anonymous usage without trapping. In particular, ensure `getCallerUserProfile` and `saveCallerUserProfile` work for anonymous callers (or return safe results) so that the User Settings page can load and save an avatar for an anonymous visitor.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Allow anonymous visitors to create ponds, create lilies, and save avatars by removing #user role gating",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}