{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "ribbit is an anonymous, Reddit-style discussion platform built on the Internet Computer (ICP). Communities are “ponds”, posts are “lilies” (text/image/link with optional tags), and threaded comments are “ribbits”. The frontend is a React + TypeScript SPA using TanStack Router for navigation and TanStack React Query for server-state management. It communicates with a Motoko canister via an identity-aware actor (anonymous by default; optionally Internet Identity). Implemented features include pond discovery/creation/membership, lily creation/search/feeds and detail pages, threaded ribbits with replies, likes for lilies and ribbits, view count tracking with a local cooldown guard, tagging (suggestions, canonicalization/redirects, stats, rankings, tag pages), recent activity feeds, user settings (username registry with 24-hour change cooldown, username-based avatar upload/retrieval, Froggy Phrase local backup/restore, joined-pond management), and local-only bookmarks (“Saved Lilies”).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Frontend app bootstrap with providers and theming",
      "synonyms": [
        "QueryClientProvider",
        "InternetIdentityProvider",
        "ThemeProvider",
        "Global toaster"
      ],
      "description": "Bootstraps the SPA with TanStack React Query (QueryClientProvider), Internet Identity context, next-themes for light/dark/system theme, and a global Sonner Toaster for notifications.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Client-side routing and page structure",
      "synonyms": [
        "TanStack Router",
        "Route tree"
      ],
      "description": "Defines routes for Home feed, All Ponds, Pond feed, Pond About, Lily detail, Create Lily, Start Pond, Tags hub, Tag detail, Saved Lilies, Settings, and About pages under a shared layout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Responsive layout shell with mobile left-sidebar drawer",
      "synonyms": [
        "Layout",
        "Header/Footer shell",
        "MobileLeftSidebarDrawer"
      ],
      "description": "Provides a shared page shell with a sticky Header and Footer, desktop sidebars, and a mobile off-canvas left drawer with scrim overlay and body scroll locking; drawer auto-closes on navigation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Internet Identity authentication integration",
      "synonyms": [
        "AuthClient",
        "Internet Identity login/logout"
      ],
      "description": "Implements Internet Identity login, stored session loading, logout/clear, and status flags (initializing/logging-in/success/error) via a React context provider.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Identity-aware backend actor lifecycle and cache invalidation",
      "synonyms": [
        "useActor",
        "Actor per principal"
      ],
      "description": "Creates a backend actor using anonymous identity or Internet Identity; on authenticated actors it calls initializeAccessControl(). When the actor changes, all non-actor React Query caches are invalidated and refetched.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Pond discovery and retrieval APIs (list/get/search)",
      "synonyms": [
        "listPonds",
        "getPond",
        "searchPonds"
      ],
      "description": "Supports listing all ponds, fetching a pond by name, and searching ponds by a text term through React Query hooks backed by canister query methods.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Pond creation with required images and Froggy Phrase validation",
      "synonyms": [
        "Start a Pond",
        "createPond"
      ],
      "description": "Allows users to create a pond with name/title/description plus required profile and banner images uploaded as ExternalBlob; requires a Froggy Phrase (>= 5 words) validated in the UI and by the canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Pond membership management (join/leave) and joined pond listing",
      "synonyms": [
        "joinPond",
        "leavePond",
        "getJoinedPonds"
      ],
      "description": "Users can join/leave ponds; membership state is used across pond pages and Settings (“My Ponds”), including confirmation dialog when leaving.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Pond feed page with responsive header and join affordances",
      "synonyms": [
        "PondPage",
        "Pond banner/profile header"
      ],
      "description": "Displays pond banner/profile imagery and pond metadata, filters lilies to the selected pond, sorts newest-first, and shows a join button on mobile when the user is not a member.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Consistent mobile pond header across Feed and About tabs",
      "synonyms": [
        "PondMobileHeader",
        "Mobile pond tabs consistency"
      ],
      "description": "Uses a shared mobile-only header component rendering banner, avatar, pond name/description, and Feed/About tabs so switching tabs only changes content below the tab bar.",
      "reqIds": [
        "REQ-2",
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Pond About information views (desktop sidebar + mobile About page)",
      "synonyms": [
        "getPondAboutInfo",
        "PondAboutSidebar",
        "PondAboutPage"
      ],
      "description": "Fetches and renders pond About info including creation date, member count, visibility, rules, moderators, associated tags, and lily count; shown as a right sidebar on desktop and as a dedicated About page on mobile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Lilies (posts): list/get/search/create with text, image, link and optional tag",
      "synonyms": [
        "listPosts",
        "getPost",
        "searchPosts",
        "createPost"
      ],
      "description": "Provides lily feeds and searching, individual lily retrieval, and lily creation supporting text content, optional image upload (ExternalBlob), optional external link, pond selection, and optional tag.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Membership gating for lily creation",
      "synonyms": [
        "Posting requires pond membership"
      ],
      "description": "Frontend Create Lily page blocks submission when the selected pond is not joined, and the canister enforces pond membership for createPost().",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Lily feed card UI with avatars, media handling, and engagement actions",
      "synonyms": [
        "LilyCard",
        "Post preview card"
      ],
      "description": "Renders lily previews with pond/author metadata, optional tag link, image preview with blurred backdrop handling for non-4:3 images, link host display, and engagement actions (likes, ribbits count, views, share, bookmark).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Lily detail page with lightbox image viewer and ribbit composer",
      "synonyms": [
        "LilyPage",
        "Post detail"
      ],
      "description": "Shows full lily content, optional external link, an image lightbox modal, engagement row (likes/ribbits/views/share/bookmark), and a ribbit composer with a threaded ribbit list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Threaded ribbits (comments) with nested replies",
      "synonyms": [
        "getThreadedRibbits",
        "createRibbit",
        "Nested replies"
      ],
      "description": "Supports creating ribbits with optional parentId and rendering a threaded list with indentation; UI includes inline reply forms and per-ribbit timestamps and avatars.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Likes for lilies and ribbits with counts and per-user state",
      "synonyms": [
        "like/unlike post",
        "like/unlike ribbit"
      ],
      "description": "Implements like/unlike mutations and queries for like counts and whether the caller has liked a given lily or ribbit; React Query invalidation keeps counts and state fresh.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "View counts with increment endpoint and local cooldown guard",
      "synonyms": [
        "incrementLilyViewCount",
        "viewCountCooldown"
      ],
      "description": "Canister tracks per-lily viewCount and exposes an increment API; frontend increments on lily open with a 5-minute localStorage cooldown and StrictMode-safe “attempted” guard.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Tag suggestions for lily creation",
      "synonyms": [
        "getTagSuggestions",
        "Tag autocomplete"
      ],
      "description": "Provides debounced tag prefix suggestions (top by usage) and a dropdown selector in the Create Lily page with click-outside-to-close behavior.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Tag pages with canonicalization/redirects, stats, and sorting",
      "synonyms": [
        "TagPage",
        "Canonical tag redirect",
        "TagStats"
      ],
      "description": "Tag detail pages fetch canonical tags, redirect to canonical when needed, show tag stats (postsTotal/repliesTotal/lastActivityAt), and list tagged lilies sortable by newest/most viewed/most replied.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Tag rankings hub (Top/Trending/Newest)",
      "synonyms": [
        "TagHubPage",
        "Top tags",
        "Trending tags",
        "Newest tags"
      ],
      "description": "Implements a Tags hub with tabbed views for Top/Trending/Newest rankings backed by canister endpoints returning TagStats and displayed in a ranked list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Centralized tag icon circle styling utility",
      "synonyms": [
        "tag-icon-circle-bg",
        "Tag icon circle background"
      ],
      "description": "Defines a shared CSS utility class for tag icon circles (no border; light gray background in both light and dark mode) and uses it consistently across Tag Hub and Tag Page headers.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Admin-only tag merging and redirect inspection UI",
      "synonyms": [
        "mergeSimilarTags",
        "getTagRedirects",
        "Admin tools"
      ],
      "description": "Admins can merge similar tags based on normalization rules, creating redirect mappings and consolidating TagStats; Settings includes an Admin tab to trigger merging and view active redirects.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Recent activity feeds and left sidebar widget",
      "synonyms": [
        "getAllRecentActivities",
        "Recent Activity"
      ],
      "description": "Canister stores activity records and exposes recent activity queries; frontend LeftSidebar renders a small Recent Activity list with relative timestamps and links to lily detail when available.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "User profiles (principal-based) save/load and moderator profile lookups",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "getUserProfile"
      ],
      "description": "Supports reading and saving the caller’s user profile (including joined ponds) and fetching multiple principal profiles for moderator lists in pond About views.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Username registry with availability checks and 24-hour change cooldown",
      "synonyms": [
        "registerUsername",
        "releaseUsername",
        "canChangeUsername",
        "recordUsernameChange"
      ],
      "description": "Supports unique username ownership with debounced availability checks, frog/toad/tadpole validation in the UI, and a canister-enforced 24-hour username change cooldown.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Username-based public avatars with upload progress UI",
      "synonyms": [
        "saveAvatarByUsername",
        "getUserAvatarByUsername"
      ],
      "description": "Stores avatar blobs keyed by username. The Settings page supports selecting an image, previewing it, uploading via ExternalBlob with progress callbacks, and displaying avatars across the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Local anonymous identity utilities and Froggy Phrase backup/restore",
      "synonyms": [
        "Local username/userId",
        "Froggy Phrase"
      ],
      "description": "Generates and stores anonymous username/userId locally; supports saving/restoring local settings via a Froggy Phrase (>= 5 words) stored on-device (hashed + base64-obfuscated original) with a settings backup payload.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Local-only bookmarks and Saved Lilies page",
      "synonyms": [
        "Bookmarks",
        "Saved Lilies"
      ],
      "description": "Implements localStorage-backed bookmarking of lily IDs, a bookmark toggle button, and a Saved Lilies page that loads each lily on demand, handles missing posts, and allows removal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Discovery sidebars and number formatting utilities",
      "synonyms": [
        "RightSidebar",
        "Trending Ponds",
        "Popular Tags",
        "Hot This Week"
      ],
      "description": "Right sidebar computes and displays trending ponds (by memberCount), popular tags (client-side from loaded lilies), and hot posts (last 7 days by viewCount). Includes compact number formatting (k/M/B).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Share lily utility with Web Share API and clipboard fallback",
      "synonyms": [
        "shareLily",
        "Copy link fallback"
      ],
      "description": "Shares lily URLs using the Web Share API when available, with clipboard and execCommand fallback behavior and toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Backend access control and role management",
      "synonyms": [
        "initializeAccessControl",
        "AccessControl module"
      ],
      "description": "Implements basic role-based access control (admin/user/guest), initialization flow for non-anonymous principals, admin role assignment, and restoration logic in postupgrade().",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Backend blob storage mixin integration for gateway auth and GC support",
      "synonyms": [
        "Caffeine blob-storage mixin",
        "_caffeineStorage* endpoints"
      ],
      "description": "Includes the Caffeine blob-storage mixin endpoints for gateway principal updates, blob liveness queries, deletion confirmation, and cashier refill top-ups; frontend uses ExternalBlob direct URLs for rendering media.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-tag-detail-page-to-remove-the-total-activity-and-last-activity-fields-from-the-ui-including-their-labels-icons-and-values",
      "title": "Update the Tag detail page to remove the “Total Activity” and “Last Activity” fields from the UI (including their labels, icons, and values).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-transparency-effects-from-the-global-top-header-so-it-renders-fully-opaque-no-translucent-background-and-no-backdrop-blur-based-translucency",
      "title": "Remove transparency effects from the global top header so it renders fully opaque (no translucent background and no backdrop blur-based translucency).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Tag view page: remove Total Activity and Last Activity fields from the UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Tag view page header: remove transparency and make header fully opaque",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React + TypeScript SPA with TanStack Router route tree rooted in a shared Layout (Header/Footer + Outlet).",
    "Backend is a single Motoko canister (actor Ribbit) using in-canister OrderedMap state for ponds, posts, ribbits, likes, usernames, avatars, activities, and tag stats/redirects.",
    "Server-state is encapsulated in @tanstack/react-query hooks (useQueries.ts) with stable query keys, actor-ready enabled guards, and mutation-driven cache invalidation.",
    "Identity lifecycle is centralized in useActor(): creates an anonymous or authenticated actor; authenticated actors call initializeAccessControl(); actor changes invalidate/refetch all non-actor queries to avoid cross-identity cache reuse.",
    "Authentication is provided via an InternetIdentityProvider wrapper over @dfinity/auth-client with stored identity loading and login/logout state tracking.",
    "Media handling uses ExternalBlob objects; backend integrates a Caffeine blob-storage mixin for gateway authorization and blob GC support; frontend renders images via ExternalBlob direct URLs.",
    "UI is Tailwind CSS + shadcn/ui primitives, with OKLCH design tokens and dark mode via next-themes.",
    "Several user features are intentionally client-local via localStorage (anonymous username/userId, Froggy Phrase backup payload, bookmarks, view-count cooldown timestamps).",
    "Tag subsystem includes normalization, suggestions, canonical redirects, tag stats tracking, ranking endpoints (Top/Trending/Newest), and an admin-only merge operation that creates redirect mappings."
  ],
  "known_issues": [
    "Motoko computeTrendingScore() mixes Nat math (postsTotal/repliesTotal) with Int math (adjustedAge/radius), which is type-incompatible and likely fails to compile or produces incorrect logic without explicit conversions.",
    "mergeSimilarTags() iterates Iter.range(0, tagCount - 1); when tagCount == 0, Nat underflow can trap.",
    "ensureUserRole() calls AccessControl.getUserRole() for non-anonymous principals; if a principal hasn’t been initialized, getUserRole() traps (“User is not registered”), preventing auto-initialization unless initializeAccessControl() was called earlier.",
    "Pond creation validates a “Froggy Phrase”, but the phrase is not persisted or used for future authorization; pond admin rights remain principal-based, so the phrase does not actually “secure” later admin access.",
    "Recent Activity UI (LeftSidebar) assumes activity.targetId is always a postId and calls getPost(); backend also records #viewRibbit activities where targetId is a ribbitId, so those entries won’t render.",
    "Anonymous users share the same on-chain anonymous principal on ICP; any Principal-keyed state (likes, joined ponds, profiles) may collide across different anonymous browsers/devices.",
    "Username-based avatars are intentionally unauthenticated; any caller can overwrite another username’s avatar by calling saveAvatarByUsername().",
    "Post/ribbit IDs are derived from map size (e.g., \"post_\" + (size+1)); deletions can cause ID reuse/collisions over time.",
    "Activity logging appears inconsistent (e.g., createPost() doesn’t log #post; createRibbit() records a view-style activity on creation; likePost() logs with empty username/pond).",
    "Several files are empty placeholders (e.g., PostCard.tsx, PostPage.tsx, CreatePostPage.tsx, CommentItem.tsx, EmojiReactions.tsx, RibbitEmojiTray.tsx), which may confuse maintenance if referenced later."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "ribbit",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}