{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "ribbit is an anonymous, Reddit-style discussion platform built on the Internet Computer (ICP). Communities are “ponds”, posts are “lilies” (text/image/link with optional tags), and threaded comments are “ribbits”. The frontend is a React + TypeScript SPA using TanStack Router and React Query, featuring a responsive three-column layout with a mobile off-canvas left drawer, search, and settings. The backend is a Motoko canister implementing ponds, membership, posts, threaded comments, likes, tagging (canonical redirects + admin merging), principal-based user profiles, a username registry with cooldown, username-based avatar storage, recent-activity queries, access control roles, and a blob-storage mixin for image upload/serving and maintenance.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "SPA routing and responsive application shell",
      "synonyms": [
        "TanStack Router route tree",
        "Layout",
        "three-column layout",
        "mobile drawer"
      ],
      "description": "Implements SPA routing for Home, Pond feed, Pond About, Lily detail, All Ponds, Start Pond, Create Lily, Settings, About, and Tag pages. Provides a shared Layout with sticky Header/Footer, desktop sidebars, and a mobile off-canvas left sidebar drawer that locks body scroll and closes on route changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Header navigation with search, create actions, and avatar",
      "synonyms": [
        "Header",
        "search dialog",
        "create menu",
        "wordmark styling"
      ],
      "description": "Top header includes frog icon + “ribbit” wordmark, desktop search bar and mobile search dialog, navigation actions (All Ponds/Start Pond/Create Lily), mobile hamburger trigger for the left drawer, and username-based avatar display linking to Settings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Light/dark theming via OKLCH design tokens",
      "synonyms": [
        "next-themes",
        "Tailwind semantic tokens",
        "CSS variables theme",
        "sidebar token set"
      ],
      "description": "Defines OKLCH CSS variable palettes for light and dark mode, maps them to Tailwind semantic colors (background/foreground/card/sidebar/etc.), and switches themes using next-themes (darkMode via class).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Internet Identity authentication context",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient",
        "DelegationIdentity"
      ],
      "description": "Provides an authentication provider using @dfinity/auth-client with identity restoration on reload, login/logout helpers, and login-status tracking (initializing/logging-in/success/error).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "ICP actor lifecycle management integrated with React Query",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "actor-per-identity"
      ],
      "description": "Creates and caches the backend canister actor per identity (anonymous vs authenticated). For authenticated identities it calls initializeAccessControl() on the canister. When the actor changes, all other React Query caches are invalidated and refetched.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Pond discovery (list/get/search) and All Ponds page",
      "synonyms": [
        "listPonds",
        "getPond",
        "searchPonds",
        "AllPondsPage"
      ],
      "description": "Supports listing all ponds, fetching a pond by name, and searching ponds by term. The All Ponds page renders a responsive grid with pond profile images, descriptions, member counts, and joined badges.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Pond creation with required images and Froggy Phrase validation",
      "synonyms": [
        "createPond",
        "Start a Pond",
        "banner/profile upload"
      ],
      "description": "Allows creating a pond with name/title/description, required banner + profile images uploaded as ExternalBlob, and a Froggy Phrase validated (minimum 5 words). Backend sets the creator as pond admin/moderator and first member and updates/creates the caller’s joined ponds in their profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Pond membership management (join/leave) with Settings “My Ponds” UI",
      "synonyms": [
        "joinPond",
        "leavePond",
        "getJoinedPonds"
      ],
      "description": "Backend supports joining/leaving ponds, maintaining memberCount/members, and mirroring membership into the caller’s UserProfile.joinedPonds. Frontend allows joining from Pond pages and viewing/leaving joined ponds from Settings with confirmation dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Pond feed page with banner header and join CTA",
      "synonyms": [
        "PondPage",
        "pond feed"
      ],
      "description": "Displays a pond’s banner, profile image, title, and description in a header and renders a pond-scoped lily feed sorted by newest. Shows a Join Pond button when the viewer is not a member.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Pond About info and About page UI",
      "synonyms": [
        "getPondAboutInfo",
        "PondAboutPage"
      ],
      "description": "Exposes structured pond metadata (createdAt, memberCount, visibility, rules, moderators/admin, associated tags, lilyCount, images). Frontend renders an About page with stats, rules, moderators (with username-based avatars), tag links, and a member-only Leave action.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Pond admin/moderation operations (backend)",
      "synonyms": [
        "editPondSettings",
        "add/removeModerator",
        "add/removePondRule",
        "deleteLily",
        "deleteRibbit",
        "removeMemberFromPond",
        "isPondAdmin"
      ],
      "description": "Implements pond-admin-only actions for editing settings, managing moderators and rules, deleting lilies/ribbits in the pond, and removing members while synchronizing the removed member’s joinedPonds.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Lily (post) feeds and search",
      "synonyms": [
        "listPosts",
        "getPost",
        "searchPosts",
        "Home feed"
      ],
      "description": "Backend supports listing all posts, fetching individual posts, and searching posts by term. Frontend renders a Home feed with Trending/New tabs (currently recency-based) and supports searching lilies via the header (route search param q).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Create Lily form (text/image/link) with membership checks and tag suggestions",
      "synonyms": [
        "createPost",
        "CreateLilyPage",
        "getTagSuggestions"
      ],
      "description": "Create Lily form supports text, image, or link lilies, pond selection, optional tag with debounced tag suggestions, image preview/upload as ExternalBlob, and client-side membership validation; backend enforces pond existence and membership for creating posts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Lily card UI with media handling and engagement metrics",
      "synonyms": [
        "LilyCard",
        "blurred backdrop for non-4:3 images",
        "like toggle in feed"
      ],
      "description": "Renders lilies as feed cards with pond/user metadata, optional image with aspect-aware blurred backdrop, optional link hostname display, and engagement metrics (likes, ribbits count, views) driven by React Query hooks, including in-card like toggling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Lily detail page with lightbox, like toggle, and ribbit composer",
      "synonyms": [
        "LilyPage",
        "lightbox modal",
        "post detail"
      ],
      "description": "Displays a lily’s full content including optional image (click-to-open lightbox) and optional external link. Shows like/reply/view counts, supports liking/unliking, provides a ribbit composer, and renders threaded ribbits.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Threaded ribbits (comments) with replies",
      "synonyms": [
        "createRibbit",
        "getThreadedRibbits",
        "RibbitItem"
      ],
      "description": "Backend supports creating ribbits with optional parentId and fetching ribbits in threaded order. Frontend renders nested ribbits with indentation, inline reply forms, and per-ribbit user avatars by username.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Likes for lilies and ribbits",
      "synonyms": [
        "likePost/unlikePost",
        "likeRibbit/unlikeRibbit",
        "get*LikeCount",
        "hasUserLiked*"
      ],
      "description": "Backend tracks per-post and per-ribbit likes keyed by (targetId, principal) and provides like counts and per-caller liked status. Frontend provides like toggles and invalidates relevant caches after mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Tagging system with canonical redirects and tag feeds",
      "synonyms": [
        "normalizeTag",
        "getLiliesByTag",
        "getCanonicalTagForTag",
        "TagPage"
      ],
      "description": "Backend normalizes tags, tracks tag usage counts, resolves canonical tags via a redirect registry, and returns lilies by tag with sorting (newest/most viewed/most replied). Frontend Tag page redirects to canonical tag and renders sorted tagged feeds.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Admin tag merging and redirect inspection UI",
      "synonyms": [
        "mergeSimilarTags",
        "getTagRedirects",
        "isCallerAdmin",
        "Admin tab"
      ],
      "description": "Backend provides an admin-only tag merge operation using similarity heuristics and stores old→canonical redirects. Frontend Settings shows an Admin tab for admins to trigger merges and view active redirects.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Principal-based user profiles (save/load) and profile lookup",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "getUserProfile",
        "batch lookup"
      ],
      "description": "Stores a UserProfile per principal and supports reading/saving the caller profile and fetching other user profiles; frontend uses profile lookup for displaying pond moderators and stores joined ponds in the profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Username registry with availability checks and 24-hour change cooldown",
      "synonyms": [
        "isUsernameAvailable",
        "registerUsername",
        "releaseUsername",
        "canChangeUsername",
        "recordUsernameChange"
      ],
      "description": "Backend supports username registration, ownership tracking, release, and cooldown enforcement via timestamps. Frontend Settings provides debounced availability checks, frog/toad/tadpole substring validation, cooldown-aware saving, and updates the stored profile name for consistency.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Username-based avatar upload and retrieval with progress",
      "synonyms": [
        "saveAvatarByUsername",
        "getUserAvatarByUsername",
        "Settings avatar tab"
      ],
      "description": "Backend stores avatars by username and exposes public retrieval. Frontend supports avatar selection, preview, upload as ExternalBlob with progress callback, and rendering avatars in header, lily cards (optional), ribbits, and moderator lists.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Client-side anonymous identity and Froggy Phrase backup/restore",
      "synonyms": [
        "localStorage identity",
        "Froggy Phrase",
        "restore settings"
      ],
      "description": "Frontend generates/stores an anonymous username and userId in localStorage. Users can create a Froggy Phrase (>=5 words) that backs up local settings for restore on another device, with UI to show/copy/clear the phrase and to restore settings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Recent activity APIs and left sidebar activity feed",
      "synonyms": [
        "getAllRecentActivities",
        "LeftSidebar recent activity"
      ],
      "description": "Backend exposes recent activity queries (posts/ribbits/likes) and a combined recent activities list. Frontend left sidebar renders a Recent Activity section with relative timestamps and links into lily detail pages, including loading skeletons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Right sidebar discovery widgets",
      "synonyms": [
        "RightSidebar",
        "Trending Ponds",
        "Popular Tags",
        "Hot This Week"
      ],
      "description": "Renders a sticky right sidebar showing trending ponds (by memberCount), popular tags (computed from fetched lilies), and hot posts (by viewCount within last 7 days), with skeleton loading states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Blob storage mixin endpoints with gateway/cashier controls (backend)",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageRefillCashier",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion"
      ],
      "description": "Backend includes a blob-storage mixin exposing endpoints for updating authorized gateway principals, listing/pruning dead blobs, triggering GC after pruning, and topping up cycles via a cashier canister with authorization checks for maintenance operations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Access control roles with upgrade restoration (backend)",
      "synonyms": [
        "AccessControl",
        "initializeAccessControl",
        "admin/user roles",
        "postupgrade role restore"
      ],
      "description": "Implements role-based access control where the first initialized principal becomes admin and others become users. Tracks initialized principals/admin principal and attempts to restore roles in postupgrade; exposes role/admin checks and admin role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Compact number formatting utility",
      "synonyms": [
        "formatNumber",
        "k/M/B formatting"
      ],
      "description": "Utility function formats large counts into compact k/M/B notation for member counts, likes, replies, and views in the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-lily-detail-page-frontend-src-pages-lilypage-tsx-so-the-engagement-row-likes-replies-views-always-renders-in-a-fixed-location-directly-below-the-lily-s-main-content-block-title-description-then-image-if-present-and-link-if-present-then-the-engagement-row-do-not-change-engagement-row-placement-on-feed-cards-or-any-other-pages-components",
      "title": "Update the Lily detail page (frontend/src/pages/LilyPage.tsx) so the engagement row (likes, replies, views) always renders in a fixed location directly below the lily’s main content block: title + description, then image (if present) and link (if present), then the engagement row. Do not change engagement row placement on feed cards or any other pages/components.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "On Lily detail page, always render the engagement row (likes/replies/views) below the image and description (fixed placement for consistency)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Mobile left sidebar access: add a hamburger icon in the header (left of logo) that opens the left sidebar as an off-canvas drawer (Reddit-like)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Right sidebar styling update to Reddit-like: neutral very light gray background (no green tint), padding, border radius, and no outer border",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend uses TanStack Router for fileless route-tree routing and @tanstack/react-query for all backend reads/writes via stable query keys and explicit invalidations after mutations.",
    "Backend access is wrapped behind an ICP canister actor created per identity; authenticated identities call initializeAccessControl() during actor initialization (useActor), and actor changes trigger React Query invalidation/refetch for all dependent queries.",
    "Authentication is implemented via an InternetIdentityProvider using @dfinity/auth-client; identities are persisted across reloads and login uses DelegationIdentity with long TTL.",
    "UI uses TailwindCSS + shadcn/ui components; theming is driven by OKLCH CSS variables and next-themes (class-based dark mode), including a separate neutral-gray sidebar token set.",
    "Backend is a single Motoko canister with persistent state held in OrderedMap maps (ponds, posts, ribbits, profiles, username registry, avatars, likes, tags, activities).",
    "Images/avatars are stored and transported as ExternalBlob; frontend renders blobs via getDirectURL() and uploads via File → Uint8Array → ExternalBlob (avatar upload supports progress callbacks).",
    "Backend composes a Caffeine blob-storage mixin that exposes maintenance endpoints (gateway principal refresh, dead-blob listing/pruning, cashier refill) with authorization checks.",
    "Backend access control module assigns the first initialized principal as admin and supports role assignment; the canister attempts to restore roles post-upgrade by tracking initialized principals."
  ],
  "known_issues": [
    "Post viewCount is readable (getViewCountForPost) and used for “Hot This Week”, but the backend provides no update path to increment viewCount; view-based sorting/widgets will likely remain at 0.",
    "Recent Activity UI assumes Activity.targetId is always a post id (it fetches the lily by targetId); backend also stores #viewRibbit activities with ribbit IDs, so those entries won’t render in the sidebar.",
    "Activity logging is inconsistent/incomplete: createPost does not log a #post activity; createRibbit logs #viewRibbit activity (not #ribbit); likePost logs activity without username/pond context.",
    "mergeSimilarTags() iterates Iter.range(0, tagCount - 1); when tagCount is 0 this can underflow/trap—should guard for tagCount < 2.",
    "ensureUserRole() calls AccessControl.getUserRole(), which traps for non-anonymous principals that have not been initialized; the frontend mitigates this by calling initializeAccessControl() when creating an authenticated actor, but direct canister calls or missed initialization can still trap.",
    "Anonymous users share the same anonymous principal on-chain, so membership, profiles, and like status collide across anonymous users (local usernames are not enforced on-chain).",
    "Post/ribbit ID generation uses map size (e.g., \"post_\" # (size+1)); after deletions, IDs can be reused/collide.",
    "Backend Froggy Phrase validation in createPond splits only on the single space character; multiple whitespace sequences can be counted differently than the frontend’s regex-based validation.",
    "CreatePondPage messaging implies the Froggy Phrase secures pond admin access, but the backend does not store the phrase; pond admin rights are based solely on the caller principal.",
    "Username-based avatar save/retrieve intentionally has no authorization checks, allowing anyone to overwrite an avatar for a given username.",
    "createPost updates usernameOwnership/principalToUsername mappings solely from the provided username, which can undermine the intended username registry semantics (a caller can post under an arbitrary username and overwrite mappings).",
    "createRibbit does not validate that the post exists nor enforce pond membership before allowing comments.",
    "Several source files are empty/placeholder stubs (e.g., frontend/src/components/PostCard.tsx, frontend/src/components/CommentItem.tsx, frontend/src/components/EmojiReactions.tsx, frontend/src/components/RibbitEmojiTray.tsx, frontend/src/pages/PostPage.tsx, frontend/src/pages/CreatePostPage.tsx), suggesting unfinished or dead code paths."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "ribbit",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}