{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "ribbit is an anonymous, Reddit-style discussion platform built on the Internet Computer (ICP). Communities are “ponds”, posts are “lilies” (text/image/link with optional tags), and threaded comments are “ribbits”. The React + TypeScript frontend uses TanStack Router for navigation and @tanstack/react-query for cached reads and mutations against a Motoko canister actor. The backend canister manages ponds and membership (including member-only posting), lily and ribbit creation and retrieval (including threaded views), tag normalization/canonical redirects with auto-suggest and similarity merging, principal-based user profiles, a username registry with uniqueness enforcement and a 24-hour change cooldown (and substring validation for frog/toad/tadpole), avatar storage, view counting, recent-activity feeds, share + local bookmarking (Saved Lilies), and pond about/sidebar presentation. Media is transported via ExternalBlob and the canister includes a Caffeine blob-storage mixin with maintenance endpoints.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "SPA routing and shared responsive layout",
      "synonyms": [
        "TanStack Router",
        "Layout shell"
      ],
      "description": "Defines client-side routes for Home, All Ponds, Pond feed, Pond About, Lily detail, Create Lily, Start Pond, Tag pages, Settings, About, and Saved Lilies. All pages render inside a shared Layout with Header and Footer.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Mobile left sidebar drawer with scroll lock",
      "synonyms": [
        "off-canvas drawer",
        "MobileLeftSidebarDrawer"
      ],
      "description": "Implements a mobile-only slide-in left sidebar with a scrim overlay; disables body scrolling while open and closes when the route changes or the scrim is clicked.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Light/dark theming with OKLCH design tokens",
      "synonyms": [
        "next-themes",
        "Tailwind CSS variables"
      ],
      "description": "Supports light/dark themes via next-themes class switching and OKLCH-based CSS variables mapped into Tailwind semantic color tokens (including dedicated sidebar tokens).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Header with search, create actions, and settings avatar",
      "synonyms": [
        "Header navigation",
        "mobile search dialog"
      ],
      "description": "Top header includes branding, desktop search (navigates to Home with q param), mobile search dialog, create dropdown/actions (Start a Pond, Create Lily, etc.), and a settings link showing the user’s avatar (username-based).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Left sidebar navigation with recent activity list",
      "synonyms": [
        "LeftSidebar",
        "Recent Activity"
      ],
      "description": "Left sidebar provides navigation links (Home, All Ponds, Create Lily, Saved Lilies, Settings) with active-route styling and shows recent activity items with relative timestamps linking to lily detail routes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Right sidebar discovery widgets",
      "synonyms": [
        "RightSidebar",
        "Trending Ponds",
        "Popular Tags",
        "Hot This Week"
      ],
      "description": "Desktop right sidebar computes and displays trending ponds (memberCount), popular tags (tag counts across fetched lilies), and popular posts from the last 7 days (by viewCount).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient"
      ],
      "description": "Provides a React context for Internet Identity login/logout and stored-identity loading using @dfinity/auth-client, exposing detailed status flags for UI integration.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "ICP actor lifecycle management integrated with React Query",
      "synonyms": [
        "useActor",
        "actor-per-identity"
      ],
      "description": "Creates a backend canister actor per identity (anonymous vs authenticated). When authenticated, the actor calls initializeAccessControl(). Actor changes trigger broad React Query invalidation/refetch to keep data consistent across identities.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Centralized React Query API layer for backend operations",
      "synonyms": [
        "useQueries",
        "query keys",
        "mutations + invalidation"
      ],
      "description": "Implements React Query hooks for ponds, membership, lilies, ribbits, likes, tags, profiles, usernames, avatars, view counts, and recent activities with stable query keys and write-time invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Pond listing and search APIs consumed by UI",
      "synonyms": [
        "listPonds",
        "getPond",
        "searchPonds"
      ],
      "description": "Frontend can list ponds and fetch pond details for pages and sidebars. Backend supports listPonds/getPond/searchPonds queries; UI includes an All Ponds page with membership indicators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Create pond with profile/banner images and Froggy Phrase validation",
      "synonyms": [
        "createPond",
        "Start a New Pond"
      ],
      "description": "Allows users to create a pond with name/title/description, required profile and banner images uploaded as ExternalBlob, and a Froggy Phrase validated client-side (>=5 words) and server-side.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Pond membership (join/leave) with UI integration",
      "synonyms": [
        "joinPond",
        "leavePond",
        "getJoinedPonds"
      ],
      "description": "Supports joining/leaving ponds and reading joined pond names. UI includes join/leave actions on pond pages and a Settings “My Ponds” tab listing joined ponds with leave confirmation dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Pond feed page with banner header and pond-scoped lily list",
      "synonyms": [
        "PondPage",
        "pond feed"
      ],
      "description": "Renders a full-width pond banner and profile image with title/description overlay and shows lilies filtered to the pond and sorted by newest.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Reddit-style pond desktop layout with pond-specific About sidebar",
      "synonyms": [
        "PondAboutSidebar",
        "desktop pond right column"
      ],
      "description": "On /pond/$name for desktop breakpoints, the feed stays in the center column while a pond-specific About sidebar is shown on the right (stats, tags, rules, moderators, join/leave). Mobile keeps in-page Feed/About navigation buttons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Pond About page (mobile tabs, desktop back-to-feed)",
      "synonyms": [
        "PondAboutPage",
        "getPondAboutInfo"
      ],
      "description": "Dedicated pond About route displays pond metadata (created date, member count, visibility), tags, rules, moderators, and membership leave action. Tabs are shown on mobile only; desktop shows a back-to-feed button.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Home feed with sorting UI and search results",
      "synonyms": [
        "HomePage",
        "searchPosts"
      ],
      "description": "Home page lists lilies, provides Trending/New tabs (currently both recency-based), and supports search via query param q, delegating to backend searchPosts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Create Lily (post) with content modes and membership gating",
      "synonyms": [
        "CreateLilyPage",
        "createPost"
      ],
      "description": "Create Lily form supports text/image/link modes, pond selection, and blocks posting if the user has not joined the selected pond. Optional image upload is sent as ExternalBlob; optional link is stored as a URL string.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Tag suggestions during Lily creation",
      "synonyms": [
        "getTagSuggestions",
        "debounced tag autocomplete"
      ],
      "description": "Provides a debounced tag autocomplete dropdown while typing a tag (max length 25), backed by backend getTagSuggestions(prefix, limit).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Lily feed card UI with media rendering and engagement actions",
      "synonyms": [
        "LilyCard",
        "feed post card"
      ],
      "description": "Displays lily metadata, optional image (with blurred backdrop when aspect ratio differs from 4:3), optional content/link preview, and engagement row (likes, ribbit count, views, share, bookmark). Avatar can be pond avatar or user avatar depending on context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Lily detail page with lightbox, threaded ribbits, and engagement row",
      "synonyms": [
        "LilyPage",
        "post detail"
      ],
      "description": "Shows a lily’s full content, optional image with click-to-open lightbox, optional external link, engagement metrics (likes/replies/views), and a threaded ribbit list with a composer for new ribbits.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Threaded ribbits (comments) with replies and likes",
      "synonyms": [
        "getThreadedRibbits",
        "RibbitItem",
        "createRibbit"
      ],
      "description": "Backend stores ribbits with optional parentId and returns a threaded ordering. Frontend renders nested ribbits with indentation, reply forms, timestamps, username-based avatars, and like toggling/counts per ribbit.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Likes for lilies and ribbits",
      "synonyms": [
        "likePost/unlikePost",
        "likeRibbit/unlikeRibbit"
      ],
      "description": "Backend tracks per-target likes keyed by (targetId, principal) and exposes counts and per-caller liked status. Frontend provides toggles and invalidates related caches after mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "View count tracking with backend increment and frontend cooldown throttling",
      "synonyms": [
        "incrementLilyViewCount",
        "viewCountCooldown"
      ],
      "description": "Backend persists viewCount per post and exposes increment/read endpoints. Frontend increments on LilyPage open and throttles repeats via a localStorage cooldown window, with cache invalidation on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Tag pages with canonical redirects and sortable feeds",
      "synonyms": [
        "getLiliesByTag",
        "getCanonicalTagForTag",
        "getTagRedirects"
      ],
      "description": "Backend normalizes tags, supports canonical redirects, and returns lilies by tag with sort modes (newest/most_viewed/most_replied). Frontend redirects to canonical tags and renders the sorted feed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Admin-only tag merging and redirect inspection UI",
      "synonyms": [
        "mergeSimilarTags",
        "isCallerAdmin",
        "Settings Admin tab"
      ],
      "description": "Backend provides admin-only mergeSimilarTags() using similarity heuristics and maintains old→canonical redirects. Frontend Settings shows an Admin tab (only for admins) to trigger merges and view active redirects.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Principal-based user profiles with save/load and moderator lookup",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "getUserProfile"
      ],
      "description": "Backend stores a UserProfile per principal and exposes queries for the caller profile and arbitrary principal profiles. Frontend loads/saves the caller profile and fetches moderator profiles for pond About displays.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Username registry with availability checks and 24-hour change cooldown",
      "synonyms": [
        "registerUsername",
        "releaseUsername",
        "isUsernameAvailable",
        "canChangeUsername",
        "recordUsernameChange"
      ],
      "description": "Backend supports username registration/ownership, release, and cooldown enforcement. Frontend Settings performs debounced availability checks, enforces frog/toad/tadpole substring validation, checks cooldown, and updates stored username and profile name.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Username-based avatar upload/retrieval with progress UI",
      "synonyms": [
        "saveAvatarByUsername",
        "getUserAvatarByUsername"
      ],
      "description": "Backend stores avatars by username and allows public retrieval. Frontend allows selecting a file, previewing it, uploading as ExternalBlob with progress callbacks, and rendering avatars across the app (header, lily cards, ribbits, moderators).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Client-side anonymous identity storage and Froggy Phrase backup/restore",
      "synonyms": [
        "localStorage identity",
        "Froggy Phrase"
      ],
      "description": "Stores anonymous username/userId locally and supports a Froggy Phrase workflow to back up and restore local settings across devices (phrase stored locally; restore checks a stored hash).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Local-only bookmarking with Saved Lilies page",
      "synonyms": [
        "useBookmarks",
        "BookmarkButton",
        "SavedLiliesPage"
      ],
      "description": "Implements localStorage-backed bookmarking of lily IDs, a bookmark toggle button in lily UIs, and a Saved Lilies page that loads each saved lily and handles missing/unavailable posts with a remove option.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Share Lily (Web Share API + clipboard fallback)",
      "synonyms": [
        "shareLily",
        "copy link"
      ],
      "description": "Provides a utility to share a lily URL using navigator.share when available, falling back to clipboard copy (or document.execCommand) with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Recent activity endpoints and sidebar consumption",
      "synonyms": [
        "getAllRecentActivities",
        "Recent Activity sidebar"
      ],
      "description": "Backend tracks multiple activity maps and exposes queries for recent posts/ribbits/likes and a combined recent activity feed. Frontend consumes getAllRecentActivities() to render a Recent Activity list in the left sidebar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Compact number formatting utility",
      "synonyms": [
        "formatNumber",
        "k/M/B notation"
      ],
      "description": "Formats large counts into compact k/M/B notation for display in the UI (members, likes, replies, views).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Backend role-based access control with initialization and upgrade restoration",
      "synonyms": [
        "AccessControl",
        "initializeAccessControl",
        "postupgrade role restore"
      ],
      "description": "Implements admin/user/guest roles with initialization, admin-only role assignment, and postupgrade restoration based on persisted initialized principal tracking and stored admin principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-35",
      "title": "Backend blob storage mixin with maintenance endpoints",
      "synonyms": [
        "Caffeine blob-storage mixin",
        "_caffeineStorage*"
      ],
      "description": "Includes blob-storage mixin endpoints for gateway principal updates, dead-blob listing/pruning confirmation (authorized principals only), and cashier refill (cashier principal only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-header-search-input-to-use-a-fully-rounded-border-radius-equivalent-to-9999px-e-g-tailwind-rounded-full-so-the-input-appears-pill-shaped-in-all-responsive-layouts",
      "title": "Update the Header search input to use a fully-rounded border radius equivalent to 9999px (e.g., Tailwind `rounded-full`) so the input appears pill-shaped in all responsive layouts.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-all-buttons-in-the-header-to-use-a-fully-rounded-border-radius-equivalent-to-9999px-e-g-tailwind-rounded-full-so-they-appear-pill-shaped-across-desktop-and-mobile-header-layouts",
      "title": "Update all buttons in the Header to use a fully-rounded border radius equivalent to 9999px (e.g., Tailwind `rounded-full`) so they appear pill-shaped across desktop and mobile header layouts.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-start-a-pond-button-on-the-all-ponds-page-to-use-a-fully-rounded-border-radius-equivalent-to-9999px-e-g-tailwind-rounded-full",
      "title": "Update the 'Start a Pond' button on the All Ponds page to use a fully-rounded border radius equivalent to 9999px (e.g., Tailwind `rounded-full`).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-following-buttons-on-the-user-settings-page-to-use-a-fully-rounded-border-radius-equivalent-to-9999px-e-g-tailwind-rounded-full-save-changes-save-froggy-phrase-and-choose-avatar",
      "title": "Update the following buttons on the User Settings page to use a fully-rounded border radius equivalent to 9999px (e.g., Tailwind `rounded-full`): 'Save Changes', 'Save Froggy Phrase', and 'Choose Avatar'.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Apply fully-rounded (border-radius: 9999px) styling to specified UI elements: header search input, header buttons, All Ponds “Start a Pond” button, and Settings buttons (Save Changes, Save Froggy Phrase, Choose Avatar).",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack Router; pages are rendered inside a shared Layout with Header/Footer and responsive sidebars (3-column on desktop; mobile uses an off-canvas drawer).",
    "All backend/canister interactions are centralized in a single React Query hook module (useQueries) with consistent query keys and explicit cache invalidation on writes.",
    "Actor lifecycle is identity-aware: useActor creates an anonymous actor when unauthenticated; when authenticated it creates an identity-bound actor and calls initializeAccessControl(); actor changes trigger broad query invalidation/refetch.",
    "Internet Identity authentication is encapsulated in a React context/provider using @dfinity/auth-client with stored-identity loading and explicit login status flags.",
    "Styling uses TailwindCSS with shadcn/ui components and OKLCH CSS-variable design tokens; light/dark mode is handled via next-themes class-based switching.",
    "Backend is a single Motoko canister storing state in OrderedMap maps for ponds/posts/ribbits/profiles/tags/likes/activity, with role-based authorization via an AccessControl module.",
    "Images/avatars are handled as ExternalBlob values; the frontend converts File → Uint8Array → ExternalBlob and renders using getDirectURL(); avatar upload supports progress callbacks.",
    "Client-side localStorage is used for anonymous identity (username/userId), bookmarks, Froggy Phrase backup/restore, and per-lily view-count cooldown throttling.",
    "Backend composes a Caffeine blob-storage mixin exposing gateway principal updates, dead-blob pruning confirmation, and cashier refill endpoints.",
    "Desktop pond layout follows a Reddit-style pattern: the pond feed is the center column, while pond “About” information is presented in a dedicated right sidebar component (mobile keeps in-page Feed/About navigation)."
  ],
  "known_issues": [
    "Recent Activity UI assumes Activity.targetId is always a lily id (it fetches a lily for each activity); backend also records #viewRibbit activities whose targetId is a ribbit id, so those entries won’t render.",
    "Activity logging is inconsistent: createPost does not log #post activity; createRibbit records #viewRibbit activity on creation; likePost logs like activity with empty username/pond fields.",
    "mergeSimilarTags() iterates with Iter.range(0, tagCount - 1); if tagCount is 0 this can underflow/trap in Motoko (Nat subtraction).",
    "AccessControl.getUserRole() traps for non-anonymous principals that haven’t been initialized; the frontend mitigates this by calling initializeAccessControl() on authenticated actor creation, but direct calls/missed initialization can still trap.",
    "Anonymous users share the same anonymous principal on-chain, so likes, membership, and profiles can collide between anonymous users (local usernames do not map to unique on-chain principals).",
    "Post and ribbit IDs are generated from map size (e.g., \"post_\" # (size+1)); after deletions IDs can be reused/collide.",
    "Frontend Froggy Phrase validation splits on all whitespace, while backend createPond validates by splitting only on literal space characters; unusual whitespace may disagree on word count.",
    "CreatePondPage implies the Froggy Phrase secures pond admin access, but the backend does not persist the phrase; pond admin rights are based on the caller principal.",
    "Username-based avatar save/retrieve has no authorization checks (by design), allowing anyone to overwrite an avatar for a given username.",
    "createPost updates usernameOwnership/principalToUsername mappings using the provided username argument, enabling callers to post under arbitrary usernames and undermining intended username-registry semantics."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "ribbit",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}