{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [
    "Backend currently mixes two identity systems (phrase-hash userId linkage vs principal-based calls); membership join/leave must use a consistent identity source across flows."
  ],
  "known_issues": [
    "Joining a pond can fail with error: \"failed to join pond: user id not found\" due to mismatch between phrase-hash userId expectations and principal-based join flow."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-frontend-join-leave-pond-flows-react-query-hooks-and-any-ui-components-that-surface-join-errors-so-that-after-the-backend-fix-joining-leaving-works-without-showing-the-previous-user-id-not-found-failure-and-the-ui-refreshes-membership-dependent-queries-correctly",
      "title": "Update frontend join/leave pond flows (React Query hooks and any UI components that surface join errors) so that after the backend fix, joining/leaving works without showing the previous 'user id not found' failure, and the UI refreshes membership-dependent queries correctly.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix join/leave pond membership failing due to identity mismatch (phrase-hash userId vs principal), resulting in 'user id not found' error",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update backend pond membership storage and logic so joining/leaving a pond uses Froggy Phrase hash identity (userId: Text) end-to-end, without requiring a userId→Principal lookup (userIdLinkage) and without relying on caller Principal for membership.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure backend join/leave pond operations correctly update the user profile’s joinedPonds list for the phrase-hash identity (userIdUserProfiles / getUserProfileByPhraseHash), creating a default profile if none exists for that userId, and never failing due to missing linkage records.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement a conditional Motoko state migration (backend/migration.mo) if required by the membership storage change, so existing deployed state upgrades safely and existing ponds remain readable after upgrade.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix pond join/leave failing with 'user id not found' by making membership fully phrase-hash (userId) based",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}